#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTalk_Barret

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function BattleTalk_Barret.BattleTalk_Barret_C.OnNotify
// 0x0030 (0x0030 - 0x0000)
struct BattleTalk_Barret_C_OnNotify final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          ownerChara;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnNotify_ReturnValue;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBattleSceneID_ReturnValue;             // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAIBranch2                                 CallFunc_RatioBranch2_OutSignal;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBattleCountLogIntByBP_ReturnValue;     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTalk_Barret_C_OnNotify) == 0x000008, "Wrong alignment on BattleTalk_Barret_C_OnNotify");
static_assert(sizeof(BattleTalk_Barret_C_OnNotify) == 0x000030, "Wrong size on BattleTalk_Barret_C_OnNotify");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, AnimName) == 0x000000, "Member 'BattleTalk_Barret_C_OnNotify::AnimName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, SoundName) == 0x000008, "Member 'BattleTalk_Barret_C_OnNotify::SoundName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, ownerChara) == 0x000010, "Member 'BattleTalk_Barret_C_OnNotify::ownerChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, ReturnValue) == 0x000018, "Member 'BattleTalk_Barret_C_OnNotify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, CallFunc_OnNotify_ReturnValue) == 0x000019, "Member 'BattleTalk_Barret_C_OnNotify::CallFunc_OnNotify_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, K2Node_SwitchName_CmpSuccess) == 0x00001A, "Member 'BattleTalk_Barret_C_OnNotify::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, CallFunc_GetBattleSceneID_ReturnValue) == 0x00001C, "Member 'BattleTalk_Barret_C_OnNotify::CallFunc_GetBattleSceneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, CallFunc_RatioBranch2_OutSignal) == 0x000024, "Member 'BattleTalk_Barret_C_OnNotify::CallFunc_RatioBranch2_OutSignal' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, CallFunc_GetBattleCountLogIntByBP_ReturnValue) == 0x000028, "Member 'BattleTalk_Barret_C_OnNotify::CallFunc_GetBattleCountLogIntByBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'BattleTalk_Barret_C_OnNotify::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotify, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002D, "Member 'BattleTalk_Barret_C_OnNotify::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BattleTalk_Barret.BattleTalk_Barret_C.OnNotifyWithAbility
// 0x0238 (0x0238 - 0x0000)
struct BattleTalk_Barret_C_OnNotifyWithAbility final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          ownerChara;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          targetChara;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityID;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndDataTableBattleAbility             dataTableBattleAbility;                            // 0x0028(0x01F0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bFinishBlow;                                       // 0x0218(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0219(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   btv_pc0001;                                        // 0x021C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetBattleSceneID_ReturnValue;             // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnNotifyWithAbility_ReturnValue;          // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAIPC_ReturnValue;                       // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0236(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattleTalk_Barret_C_OnNotifyWithAbility) == 0x000008, "Wrong alignment on BattleTalk_Barret_C_OnNotifyWithAbility");
static_assert(sizeof(BattleTalk_Barret_C_OnNotifyWithAbility) == 0x000238, "Wrong size on BattleTalk_Barret_C_OnNotifyWithAbility");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, AnimName) == 0x000000, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::AnimName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, SoundName) == 0x000008, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::SoundName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, ownerChara) == 0x000010, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::ownerChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, targetChara) == 0x000018, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::targetChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, AbilityID) == 0x000020, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::AbilityID' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, dataTableBattleAbility) == 0x000028, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::dataTableBattleAbility' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, bFinishBlow) == 0x000218, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::bFinishBlow' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, ReturnValue) == 0x000219, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, btv_pc0001) == 0x00021C, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::btv_pc0001' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, CallFunc_GetBattleSceneID_ReturnValue) == 0x000224, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::CallFunc_GetBattleSceneID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00022C, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, CallFunc_OnNotifyWithAbility_ReturnValue) == 0x00022D, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::CallFunc_OnNotifyWithAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000230, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, CallFunc_IsAIPC_ReturnValue) == 0x000234, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::CallFunc_IsAIPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, K2Node_SwitchInteger_CmpSuccess) == 0x000235, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Barret_C_OnNotifyWithAbility, CallFunc_BooleanAND_ReturnValue) == 0x000236, "Member 'BattleTalk_Barret_C_OnNotifyWithAbility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

