#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTalkOnEndBattle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BattleTalkOnEndBattle.BattleTalkOnEndBattle_C
// 0x0038 (0x0438 - 0x0400)
class ABattleTalkOnEndBattle_C final : public AEndBattleTalkOnEndBattleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0408(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         ActivePartyMemberCount;                            // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CanTalkMemberCount;                                // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DangerHPMemberCount;                               // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WinType;                                           // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanTalkMember_Cloud;                               // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanTalkMember_Barret;                              // 0x0421(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanTalkMember_Tifa;                                // 0x0422(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanTalkMember_Aerith;                              // 0x0423(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         __MaskedTwinTalkRatio;                             // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanTalkMember_Yuffie;                              // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanTalkMember_Sonon;                               // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42A[0x2];                                      // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RatioSolo_plus;                                    // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RatioTwin_plus;                                    // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattleTalkOnEndBattle(int32 EntryPoint);
	void YuffieToSonon_00();
	void Sonon_Solo();
	void Yuffie_Solo();
	void Plus_TalkCheckAll();
	void WinWithDieSoloTalkMemberRevCK();
	void Pair_TifaAndAerith();
	void Pair_BarretAndAerith();
	void Pair_BarretAndTifa();
	void Pair_CloudAndAerith();
	void Pair_CloudAndTifa();
	void Pair_CloudAndBarret();
	void RandomTalkCheck3();
	void AerithToTifa_00();
	void AerithToBarret_00();
	void AerithToCloud_00();
	void TifaToAerith_00();
	void TifaToBarret_00();
	void TifaToCloud_00();
	void BarretToAerith_00();
	void BarretToTifa_00();
	void CloudToAerith_00();
	void CloudToTifa_00();
	void OnEndBattle(class FName BattleSceneID, EndBattleExitBattleSceneType BattleExitType);
	void Aerith_Solo();
	void Barret_Solo();
	void BarretToCloud_00();
	void BarretToCloud_01();
	void Cloud_Solo();
	void CloudToBarret_00();
	void CloudToBarret_01();
	void ForceLeaderSolo();
	void NarrowWinSoloTalk();
	void NormalWinSoloTalk();
	void RandomTalkCheck2();
	void RandomTalkCheckWithDie2();
	void SoloTalkCheck();
	void Tifa_Solo();
	void UserConstructionScript();
	void WinWithDieSoloTalkLeader();
	void WinWithDieSoloTalkMember();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleTalkOnEndBattle_C">();
	}
	static class ABattleTalkOnEndBattle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABattleTalkOnEndBattle_C>();
	}
};
static_assert(alignof(ABattleTalkOnEndBattle_C) == 0x000008, "Wrong alignment on ABattleTalkOnEndBattle_C");
static_assert(sizeof(ABattleTalkOnEndBattle_C) == 0x000438, "Wrong size on ABattleTalkOnEndBattle_C");
static_assert(offsetof(ABattleTalkOnEndBattle_C, UberGraphFrame) == 0x000400, "Member 'ABattleTalkOnEndBattle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, DefaultSceneRoot) == 0x000408, "Member 'ABattleTalkOnEndBattle_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, ActivePartyMemberCount) == 0x000410, "Member 'ABattleTalkOnEndBattle_C::ActivePartyMemberCount' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, CanTalkMemberCount) == 0x000414, "Member 'ABattleTalkOnEndBattle_C::CanTalkMemberCount' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, DangerHPMemberCount) == 0x000418, "Member 'ABattleTalkOnEndBattle_C::DangerHPMemberCount' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, WinType) == 0x00041C, "Member 'ABattleTalkOnEndBattle_C::WinType' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, CanTalkMember_Cloud) == 0x000420, "Member 'ABattleTalkOnEndBattle_C::CanTalkMember_Cloud' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, CanTalkMember_Barret) == 0x000421, "Member 'ABattleTalkOnEndBattle_C::CanTalkMember_Barret' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, CanTalkMember_Tifa) == 0x000422, "Member 'ABattleTalkOnEndBattle_C::CanTalkMember_Tifa' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, CanTalkMember_Aerith) == 0x000423, "Member 'ABattleTalkOnEndBattle_C::CanTalkMember_Aerith' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, __MaskedTwinTalkRatio) == 0x000424, "Member 'ABattleTalkOnEndBattle_C::__MaskedTwinTalkRatio' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, CanTalkMember_Yuffie) == 0x000428, "Member 'ABattleTalkOnEndBattle_C::CanTalkMember_Yuffie' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, CanTalkMember_Sonon) == 0x000429, "Member 'ABattleTalkOnEndBattle_C::CanTalkMember_Sonon' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, RatioSolo_plus) == 0x00042C, "Member 'ABattleTalkOnEndBattle_C::RatioSolo_plus' has a wrong offset!");
static_assert(offsetof(ABattleTalkOnEndBattle_C, RatioTwin_plus) == 0x000430, "Member 'ABattleTalkOnEndBattle_C::RatioTwin_plus' has a wrong offset!");

}

