#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleText_02

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleText_02.BattleText_02_C
// 0x0080 (0x0780 - 0x0700)
class UBattleText_02_C final : public UEndPopupMessage
{
public:
	class UWidgetAnimation*                       Danger_Out;                                        // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Danger_Loop;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Recover_Color;                                     // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Miss_Color;                                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enemy_Color;                                       // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Party_Color;                                       // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reject_In;                                         // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Parry_Out;                                         // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Parry_In;                                          // 0x0740(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0748(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_Out;                                        // 0x0750(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_In;                                         // 0x0758(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All;                                               // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG_00;                                         // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl;                                               // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Number;                                        // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleText_02_C">();
	}
	static class UBattleText_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleText_02_C>();
	}
};
static_assert(alignof(UBattleText_02_C) == 0x000008, "Wrong alignment on UBattleText_02_C");
static_assert(sizeof(UBattleText_02_C) == 0x000780, "Wrong size on UBattleText_02_C");
static_assert(offsetof(UBattleText_02_C, Danger_Out) == 0x000700, "Member 'UBattleText_02_C::Danger_Out' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Danger_Loop) == 0x000708, "Member 'UBattleText_02_C::Danger_Loop' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Recover_Color) == 0x000710, "Member 'UBattleText_02_C::Recover_Color' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Miss_Color) == 0x000718, "Member 'UBattleText_02_C::Miss_Color' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Enemy_Color) == 0x000720, "Member 'UBattleText_02_C::Enemy_Color' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Party_Color) == 0x000728, "Member 'UBattleText_02_C::Party_Color' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Reject_In) == 0x000730, "Member 'UBattleText_02_C::Reject_In' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Parry_Out) == 0x000738, "Member 'UBattleText_02_C::Parry_Out' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Parry_In) == 0x000740, "Member 'UBattleText_02_C::Parry_In' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Loop) == 0x000748, "Member 'UBattleText_02_C::Loop' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Normal_Out) == 0x000750, "Member 'UBattleText_02_C::Normal_Out' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Normal_In) == 0x000758, "Member 'UBattleText_02_C::Normal_In' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, All) == 0x000760, "Member 'UBattleText_02_C::All' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Img_BG_00) == 0x000768, "Member 'UBattleText_02_C::Img_BG_00' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Pnl) == 0x000770, "Member 'UBattleText_02_C::Pnl' has a wrong offset!");
static_assert(offsetof(UBattleText_02_C, Txt_Number) == 0x000778, "Member 'UBattleText_02_C::Txt_Number' has a wrong offset!");

}

