#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleText_03

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleText_03.BattleText_03_C
// 0x0090 (0x03F0 - 0x0360)
class UBattleText_03_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       MateriaSlotUp_In;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkillUp_In;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Learning_In;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Materia_In;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Weapon_In;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_BattleText_01;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Base;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Learning;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Level;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Materia;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_Particle;                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Weapon;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_SkillUpBase;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Txt;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LevelUp;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleText_03_C">();
	}
	static class UBattleText_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleText_03_C>();
	}
};
static_assert(alignof(UBattleText_03_C) == 0x000008, "Wrong alignment on UBattleText_03_C");
static_assert(sizeof(UBattleText_03_C) == 0x0003F0, "Wrong size on UBattleText_03_C");
static_assert(offsetof(UBattleText_03_C, MateriaSlotUp_In) == 0x000360, "Member 'UBattleText_03_C::MateriaSlotUp_In' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, SkillUp_In) == 0x000368, "Member 'UBattleText_03_C::SkillUp_In' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Learning_In) == 0x000370, "Member 'UBattleText_03_C::Learning_In' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Materia_In) == 0x000378, "Member 'UBattleText_03_C::Materia_In' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Weapon_In) == 0x000380, "Member 'UBattleText_03_C::Weapon_In' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, In) == 0x000388, "Member 'UBattleText_03_C::In' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, All_BattleText_01) == 0x000390, "Member 'UBattleText_03_C::All_BattleText_01' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_Base) == 0x000398, "Member 'UBattleText_03_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_Effect_00) == 0x0003A0, "Member 'UBattleText_03_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_Effect_01) == 0x0003A8, "Member 'UBattleText_03_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_Effect_Learning) == 0x0003B0, "Member 'UBattleText_03_C::Img_Effect_Learning' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_Effect_Level) == 0x0003B8, "Member 'UBattleText_03_C::Img_Effect_Level' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_Effect_Materia) == 0x0003C0, "Member 'UBattleText_03_C::Img_Effect_Materia' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_Effect_Particle) == 0x0003C8, "Member 'UBattleText_03_C::Img_Effect_Particle' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_Effect_Weapon) == 0x0003D0, "Member 'UBattleText_03_C::Img_Effect_Weapon' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Img_SkillUpBase) == 0x0003D8, "Member 'UBattleText_03_C::Img_SkillUpBase' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Nut_Txt) == 0x0003E0, "Member 'UBattleText_03_C::Nut_Txt' has a wrong offset!");
static_assert(offsetof(UBattleText_03_C, Txt_LevelUp) == 0x0003E8, "Member 'UBattleText_03_C::Txt_LevelUp' has a wrong offset!");

}

