#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleText_Number

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleText_Number.BattleText_Number_C
// 0x0038 (0x0398 - 0x0360)
class UBattleText_Number_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Summon_Loop;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Continued_In;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Burst_In;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_Out;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_In;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndNumberLabel*                        Number;                                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleText_Number_C">();
	}
	static class UBattleText_Number_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleText_Number_C>();
	}
};
static_assert(alignof(UBattleText_Number_C) == 0x000008, "Wrong alignment on UBattleText_Number_C");
static_assert(sizeof(UBattleText_Number_C) == 0x000398, "Wrong size on UBattleText_Number_C");
static_assert(offsetof(UBattleText_Number_C, Summon_Loop) == 0x000360, "Member 'UBattleText_Number_C::Summon_Loop' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Continued_In) == 0x000368, "Member 'UBattleText_Number_C::Continued_In' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Burst_In) == 0x000370, "Member 'UBattleText_Number_C::Burst_In' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Normal_Out) == 0x000378, "Member 'UBattleText_Number_C::Normal_Out' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Loop) == 0x000380, "Member 'UBattleText_Number_C::Loop' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Normal_In) == 0x000388, "Member 'UBattleText_Number_C::Normal_In' has a wrong offset!");
static_assert(offsetof(UBattleText_Number_C, Number) == 0x000390, "Member 'UBattleText_Number_C::Number' has a wrong offset!");

}

