#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleText_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattleText_00.BattleText_00_C
// 0x0078 (0x0778 - 0x0700)
class UBattleText_00_C final : public UEndPopupMessage
{
public:
	class UWidgetAnimation*                       Reject_In;                                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Linkage_In;                                        // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Parry_Out;                                         // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Parry_In;                                          // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_Out;                                        // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Continued_In;                                      // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal_In;                                         // 0x0738(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_BattleText;                                    // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             All_Nut_BattleText;                                // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_ResistArrow;                                   // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_BattleText;                                    // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Guard;                                         // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Magni;                                         // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Number;                                        // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattleText_00_C">();
	}
	static class UBattleText_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleText_00_C>();
	}
};
static_assert(alignof(UBattleText_00_C) == 0x000008, "Wrong alignment on UBattleText_00_C");
static_assert(sizeof(UBattleText_00_C) == 0x000778, "Wrong size on UBattleText_00_C");
static_assert(offsetof(UBattleText_00_C, Reject_In) == 0x000700, "Member 'UBattleText_00_C::Reject_In' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Linkage_In) == 0x000708, "Member 'UBattleText_00_C::Linkage_In' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Parry_Out) == 0x000710, "Member 'UBattleText_00_C::Parry_Out' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Parry_In) == 0x000718, "Member 'UBattleText_00_C::Parry_In' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Loop) == 0x000720, "Member 'UBattleText_00_C::Loop' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Normal_Out) == 0x000728, "Member 'UBattleText_00_C::Normal_Out' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Continued_In) == 0x000730, "Member 'UBattleText_00_C::Continued_In' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Normal_In) == 0x000738, "Member 'UBattleText_00_C::Normal_In' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, All_BattleText) == 0x000740, "Member 'UBattleText_00_C::All_BattleText' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, All_Nut_BattleText) == 0x000748, "Member 'UBattleText_00_C::All_Nut_BattleText' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Img_ResistArrow) == 0x000750, "Member 'UBattleText_00_C::Img_ResistArrow' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Pnl_BattleText) == 0x000758, "Member 'UBattleText_00_C::Pnl_BattleText' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Txt_Guard) == 0x000760, "Member 'UBattleText_00_C::Txt_Guard' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Txt_Magni) == 0x000768, "Member 'UBattleText_00_C::Txt_Magni' has a wrong offset!");
static_assert(offsetof(UBattleText_00_C, Txt_Number) == 0x000770, "Member 'UBattleText_00_C::Txt_Number' has a wrong offset!");

}

