#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattleTalk_Base

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function BattleTalk_Base.BattleTalk_Base_C.OnNotifyWithAbility
// 0x06C0 (0x06C0 - 0x0000)
struct BattleTalk_Base_C_OnNotifyWithAbility final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          ownerChara;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          targetChara;                                       // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityID;                                         // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndDataTableBattleAbility             dataTableBattleAbility;                            // 0x0028(0x01F0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bFinishBlow;                                       // 0x0218(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0219(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CanTwinTalkDistance;                               // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RatioItem_TwinTalk;                                // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RatioItem_SoloTalk;                                // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RatioMagic_TwinTalk;                               // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RatioMagic_SoloTalk;                               // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Heal_RaiseOwnerChara;                              // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Heal_RaiseTargetChara;                             // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 OwnerCharaTalkStatePrefix;                         // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue2;                    // 0x0276(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue3;                    // 0x0277(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue4;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString2_CmpSuccess;                   // 0x029A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29B[0x5];                                      // 0x029B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue2;                         // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString3_CmpSuccess;                   // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString4_CmpSuccess;                   // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString5_CmpSuccess;                   // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString6_CmpSuccess;                   // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString7_CmpSuccess;                   // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString8_CmpSuccess;                   // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString9_CmpSuccess;                   // 0x02C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C7[0x1];                                      // 0x02C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Mid_ReturnValue3;                         // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayer_ReturnValue2;                    // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString10_CmpSuccess;                  // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayer_ReturnValue3;                    // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayer_ReturnValue4;                    // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayer_ReturnValue5;                    // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue;                // 0x02DF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue2;               // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue3;               // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x02E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E7[0x1];                                      // 0x02E7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue3;           // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue5;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0300(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0318(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue2;           // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue3;           // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x0348(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x0358(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue4;           // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue5;           // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0378(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue6;           // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue7;               // 0x0390(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue7;           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue8;               // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue8;           // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue9;               // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue9;           // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue10;              // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue10;          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue11;              // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue11;          // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue12;              // 0x0408(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue12;          // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue13;              // 0x0420(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue13;          // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue14;              // 0x0438(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue14;          // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue15;              // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue15;          // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AEndCharacter*>                  CallFunc_GetPartyMembersIgnoreDead_ReturnValue;    // 0x0468(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_47D[0x3];                                      // 0x047D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue16;              // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue16;          // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue17;              // 0x0498(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue17;          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue18;              // 0x04B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue18;          // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue19;              // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue19;          // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue20;              // 0x04E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue20;          // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue21;              // 0x04F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue21;          // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue22;              // 0x0510(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue22;          // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue23;              // 0x0528(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue23;          // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue24;              // 0x0540(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue24;          // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue25;              // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue25;          // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue26;              // 0x0570(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue26;          // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue27;              // 0x0588(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue27;          // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue28;              // 0x05A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue28;          // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue29;              // 0x05B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue29;          // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue30;              // 0x05D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue30;          // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue31;              // 0x05E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue31;          // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue32;              // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue32;          // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue33;              // 0x0618(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue33;          // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue34;              // 0x0630(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue34;          // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue35;              // 0x0648(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue35;          // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue36;              // 0x0660(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue36;          // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue37;              // 0x0678(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue37;          // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue38;              // 0x0690(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue38;          // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue39;              // 0x06A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue39;          // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattleTalk_Base_C_OnNotifyWithAbility) == 0x000008, "Wrong alignment on BattleTalk_Base_C_OnNotifyWithAbility");
static_assert(sizeof(BattleTalk_Base_C_OnNotifyWithAbility) == 0x0006C0, "Wrong size on BattleTalk_Base_C_OnNotifyWithAbility");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, AnimName) == 0x000000, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::AnimName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, SoundName) == 0x000008, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::SoundName' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, ownerChara) == 0x000010, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::ownerChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, targetChara) == 0x000018, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::targetChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, AbilityID) == 0x000020, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::AbilityID' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, dataTableBattleAbility) == 0x000028, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::dataTableBattleAbility' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, bFinishBlow) == 0x000218, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::bFinishBlow' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, ReturnValue) == 0x000219, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CanTwinTalkDistance) == 0x00021C, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CanTwinTalkDistance' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, RatioItem_TwinTalk) == 0x000220, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::RatioItem_TwinTalk' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, RatioItem_SoloTalk) == 0x000224, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::RatioItem_SoloTalk' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, RatioMagic_TwinTalk) == 0x000228, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::RatioMagic_TwinTalk' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, RatioMagic_SoloTalk) == 0x00022C, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::RatioMagic_SoloTalk' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, Heal_RaiseOwnerChara) == 0x000230, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::Heal_RaiseOwnerChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, Heal_RaiseTargetChara) == 0x000240, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::Heal_RaiseTargetChara' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, OwnerCharaTalkStatePrefix) == 0x000250, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::OwnerCharaTalkStatePrefix' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_NameToString_ReturnValue) == 0x000260, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000270, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Contains_ReturnValue) == 0x000274, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchInteger_CmpSuccess) == 0x000275, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Contains_ReturnValue2) == 0x000276, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Contains_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Contains_ReturnValue3) == 0x000277, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Contains_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Contains_ReturnValue4) == 0x000278, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Contains_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_ByteToInt_ReturnValue2) == 0x00027C, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_ByteToInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchInteger2_CmpSuccess) == 0x000280, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchInteger2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_NameToString_ReturnValue2) == 0x000288, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_NameToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_IsPlayer_ReturnValue) == 0x000298, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString_CmpSuccess) == 0x000299, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString2_CmpSuccess) == 0x00029A, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Mid_ReturnValue) == 0x0002A0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Mid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Mid_ReturnValue2) == 0x0002B0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Mid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString3_CmpSuccess) == 0x0002C0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString4_CmpSuccess) == 0x0002C1, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString4_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString5_CmpSuccess) == 0x0002C2, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString5_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString6_CmpSuccess) == 0x0002C3, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString6_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString7_CmpSuccess) == 0x0002C4, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString7_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString8_CmpSuccess) == 0x0002C5, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString8_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString9_CmpSuccess) == 0x0002C6, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString9_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Mid_ReturnValue3) == 0x0002C8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Mid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_IsPlayer_ReturnValue2) == 0x0002D8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_IsPlayer_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchString10_CmpSuccess) == 0x0002D9, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchString10_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_IsPlayer_ReturnValue3) == 0x0002DA, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_IsPlayer_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_IsPlayer_ReturnValue4) == 0x0002DB, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_IsPlayer_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_IsPlayer_ReturnValue5) == 0x0002DC, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_IsPlayer_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002DD, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_BooleanOR_ReturnValue) == 0x0002DE, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_GetPlayerType_ReturnValue) == 0x0002DF, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_GetPlayerType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchEnum_CmpSuccess) == 0x0002E0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_GetPlayerType_ReturnValue2) == 0x0002E1, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_GetPlayerType_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_EqualEqual_ObjectObject_ReturnValue2) == 0x0002E2, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_EqualEqual_ObjectObject_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchEnum2_CmpSuccess) == 0x0002E3, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_BooleanOR_ReturnValue2) == 0x0002E4, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_GetPlayerType_ReturnValue3) == 0x0002E5, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_GetPlayerType_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, K2Node_SwitchEnum3_CmpSuccess) == 0x0002E6, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_NameToString_ReturnValue3) == 0x0002E8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_NameToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Contains_ReturnValue5) == 0x0002F8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Contains_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue) == 0x000300, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue) == 0x000310, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue2) == 0x000318, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue2) == 0x000328, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue3) == 0x000330, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue3) == 0x000340, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue3' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue4) == 0x000348, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue5) == 0x000358, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue4) == 0x000368, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue4' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue5) == 0x000370, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue5' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue6) == 0x000378, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue6) == 0x000388, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue6' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue7) == 0x000390, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue7) == 0x0003A0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue7' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue8) == 0x0003A8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue8) == 0x0003B8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue8' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue9) == 0x0003C0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue9) == 0x0003D0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue9' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue10) == 0x0003D8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue10) == 0x0003E8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue10' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue11) == 0x0003F0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue11) == 0x000400, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue11' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue12) == 0x000408, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue12) == 0x000418, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue12' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue13) == 0x000420, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue13) == 0x000430, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue13' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue14) == 0x000438, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue14) == 0x000448, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue14' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue15) == 0x000450, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue15) == 0x000460, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue15' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_GetPartyMembersIgnoreDead_ReturnValue) == 0x000468, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_GetPartyMembersIgnoreDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Array_LastIndex_ReturnValue) == 0x000478, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Greater_IntInt_ReturnValue) == 0x00047C, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue16) == 0x000480, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue16) == 0x000490, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue16' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue17) == 0x000498, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue17' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue17) == 0x0004A8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue17' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue18) == 0x0004B0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue18' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue18) == 0x0004C0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue18' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue19) == 0x0004C8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue19' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue19) == 0x0004D8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue19' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue20) == 0x0004E0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue20' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue20) == 0x0004F0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue20' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue21) == 0x0004F8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue21' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue21) == 0x000508, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue21' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue22) == 0x000510, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue22' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue22) == 0x000520, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue22' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue23) == 0x000528, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue23' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue23) == 0x000538, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue23' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue24) == 0x000540, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue24' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue24) == 0x000550, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue24' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue25) == 0x000558, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue25' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue25) == 0x000568, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue25' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue26) == 0x000570, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue26' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue26) == 0x000580, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue26' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue27) == 0x000588, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue27' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue27) == 0x000598, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue27' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue28) == 0x0005A0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue28' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue28) == 0x0005B0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue28' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue29) == 0x0005B8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue29' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue29) == 0x0005C8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue29' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue30) == 0x0005D0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue30' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue30) == 0x0005E0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue30' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue31) == 0x0005E8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue31' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue31) == 0x0005F8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue31' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue32) == 0x000600, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue32' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue32) == 0x000610, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue32' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue33) == 0x000618, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue33' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue33) == 0x000628, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue33' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue34) == 0x000630, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue34' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue34) == 0x000640, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue34' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue35) == 0x000648, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue35' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue35) == 0x000658, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue35' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue36) == 0x000660, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue36' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue36) == 0x000670, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue36' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue37) == 0x000678, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue37' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue37) == 0x000688, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue37' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue38) == 0x000690, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue38' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue38) == 0x0006A0, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue38' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Concat_StrStr_ReturnValue39) == 0x0006A8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Concat_StrStr_ReturnValue39' has a wrong offset!");
static_assert(offsetof(BattleTalk_Base_C_OnNotifyWithAbility, CallFunc_Conv_StringToName_ReturnValue39) == 0x0006B8, "Member 'BattleTalk_Base_C_OnNotifyWithAbility::CallFunc_Conv_StringToName_ReturnValue39' has a wrong offset!");

// Function BattleTalk_Base.BattleTalk_Base_C.OnNotify
// 0x0138 (0x0138 - 0x0000)
struct BattleTalk_Base_C_OnNotify final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SoundName;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          ownerChara;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPartyLeaderName_ReturnValue;           // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActorName_ReturnValue;                 // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActorName_ReturnValue2;                // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActorName_ReturnValue3;                // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue2;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue3;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString2_CmpSuccess;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString3_CmpSuccess;                   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActorName_ReturnValue4;                // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasStatusChangeFromChara_ReturnValue;     // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue4;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString4_CmpSuccess;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
