#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BodyDriverPlugin

#include "Basic.hpp"

#include "BodyDriverPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class BodyDriverPlugin.BodyDriver_DebugImpulseTuningSet
// 0x0048 (0x0078 - 0x0030)
class UBodyDriver_DebugImpulseTuningSet final : public UDataAsset
{
public:
	float                                         ForceSwitchToAnimTime;                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableRandomImpulses;                              // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TreatAsMelee;                                      // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TreatAsExplosion;                                  // 0x0036(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBodyDriverMessageType                        ImpulseType;                                       // 0x0037(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Frequency;                                         // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyApplyOncePerActivation;                        // 0x003C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyWhenInactive;                                 // 0x003D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyWhenUnbalanced;                               // 0x003E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaitToApplyAfterBalancing;                         // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChanceOfWeakRandomImpulse;                         // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChanceOfStrongRandomImpulse;                       // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChanceOfMeleeMediumRandomImpulse;                  // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EeBodyParts                                   PartOverride;                                      // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseOverrideImpulseDirection;                       // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ImpulseDirectionOverride;                          // 0x0054(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ImpulseDirectionOverrideTransOffset;               // 0x0060(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseLastAppliedImpulse;                             // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableClickImpulses;                               // 0x006D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChanceOfWeakClickImpulse;                          // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ChanceOfStrongClickImpulse;                        // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BodyDriver_DebugImpulseTuningSet">();
	}
	static class UBodyDriver_DebugImpulseTuningSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyDriver_DebugImpulseTuningSet>();
	}
};
static_assert(alignof(UBodyDriver_DebugImpulseTuningSet) == 0x000008, "Wrong alignment on UBodyDriver_DebugImpulseTuningSet");
static_assert(sizeof(UBodyDriver_DebugImpulseTuningSet) == 0x000078, "Wrong size on UBodyDriver_DebugImpulseTuningSet");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ForceSwitchToAnimTime) == 0x000030, "Member 'UBodyDriver_DebugImpulseTuningSet::ForceSwitchToAnimTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, EnableRandomImpulses) == 0x000034, "Member 'UBodyDriver_DebugImpulseTuningSet::EnableRandomImpulses' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, TreatAsMelee) == 0x000035, "Member 'UBodyDriver_DebugImpulseTuningSet::TreatAsMelee' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, TreatAsExplosion) == 0x000036, "Member 'UBodyDriver_DebugImpulseTuningSet::TreatAsExplosion' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ImpulseType) == 0x000037, "Member 'UBodyDriver_DebugImpulseTuningSet::ImpulseType' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, Frequency) == 0x000038, "Member 'UBodyDriver_DebugImpulseTuningSet::Frequency' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, OnlyApplyOncePerActivation) == 0x00003C, "Member 'UBodyDriver_DebugImpulseTuningSet::OnlyApplyOncePerActivation' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ApplyWhenInactive) == 0x00003D, "Member 'UBodyDriver_DebugImpulseTuningSet::ApplyWhenInactive' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ApplyWhenUnbalanced) == 0x00003E, "Member 'UBodyDriver_DebugImpulseTuningSet::ApplyWhenUnbalanced' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, WaitToApplyAfterBalancing) == 0x000040, "Member 'UBodyDriver_DebugImpulseTuningSet::WaitToApplyAfterBalancing' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ChanceOfWeakRandomImpulse) == 0x000044, "Member 'UBodyDriver_DebugImpulseTuningSet::ChanceOfWeakRandomImpulse' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ChanceOfStrongRandomImpulse) == 0x000048, "Member 'UBodyDriver_DebugImpulseTuningSet::ChanceOfStrongRandomImpulse' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ChanceOfMeleeMediumRandomImpulse) == 0x00004C, "Member 'UBodyDriver_DebugImpulseTuningSet::ChanceOfMeleeMediumRandomImpulse' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, PartOverride) == 0x000050, "Member 'UBodyDriver_DebugImpulseTuningSet::PartOverride' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, UseOverrideImpulseDirection) == 0x000051, "Member 'UBodyDriver_DebugImpulseTuningSet::UseOverrideImpulseDirection' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ImpulseDirectionOverride) == 0x000054, "Member 'UBodyDriver_DebugImpulseTuningSet::ImpulseDirectionOverride' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ImpulseDirectionOverrideTransOffset) == 0x000060, "Member 'UBodyDriver_DebugImpulseTuningSet::ImpulseDirectionOverrideTransOffset' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, UseLastAppliedImpulse) == 0x00006C, "Member 'UBodyDriver_DebugImpulseTuningSet::UseLastAppliedImpulse' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, EnableClickImpulses) == 0x00006D, "Member 'UBodyDriver_DebugImpulseTuningSet::EnableClickImpulses' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ChanceOfWeakClickImpulse) == 0x000070, "Member 'UBodyDriver_DebugImpulseTuningSet::ChanceOfWeakClickImpulse' has a wrong offset!");
static_assert(offsetof(UBodyDriver_DebugImpulseTuningSet, ChanceOfStrongClickImpulse) == 0x000074, "Member 'UBodyDriver_DebugImpulseTuningSet::ChanceOfStrongClickImpulse' has a wrong offset!");

// Class BodyDriverPlugin.InputObject_BodyDriver
// 0x0008 (0x0030 - 0x0028)
class UInputObject_BodyDriver final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InputObject_BodyDriver">();
	}
	static class UInputObject_BodyDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInputObject_BodyDriver>();
	}
};
static_assert(alignof(UInputObject_BodyDriver) == 0x000008, "Wrong alignment on UInputObject_BodyDriver");
static_assert(sizeof(UInputObject_BodyDriver) == 0x000030, "Wrong size on UInputObject_BodyDriver");

// Class BodyDriverPlugin.BodyDriver_BipedFallTuningSet
// 0x2100 (0x2130 - 0x0030)
class UBodyDriver_BipedFallTuningSet final : public UDataAsset
{
public:
	bool                                          OnlyUseSimpleRagdollMode;                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallenRagdollFriction;                             // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TrackDeathAnimationWhenSimpleRagdoll;              // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinActivationTime;                                 // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxActivationTime;                                 // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialTrackingStrength;                           // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TrackingStrengthBlendoutTime;                      // 0x0048(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialToMidDampingBlendTime;                      // 0x004C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MidToFinalDampingBlendTime;                        // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialDamping;                                    // 0x0054(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MidDamping;                                        // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FinalDamping;                                      // 0x005C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DisableAllHandlingBesidesStiffnessAndDamping;      // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FallenMaxHipToFootDistMult;                        // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallenAnkleLimitRatio;                             // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallenNeckLimitRatio;                              // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NeckDampingMult;                                   // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExtendElbowsWhenFallen;                            // 0x0074(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ShoulderLimitOpenRatioWhenFallen;                  // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PushHandsAwayFromChest;                            // 0x007C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ExtendSpineNeckHips;                               // 0x007D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AvoidFlayedArms;                                   // 0x007E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CorrectShoulder;                                   // 0x007F(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExplosion                             MediumExplosionData;                               // 0x0080(0x0348)(Edit, NativeAccessSpecifierPublic)
	struct FExplosion                             LaunchSmallCloseData;                              // 0x03C8(0x0348)(Edit, NativeAccessSpecifierPublic)
	struct FExplosion                             LaunchSmallFarData;                                // 0x0710(0x0348)(Edit, NativeAccessSpecifierPublic)
	struct FExplosion                             BlowSmallCloseData;                                // 0x0A58(0x0348)(Edit, NativeAccessSpecifierPublic)
	struct FExplosion                             BlowSmallFarData;                                  // 0x0DA0(0x0348)(Edit, NativeAccessSpecifierPublic)
	struct FExplosion                             StrikeData;                                        // 0x10E8(0x0348)(Edit, NativeAccessSpecifierPublic)
	struct FExplosion                             FallFromBikeData;                                  // 0x1430(0x0348)(Edit, NativeAccessSpecifierPublic)
	float                                         RangeLimWindmill;                                  // 0x1778(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeightWindmill;                                    // 0x177C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindmillRampUpTime;                                // 0x1780(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StiffnessWindmill;                                 // 0x1784(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindmillJointSpeed;                                // 0x1788(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotationSpeedWindmill;                             // 0x178C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistWindmill;                                      // 0x1790(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RadWindmill;                                       // 0x1794(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardOffsetWindmill;                             // 0x1798(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpOffsetWindmill;                                  // 0x179C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindmillMaxLengthRatio;                            // 0x17A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsStartTime;                            // 0x17A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsRampUpTime;                           // 0x17A8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsStiffness;                            // 0x17AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsJointSpeed;                           // 0x17B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsFrontDistance;                        // 0x17B4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsBackDistance;                         // 0x17B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsSideDistance;                         // 0x17BC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsDownDistance;                         // 0x17C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionLegsKickSpeed;                            // 0x17C4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionTrackingStiffness;                        // 0x17C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionSpineStiffness;                           // 0x17CC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionStartRampTime;                            // 0x17D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionRampDuration;                             // 0x17D4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplosionTotalAngleChange;                         // 0x17D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17DC[0x4];                                     // 0x17DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FImpulse                               OverrideFallImpulseData;                           // 0x17E0(0x0160)(Edit, NativeAccessSpecifierPublic)
	struct FImpulse                               OverrideFallImpulseDataBullet;                     // 0x1940(0x0160)(Edit, NativeAccessSpecifierPublic)
	struct FExplosion                             ExplosionDataForMelee;                             // 0x1AA0(0x0348)(Edit, NativeAccessSpecifierPublic)
	struct FExplosion                             ExplosionDataForBullet;                            // 0x1DE8(0x0348)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"BodyDriver_BipedFallTuningSet">();
	}
	static class UBodyDriver_BipedFallTuningSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBodyDriver_BipedFallTuningSet>();
	}
};
static_assert(alignof(UBodyDriver_BipedFallTuningSet) == 0x000008, "Wrong alignment on UBodyDriver_BipedFallTuningSet");
static_assert(sizeof(UBodyDriver_BipedFallTuningSet) == 0x002130, "Wrong size on UBodyDriver_BipedFallTuningSet");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, OnlyUseSimpleRagdollMode) == 0x000030, "Member 'UBodyDriver_BipedFallTuningSet::OnlyUseSimpleRagdollMode' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, FallenRagdollFriction) == 0x000034, "Member 'UBodyDriver_BipedFallTuningSet::FallenRagdollFriction' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, TrackDeathAnimationWhenSimpleRagdoll) == 0x000038, "Member 'UBodyDriver_BipedFallTuningSet::TrackDeathAnimationWhenSimpleRagdoll' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, MinActivationTime) == 0x00003C, "Member 'UBodyDriver_BipedFallTuningSet::MinActivationTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, MaxActivationTime) == 0x000040, "Member 'UBodyDriver_BipedFallTuningSet::MaxActivationTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, InitialTrackingStrength) == 0x000044, "Member 'UBodyDriver_BipedFallTuningSet::InitialTrackingStrength' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, TrackingStrengthBlendoutTime) == 0x000048, "Member 'UBodyDriver_BipedFallTuningSet::TrackingStrengthBlendoutTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, InitialToMidDampingBlendTime) == 0x00004C, "Member 'UBodyDriver_BipedFallTuningSet::InitialToMidDampingBlendTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, MidToFinalDampingBlendTime) == 0x000050, "Member 'UBodyDriver_BipedFallTuningSet::MidToFinalDampingBlendTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, InitialDamping) == 0x000054, "Member 'UBodyDriver_BipedFallTuningSet::InitialDamping' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, MidDamping) == 0x000058, "Member 'UBodyDriver_BipedFallTuningSet::MidDamping' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, FinalDamping) == 0x00005C, "Member 'UBodyDriver_BipedFallTuningSet::FinalDamping' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, DisableAllHandlingBesidesStiffnessAndDamping) == 0x000060, "Member 'UBodyDriver_BipedFallTuningSet::DisableAllHandlingBesidesStiffnessAndDamping' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, FallenMaxHipToFootDistMult) == 0x000064, "Member 'UBodyDriver_BipedFallTuningSet::FallenMaxHipToFootDistMult' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, FallenAnkleLimitRatio) == 0x000068, "Member 'UBodyDriver_BipedFallTuningSet::FallenAnkleLimitRatio' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, FallenNeckLimitRatio) == 0x00006C, "Member 'UBodyDriver_BipedFallTuningSet::FallenNeckLimitRatio' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, NeckDampingMult) == 0x000070, "Member 'UBodyDriver_BipedFallTuningSet::NeckDampingMult' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExtendElbowsWhenFallen) == 0x000074, "Member 'UBodyDriver_BipedFallTuningSet::ExtendElbowsWhenFallen' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ShoulderLimitOpenRatioWhenFallen) == 0x000078, "Member 'UBodyDriver_BipedFallTuningSet::ShoulderLimitOpenRatioWhenFallen' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, PushHandsAwayFromChest) == 0x00007C, "Member 'UBodyDriver_BipedFallTuningSet::PushHandsAwayFromChest' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExtendSpineNeckHips) == 0x00007D, "Member 'UBodyDriver_BipedFallTuningSet::ExtendSpineNeckHips' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, AvoidFlayedArms) == 0x00007E, "Member 'UBodyDriver_BipedFallTuningSet::AvoidFlayedArms' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, CorrectShoulder) == 0x00007F, "Member 'UBodyDriver_BipedFallTuningSet::CorrectShoulder' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, MediumExplosionData) == 0x000080, "Member 'UBodyDriver_BipedFallTuningSet::MediumExplosionData' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, LaunchSmallCloseData) == 0x0003C8, "Member 'UBodyDriver_BipedFallTuningSet::LaunchSmallCloseData' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, LaunchSmallFarData) == 0x000710, "Member 'UBodyDriver_BipedFallTuningSet::LaunchSmallFarData' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, BlowSmallCloseData) == 0x000A58, "Member 'UBodyDriver_BipedFallTuningSet::BlowSmallCloseData' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, BlowSmallFarData) == 0x000DA0, "Member 'UBodyDriver_BipedFallTuningSet::BlowSmallFarData' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, StrikeData) == 0x0010E8, "Member 'UBodyDriver_BipedFallTuningSet::StrikeData' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, FallFromBikeData) == 0x001430, "Member 'UBodyDriver_BipedFallTuningSet::FallFromBikeData' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, RangeLimWindmill) == 0x001778, "Member 'UBodyDriver_BipedFallTuningSet::RangeLimWindmill' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, WeightWindmill) == 0x00177C, "Member 'UBodyDriver_BipedFallTuningSet::WeightWindmill' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, WindmillRampUpTime) == 0x001780, "Member 'UBodyDriver_BipedFallTuningSet::WindmillRampUpTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, StiffnessWindmill) == 0x001784, "Member 'UBodyDriver_BipedFallTuningSet::StiffnessWindmill' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, WindmillJointSpeed) == 0x001788, "Member 'UBodyDriver_BipedFallTuningSet::WindmillJointSpeed' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, RotationSpeedWindmill) == 0x00178C, "Member 'UBodyDriver_BipedFallTuningSet::RotationSpeedWindmill' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, DistWindmill) == 0x001790, "Member 'UBodyDriver_BipedFallTuningSet::DistWindmill' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, RadWindmill) == 0x001794, "Member 'UBodyDriver_BipedFallTuningSet::RadWindmill' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ForwardOffsetWindmill) == 0x001798, "Member 'UBodyDriver_BipedFallTuningSet::ForwardOffsetWindmill' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, UpOffsetWindmill) == 0x00179C, "Member 'UBodyDriver_BipedFallTuningSet::UpOffsetWindmill' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, WindmillMaxLengthRatio) == 0x0017A0, "Member 'UBodyDriver_BipedFallTuningSet::WindmillMaxLengthRatio' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsStartTime) == 0x0017A4, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsStartTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsRampUpTime) == 0x0017A8, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsRampUpTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsStiffness) == 0x0017AC, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsStiffness' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsJointSpeed) == 0x0017B0, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsJointSpeed' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsFrontDistance) == 0x0017B4, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsFrontDistance' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsBackDistance) == 0x0017B8, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsBackDistance' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsSideDistance) == 0x0017BC, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsSideDistance' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsDownDistance) == 0x0017C0, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsDownDistance' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionLegsKickSpeed) == 0x0017C4, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionLegsKickSpeed' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionTrackingStiffness) == 0x0017C8, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionTrackingStiffness' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionSpineStiffness) == 0x0017CC, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionSpineStiffness' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionStartRampTime) == 0x0017D0, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionStartRampTime' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionRampDuration) == 0x0017D4, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionRampDuration' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionTotalAngleChange) == 0x0017D8, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionTotalAngleChange' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, OverrideFallImpulseData) == 0x0017E0, "Member 'UBodyDriver_BipedFallTuningSet::OverrideFallImpulseData' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, OverrideFallImpulseDataBullet) == 0x001940, "Member 'UBodyDriver_BipedFallTuningSet::OverrideFallImpulseDataBullet' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionDataForMelee) == 0x001AA0, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionDataForMelee' has a wrong offset!");
static_assert(offsetof(UBodyDriver_BipedFallTuningSet, ExplosionDataForBullet) == 0x001DE8, "Member 'UBodyDriver_BipedFallTuningSet::ExplosionDataForBullet' has a wrong offset!");

// Class BodyDriverPlugin.BodyDriver_BipedBalanceTuningSet
// 0x0E00 (0x0E30 - 0x0030)
class UBodyDriver_BipedBalanceTuningSet final : public UDataAsset
{
public:
	struct FImpulse                               PushImpulseData;                                   // 0x0030(0x0160)(Edit, NativeAccessSpecifierPublic)
	struct FImpulse                               WeakImpulseData;                                   // 0x0190(0x0160)(Edit, NativeAccessSpecifierPublic)
	struct FImpulse                               MediumImpulseData;                                 // 0x02F0(0x0160)(Edit, NativeAccessSpecifierPublic)
	struct FImpulse                               StrongImpulseData;                                 // 0x0450(0x0160)(Edit, NativeAccessSpecifierPublic)
	struct FImpulse                               RunningImpulseData;                                // 0x05B0(0x0160)(Edit, NativeAccessSpecifierPublic)
	struct FImpulse                               MediumMeleeImpulseData;                            // 0x0710(0x0160)(Edit, NativeAccessSpecifierPublic)
	struct FImpulse                               RunningMeleeImpulseData;                           // 0x0870(0x0160)(Edit, NativeAccessSpecifierPublic)
	float                                         COMVelFac;                                         // 0x09D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseRampedCOMVelFac;                                // 0x09D4(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9D5[0x3];                                      // 0x09D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SideMultMin;                                       // 0x09D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HipHeightBlendRate;                                // 0x09DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngMagClampBoth;                                   // 0x09E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AngMagClampPlanar;                                 // 0x09E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinMagClampBoth;                                   // 0x09E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinDistPelvis;                                     // 0x09EC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDistPelvis;                                     // 0x09F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinUPMagClampBoth;                                 // 0x09F4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinUPMagMaxClampBoth;                              // 0x09F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LindampingMoving;                                  // 0x09FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LinUPdampingMoving;                                // 0x0A00(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisSpaceGoalUPClampDistMax;                     // 0x0A04(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisSpaceGoalPlanarClampDist;                    // 0x0A08(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootLandCompression;                               // 0x0A0C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoostHipOffset;                                    // 0x0A10(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxHipHeightOffset;                                // 0x0A14(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FacingBasedOnVelMinSpeed;                          // 0x0A18(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReduceDampingFightingDesiredDirection;             // 0x0A1C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncreaseDampingOverTime;                           // 0x0A1D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1E[0x2];                                      // 0x0A1E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StaggerRiseClamp;                                  // 0x0A20(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaggerRiseClampSwinging;                          // 0x0A24(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaggerRiseClampTwistedAndBehind;                  // 0x0A28(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaggerRiseClampWoundedLeg;                        // 0x0A2C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaggerUltimateFacingDirectionMagBothPlanted;      // 0x0A30(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StaggerUltimateFacingDirectionMagSwinging;         // 0x0A34(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxErrorStepNeutral;                               // 0x0A38(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShortestPlantMax;                                  // 0x0A3C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitTimeBetweenLiftPreps;                          // 0x0A40(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RequiredPlantedFeet;                               // 0x0A44(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPhaseComputeStep;                               // 0x0A48(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPhaseComputeStep;                               // 0x0A4C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RootPartSideOffset;                                // 0x0A50(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BufftopRange;                                      // 0x0A54(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuffbottomRange;                                   // 0x0A58(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BufftopVal;                                        // 0x0A5C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuffbottomVal;                                     // 0x0A60(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BuffAdditive;                                      // 0x0A64(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxErrorStepNeutralActual;                         // 0x0A68(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FinalStepSpeedThresh;                              // 0x0A6C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReducedSwingTimeMult;                              // 0x0A70(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RangeContinueStep;                                 // 0x0A74(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepCCDWeight;                                     // 0x0A78(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepHeight;                                        // 0x0A7C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepTime;                                          // 0x0A80(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StepDist;                                          // 0x0A84(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwingStiffness;                                    // 0x0A88(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SwingStiffnessFinal;                               // 0x0A8C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlantStiffness;                                    // 0x0A90(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0A94(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendTimeHeight;                                   // 0x0A98(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTimeFinalMult;                              // 0x0A9C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTimeAnkle;                                  // 0x0AA0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NeutralStanceDistanceMult;                         // 0x0AA4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PostImpulseStepSpeedMult;                          // 0x0AA8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncreaseStanceBlendTimeDueToBodyAngle;             // 0x0AAC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AAD[0x3];                                      // 0x0AAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxAllowedFootTiltAngle;                           // 0x0AB0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaitBeforeSteppingAfterImpulse;                    // 0x0AB4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CircleSizeOtherFoot;                               // 0x0AB8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlantedFootUnintentionallyLiftedMaxTime;           // 0x0ABC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReducePlantedStiffnessAsTimePassesForceFall;       // 0x0AC0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC1[0x3];                                      // 0x0AC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReducePlantedStiffnessAsTimePassesForceFallBlendTime; // 0x0AC4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReducePlantedStiffnessAsTimePassesForceFallFinalMult; // 0x0AC8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IncreaseBlendTimeAsTimePassesForceFallBottomRange; // 0x0ACC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IncreaseBlendTimeAsTimePassesForceFallTopRange;    // 0x0AD0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IncreaseBlendTimeAsTimePassesForceFallTopVal;      // 0x0AD4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         COMControlStiffnessBalanced;                       // 0x0AD8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         COMControlCurrentPoseStrength;                     // 0x0ADC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         COMControlLinMagCap;                               // 0x0AE0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RangeLimWindmillSingle;                            // 0x0AE4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RangeLimWindmillBoth;                              // 0x0AE8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampWindmillMin;                                  // 0x0AEC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ClampWindmillMax;                                  // 0x0AF0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WeightWindmill;                                    // 0x0AF4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UseStiffnessWindmill;                              // 0x0AF8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MultWindmill;                                      // 0x0AFC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DistWindmill;                                      // 0x0B00(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RadWindmill;                                       // 0x0B04(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardOffsetWindmill;                             // 0x0B08(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpOffsetWindmill;                                  // 0x0B0C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WindmillMaxLengthRatio;                            // 0x0B10(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReachForWoundLocalHitPointDistBuffer;              // 0x0B14(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReachForWoundExpandShoulderLimitRatioAfterConstraintMade; // 0x0B18(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReachForWoundExpandWristLimitRatioAfterConstraintMade; // 0x0B1C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReflectSpineBackWoundsToTheClosestSide;            // 0x0B20(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReachForWoundGrabFrontOfClosestLeg;                // 0x0B21(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceHeadHitsToReachWithBothHands;                 // 0x0B22(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B23[0x1];                                      // 0x0B23(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ChanceOfDoubleReach;                               // 0x0B24(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReachForWoundUseCOMVelFac;                         // 0x0B28(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReachForWoundExtraSideOffset;                      // 0x0B2C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BraceLenth;                                        // 0x0B30(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DontStopBraceUnlessLowVelocity;                    // 0x0B34(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B35[0x3];                                      // 0x0B35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BraceOpenWristLimitsRatio;                         // 0x0B38(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BraceFacingDotLim;                                 // 0x0B3C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BraceFacingDotLimBracing;                          // 0x0B40(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BraceSideDotLim;                                   // 0x0B44(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BraceSideDotLimBracing;                            // 0x0B48(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BraceBehinfBackDotLim;                             // 0x0B4C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BraceInitialDelay;                                 // 0x0B50(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DoSavageAttack;                                    // 0x0B54(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SavageAttackUsePitchClamping;                      // 0x0B55(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SavageAttackOffsetsUseSpineDirs;                   // 0x0B56(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B57[0x1];                                      // 0x0B57(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SavageAttackDebugTarget;                           // 0x0B58(0x000C)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
