#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_sbil0_50_boss010

#include "Basic.hpp"


namespace SDK::Params
{

// Function btsc_sbil0_50_boss010.btsc_sbil0_50_boss010_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct btsc_sbil0_50_boss010_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_50_boss010_C_ReceiveTick) == 0x000004, "Wrong alignment on btsc_sbil0_50_boss010_C_ReceiveTick");
static_assert(sizeof(btsc_sbil0_50_boss010_C_ReceiveTick) == 0x000004, "Wrong size on btsc_sbil0_50_boss010_C_ReceiveTick");
static_assert(offsetof(btsc_sbil0_50_boss010_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'btsc_sbil0_50_boss010_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function btsc_sbil0_50_boss010.btsc_sbil0_50_boss010_C.ChangePhase
// 0x0004 (0x0004 - 0x0000)
struct btsc_sbil0_50_boss010_C_ChangePhase final
{
public:
	int32                                         mphase;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_50_boss010_C_ChangePhase) == 0x000004, "Wrong alignment on btsc_sbil0_50_boss010_C_ChangePhase");
static_assert(sizeof(btsc_sbil0_50_boss010_C_ChangePhase) == 0x000004, "Wrong size on btsc_sbil0_50_boss010_C_ChangePhase");
static_assert(offsetof(btsc_sbil0_50_boss010_C_ChangePhase, mphase) == 0x000000, "Member 'btsc_sbil0_50_boss010_C_ChangePhase::mphase' has a wrong offset!");

// Function btsc_sbil0_50_boss010.btsc_sbil0_50_boss010_C.ExecuteUbergraph_btsc_sbil0_50_boss010
// 0x000C (0x000C - 0x0000)
struct btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event__phase;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010) == 0x000004, "Wrong alignment on btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010");
static_assert(sizeof(btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010) == 0x00000C, "Wrong size on btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010");
static_assert(offsetof(btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010, EntryPoint) == 0x000000, "Member 'btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010::EntryPoint' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010, K2Node_Event__phase) == 0x000008, "Member 'btsc_sbil0_50_boss010_C_ExecuteUbergraph_btsc_sbil0_50_boss010::K2Node_Event__phase' has a wrong offset!");

}

