#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_sbil0_90_boss020

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass btsc_sbil0_90_boss020.btsc_sbil0_90_boss020_C
// 0x0058 (0x0400 - 0x03A8)
class Abtsc_sbil0_90_boss020_C final : public AEndBattleScene_btsc_sbil0_90_boss020
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         P1_SetPlay_Count;                                  // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   P1_SetPlay_Warp;                                   // 0x03BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   P1_SetPlay_Finish;                                 // 0x03C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          P1_SetPlay;                                        // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   P1_SetPlay_Middle;                                 // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weak;                                              // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          P2_Down;                                           // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          P2_Tifa;                                           // 0x03DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DB[0x1];                                      // 0x03DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Battle_Phase;                                      // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         P2_Talk_Count;                                     // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         mDebug_JumpDuration_P1C_Atk01;                     // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         mDebug_JumpDuration_P1C_Jmp01;                     // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          P1_ShadowOutside;                                  // 0x03EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   P1_Shadow;                                         // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          P1_Sephiroth_WarpFail;                             // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_1_Cloud_Warp_Finished;                       // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_btsc_sbil0_90_boss020(int32 EntryPoint);
	void P1Under_SetPlay_AtkCld2();
	void P1Under_Set_Play_Dmg_Cld_1();
	void P1Under_Set_Play_Dmg_Cld_2();
	void P1Under_SetPlay_DmgSeph1();
	void P1Under_SetPlay_DmgSeph2();
	void OnIncrementBattleCountPerID(class FName CauserCharaName, class FName TargetCharaName, EEndBattleCountLogType Type, class FName ID, int32 Count);
	void ChangePhase(int32 mphase);
	void OnMetaMessage(const class FString& InMessage);
	void OnMotionMessage(class FName CharaName, class FName motionName);
	void OnTakeDamage(int32 Damage, const class FName& CauserCharaName, const class FName& DamagedCharaName, const class FName& AbilityID, bool bBind, bool bGuard, bool bDodge, const class FName& hitBoneName, bool bAttributeHit, const class FName& DamageSourceID, EEndBattleAttributeType DmgSrcAttributeType, float justHitRotYaw, const struct FVector& hitPosition, bool bHeal);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"btsc_sbil0_90_boss020_C">();
	}
	static class Abtsc_sbil0_90_boss020_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abtsc_sbil0_90_boss020_C>();
	}
};
static_assert(alignof(Abtsc_sbil0_90_boss020_C) == 0x000008, "Wrong alignment on Abtsc_sbil0_90_boss020_C");
static_assert(sizeof(Abtsc_sbil0_90_boss020_C) == 0x000400, "Wrong size on Abtsc_sbil0_90_boss020_C");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, UberGraphFrame) == 0x0003A8, "Member 'Abtsc_sbil0_90_boss020_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, DefaultSceneRoot) == 0x0003B0, "Member 'Abtsc_sbil0_90_boss020_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P1_SetPlay_Count) == 0x0003B8, "Member 'Abtsc_sbil0_90_boss020_C::P1_SetPlay_Count' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P1_SetPlay_Warp) == 0x0003BC, "Member 'Abtsc_sbil0_90_boss020_C::P1_SetPlay_Warp' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P1_SetPlay_Finish) == 0x0003C4, "Member 'Abtsc_sbil0_90_boss020_C::P1_SetPlay_Finish' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P1_SetPlay) == 0x0003CC, "Member 'Abtsc_sbil0_90_boss020_C::P1_SetPlay' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P1_SetPlay_Middle) == 0x0003D0, "Member 'Abtsc_sbil0_90_boss020_C::P1_SetPlay_Middle' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, Weak) == 0x0003D8, "Member 'Abtsc_sbil0_90_boss020_C::Weak' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P2_Down) == 0x0003D9, "Member 'Abtsc_sbil0_90_boss020_C::P2_Down' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P2_Tifa) == 0x0003DA, "Member 'Abtsc_sbil0_90_boss020_C::P2_Tifa' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, Battle_Phase) == 0x0003DC, "Member 'Abtsc_sbil0_90_boss020_C::Battle_Phase' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P2_Talk_Count) == 0x0003E0, "Member 'Abtsc_sbil0_90_boss020_C::P2_Talk_Count' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, mDebug_JumpDuration_P1C_Atk01) == 0x0003E4, "Member 'Abtsc_sbil0_90_boss020_C::mDebug_JumpDuration_P1C_Atk01' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, mDebug_JumpDuration_P1C_Jmp01) == 0x0003E8, "Member 'Abtsc_sbil0_90_boss020_C::mDebug_JumpDuration_P1C_Jmp01' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P1_ShadowOutside) == 0x0003EC, "Member 'Abtsc_sbil0_90_boss020_C::P1_ShadowOutside' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P1_Shadow) == 0x0003F0, "Member 'Abtsc_sbil0_90_boss020_C::P1_Shadow' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, P1_Sephiroth_WarpFail) == 0x0003F8, "Member 'Abtsc_sbil0_90_boss020_C::P1_Sephiroth_WarpFail' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_90_boss020_C, Phase_1_Cloud_Warp_Finished) == 0x0003F9, "Member 'Abtsc_sbil0_90_boss020_C::Phase_1_Cloud_Warp_Finished' has a wrong offset!");

}

