#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_sbil0_30_boss010

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.OnCharaSpecialStatusChange
// 0x0050 (0x0050 - 0x0000)
struct btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange final
{
public:
	class FName                                   ownerCharaName;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpecialStatusChangeID;                             // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleSpecialStatusChangeType             Type;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   StateId;                                           // 0x0014(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Params_0;                                          // 0x0020(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class FName>                           ParamIDs;                                          // 0x0030(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         ParamActors;                                       // 0x0040(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange) == 0x000008, "Wrong alignment on btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange");
static_assert(sizeof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange) == 0x000050, "Wrong size on btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange, ownerCharaName) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange::ownerCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange, SpecialStatusChangeID) == 0x000008, "Member 'btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange::SpecialStatusChangeID' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange, Type) == 0x000010, "Member 'btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange::Type' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange, StateId) == 0x000014, "Member 'btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange::StateId' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange, Params_0) == 0x000020, "Member 'btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange::Params_0' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange, ParamIDs) == 0x000030, "Member 'btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange::ParamIDs' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange, ParamActors) == 0x000040, "Member 'btsc_sbil0_30_boss010_C_OnCharaSpecialStatusChange::ParamActors' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.OnMotionMessage
// 0x0010 (0x0010 - 0x0000)
struct btsc_sbil0_30_boss010_C_OnMotionMessage final
{
public:
	class FName                                   CharaName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   motionName;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_OnMotionMessage) == 0x000004, "Wrong alignment on btsc_sbil0_30_boss010_C_OnMotionMessage");
static_assert(sizeof(btsc_sbil0_30_boss010_C_OnMotionMessage) == 0x000010, "Wrong size on btsc_sbil0_30_boss010_C_OnMotionMessage");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnMotionMessage, CharaName) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_OnMotionMessage::CharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnMotionMessage, motionName) == 0x000008, "Member 'btsc_sbil0_30_boss010_C_OnMotionMessage::motionName' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.OnMetaMessage
// 0x0010 (0x0010 - 0x0000)
struct btsc_sbil0_30_boss010_C_OnMetaMessage final
{
public:
	class FString                                 InMessage;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_OnMetaMessage) == 0x000008, "Wrong alignment on btsc_sbil0_30_boss010_C_OnMetaMessage");
static_assert(sizeof(btsc_sbil0_30_boss010_C_OnMetaMessage) == 0x000010, "Wrong size on btsc_sbil0_30_boss010_C_OnMetaMessage");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnMetaMessage, InMessage) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_OnMetaMessage::InMessage' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.OnTakeDamage
// 0x004C (0x004C - 0x0000)
struct btsc_sbil0_30_boss010_C_OnTakeDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CauserCharaName;                                   // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DamagedCharaName;                                  // 0x000C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AbilityID;                                         // 0x0014(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBind;                                             // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bGuard;                                            // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDodge;                                            // 0x001E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   hitBoneName;                                       // 0x0020(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttributeHit;                                     // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DamageSourceID;                                    // 0x002C(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       DmgSrcAttributeType;                               // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         justHitRotYaw;                                     // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitPosition;                                       // 0x003C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHeal;                                             // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_OnTakeDamage) == 0x000004, "Wrong alignment on btsc_sbil0_30_boss010_C_OnTakeDamage");
static_assert(sizeof(btsc_sbil0_30_boss010_C_OnTakeDamage) == 0x00004C, "Wrong size on btsc_sbil0_30_boss010_C_OnTakeDamage");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, Damage) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::Damage' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, CauserCharaName) == 0x000004, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, DamagedCharaName) == 0x00000C, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::DamagedCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, AbilityID) == 0x000014, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::AbilityID' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, bBind) == 0x00001C, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::bBind' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, bGuard) == 0x00001D, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::bGuard' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, bDodge) == 0x00001E, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::bDodge' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, hitBoneName) == 0x000020, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::hitBoneName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, bAttributeHit) == 0x000028, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::bAttributeHit' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, DamageSourceID) == 0x00002C, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::DamageSourceID' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, DmgSrcAttributeType) == 0x000034, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::DmgSrcAttributeType' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, justHitRotYaw) == 0x000038, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::justHitRotYaw' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, hitPosition) == 0x00003C, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::hitPosition' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnTakeDamage, bHeal) == 0x000048, "Member 'btsc_sbil0_30_boss010_C_OnTakeDamage::bHeal' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.OnIncrementBattleCountPerID
// 0x0020 (0x0020 - 0x0000)
struct btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID final
{
public:
	class FName                                   CauserCharaName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetCharaName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleCountLogType                        Type;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ID;                                                // 0x0014(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID) == 0x000004, "Wrong alignment on btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID");
static_assert(sizeof(btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID) == 0x000020, "Wrong size on btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID, CauserCharaName) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID, TargetCharaName) == 0x000008, "Member 'btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID::TargetCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID, Type) == 0x000010, "Member 'btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID::Type' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID, ID) == 0x000014, "Member 'btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID::ID' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID, Count) == 0x00001C, "Member 'btsc_sbil0_30_boss010_C_OnIncrementBattleCountPerID::Count' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.OnCharaPartsDamage
// 0x0028 (0x0028 - 0x0000)
struct btsc_sbil0_30_boss010_C_OnCharaPartsDamage final
{
public:
	class FName                                   CauserCharaName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DamagedCharaName;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   partsID;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CategoryID;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemainHP;                                          // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainHPPer;                                       // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_OnCharaPartsDamage) == 0x000004, "Wrong alignment on btsc_sbil0_30_boss010_C_OnCharaPartsDamage");
static_assert(sizeof(btsc_sbil0_30_boss010_C_OnCharaPartsDamage) == 0x000028, "Wrong size on btsc_sbil0_30_boss010_C_OnCharaPartsDamage");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsDamage, CauserCharaName) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsDamage::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsDamage, DamagedCharaName) == 0x000008, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsDamage::DamagedCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsDamage, partsID) == 0x000010, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsDamage::partsID' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsDamage, CategoryID) == 0x000018, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsDamage::CategoryID' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsDamage, RemainHP) == 0x000020, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsDamage::RemainHP' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsDamage, RemainHPPer) == 0x000024, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsDamage::RemainHPPer' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.ChangePhase
// 0x0004 (0x0004 - 0x0000)
struct btsc_sbil0_30_boss010_C_ChangePhase final
{
public:
	int32                                         mphase;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_ChangePhase) == 0x000004, "Wrong alignment on btsc_sbil0_30_boss010_C_ChangePhase");
static_assert(sizeof(btsc_sbil0_30_boss010_C_ChangePhase) == 0x000004, "Wrong size on btsc_sbil0_30_boss010_C_ChangePhase");
static_assert(offsetof(btsc_sbil0_30_boss010_C_ChangePhase, mphase) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_ChangePhase::mphase' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.OnCharaPartsBreak
// 0x0024 (0x0024 - 0x0000)
struct btsc_sbil0_30_boss010_C_OnCharaPartsBreak final
{
public:
	class FName                                   CauserCharaName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BrokenCharaName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   partsID;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CategoryID;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CategoryBreakCount;                                // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_OnCharaPartsBreak) == 0x000004, "Wrong alignment on btsc_sbil0_30_boss010_C_OnCharaPartsBreak");
static_assert(sizeof(btsc_sbil0_30_boss010_C_OnCharaPartsBreak) == 0x000024, "Wrong size on btsc_sbil0_30_boss010_C_OnCharaPartsBreak");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsBreak, CauserCharaName) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsBreak::CauserCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsBreak, BrokenCharaName) == 0x000008, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsBreak::BrokenCharaName' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsBreak, partsID) == 0x000010, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsBreak::partsID' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsBreak, CategoryID) == 0x000018, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsBreak::CategoryID' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_OnCharaPartsBreak, CategoryBreakCount) == 0x000020, "Member 'btsc_sbil0_30_boss010_C_OnCharaPartsBreak::CategoryBreakCount' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct btsc_sbil0_30_boss010_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_ReceiveTick) == 0x000004, "Wrong alignment on btsc_sbil0_30_boss010_C_ReceiveTick");
static_assert(sizeof(btsc_sbil0_30_boss010_C_ReceiveTick) == 0x000004, "Wrong size on btsc_sbil0_30_boss010_C_ReceiveTick");
static_assert(offsetof(btsc_sbil0_30_boss010_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function btsc_sbil0_30_boss010.btsc_sbil0_30_boss010_C.ExecuteUbergraph_btsc_sbil0_30_boss010
// 0x0238 (0x0238 - 0x0000)
struct btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_OwnerCharaName;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_SpecialStatusChangeID;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleSpecialStatusChangeType             K2Node_Event_Type2;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_StateID;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_Event_Params;                               // 0x0028(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FName>                           K2Node_Event_ParamIDs;                             // 0x0038(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         K2Node_Event_ParamActors;                          // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_charaName;                            // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_motionName;                           // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable2;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable3;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetPartyLeader_ReturnValue;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_InMessage;                            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEndCharacter*>                  CallFunc_GetEnemyMembersFromID_ReturnValue;        // 0x00A0(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         K2Node_Event_Damage;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CauserCharaName4;                     // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_DamagedCharaName2;                    // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AbilityID;                            // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBind;                                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bGuard;                               // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDodge;                               // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CF[0x1];                                       // 0x00CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_HitBoneName;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bAttributeHit;                        // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_DamageSourceID;                       // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       K2Node_Event_DmgSrcAttributeType;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_JustHitRotYaw;                        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitPosition;                          // 0x00EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHeal;                                // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName5_CmpSuccess;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEndCharacter*>                  CallFunc_GetEnemyMembersFromID_ReturnValue2;       // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class AEndCharacter*>                  CallFunc_GetEnemyMembersFromID_ReturnValue3;       // 0x0118(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPhase_ReturnValue;                     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue3;           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CauserCharaName3;                     // 0x0144(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TargetCharaName;                      // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleCountLogType                        K2Node_Event_Type;                                 // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ID;                                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Count;                                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName6_CmpSuccess;                     // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName7_CmpSuccess;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CauserCharaName2;                     // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_DamagedCharaName;                     // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PartsID2;                             // 0x017C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CategoryID2;                          // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_RemainHP;                             // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_RemainHPPer;                          // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_Array_Get_Item;                           // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharaHPP_ReturnValue;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPhase_ReturnValue2;                    // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event__phase;                               // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CauserCharaName;                      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_BrokenCharaName;                      // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PartsID;                              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_CategoryID;                           // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CategoryBreakCount;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue2;         // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EB[0x1];                                      // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable2;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable3;                // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPhase_ReturnValue3;                    // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue4;           // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue5;           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetPlayerCharacter_ReturnValue2;          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActorName_ReturnValue;                 // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue2;     // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue3;         // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_226[0x2];                                      // 0x0226(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActorName_ReturnValue2;                // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue4;         // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue8;                  // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010) == 0x000008, "Wrong alignment on btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010");
static_assert(sizeof(btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010) == 0x000238, "Wrong size on btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010");
static_assert(offsetof(btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010, EntryPoint) == 0x000000, "Member 'btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010::EntryPoint' has a wrong offset!");
static_assert(offsetof(btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010, Temp_bool_IsClosed_Variable) == 0x000004, "Member 'btsc_sbil0_30_boss010_C_ExecuteUbergraph_btsc_sbil0_30_boss010::Temp_bool_IsClosed_Variable' has a wrong offset!");
