#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass btsc_base.btsc_base_C
// 0x0058 (0x0400 - 0x03A8)
class Abtsc_base_C final : public AEndBattleSceneBlueprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          BrtVoiceColdyMode;                                 // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DeadCharaName;                                     // 0x03BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InMember_Cloud;                                    // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InMember_Barret;                                   // 0x03C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InMember_Tifa;                                     // 0x03C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InMember_Aerith;                                   // 0x03C7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InMember_Redxiii;                                  // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InMember_Yuffie;                                   // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InMember_Sonon;                                    // 0x03CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         BattlleSceneSituation;                             // 0x03CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MortallyAlart_Cloud;                               // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MortallyAlart_Barret;                              // 0x03CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MortallyAlart_Tifa;                                // 0x03CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MortallyAlart_Aerith;                              // 0x03CF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MortallyAlart_Yuffie;                              // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MortallyAlart_Sonon;                               // 0x03D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RatioTwin_SoloStart;                               // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RatioTwin_TwinStart;                               // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ratio_Trinity_SoloStart;                           // 0x03DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Ratio_Trinity_TwinStart;                           // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeaderChecker;                                     // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveMemberCount;                                 // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         m_MaskedTwinTalkRatio;                             // 0x03EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RatioSolo_plus;                                    // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RatioTwin_plus;                                    // 0x03F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         test_patternchange;                                // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_btsc_base(int32 EntryPoint);
	void OnIncrementBattleCountPerID(class FName CauserCharaName, class FName TargetCharaName, EEndBattleCountLogType Type, class FName ID, int32 Count);
	void OnEndLinkCommand();
	void OnBeginLinkCommand();
	void OnEntryBattleScene(const class FName& BattleSceneID, const struct FEndDataTableBattleScene& dataTableBattleScene);
	void plusBattleBegin_SinraB();
	void plusBattleBegin_SinraS();
	void plusBattleBegin_MonB();
	void plusBattleBegin_MonS();
	void OnDLCSummonUltimateMagicEnd();
	void OnReadyBattleTalk(class FName BattleSceneID);
	void OnTakeDamage(int32 Damage, const class FName& CauserCharaName, const class FName& DamagedCharaName, const class FName& AbilityID, bool bBind, bool bGuard, bool bDodge, const class FName& hitBoneName, bool bAttributeHit, const class FName& DamageSourceID, EEndBattleAttributeType DmgSrcAttributeType, float justHitRotYaw, const struct FVector& hitPosition, bool bHeal);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"btsc_base_C">();
	}
	static class Abtsc_base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abtsc_base_C>();
	}
};
static_assert(alignof(Abtsc_base_C) == 0x000008, "Wrong alignment on Abtsc_base_C");
static_assert(sizeof(Abtsc_base_C) == 0x000400, "Wrong size on Abtsc_base_C");
static_assert(offsetof(Abtsc_base_C, UberGraphFrame) == 0x0003A8, "Member 'Abtsc_base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, DefaultSceneRoot) == 0x0003B0, "Member 'Abtsc_base_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, BrtVoiceColdyMode) == 0x0003B8, "Member 'Abtsc_base_C::BrtVoiceColdyMode' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, DeadCharaName) == 0x0003BC, "Member 'Abtsc_base_C::DeadCharaName' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, InMember_Cloud) == 0x0003C4, "Member 'Abtsc_base_C::InMember_Cloud' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, InMember_Barret) == 0x0003C5, "Member 'Abtsc_base_C::InMember_Barret' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, InMember_Tifa) == 0x0003C6, "Member 'Abtsc_base_C::InMember_Tifa' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, InMember_Aerith) == 0x0003C7, "Member 'Abtsc_base_C::InMember_Aerith' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, InMember_Redxiii) == 0x0003C8, "Member 'Abtsc_base_C::InMember_Redxiii' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, InMember_Yuffie) == 0x0003C9, "Member 'Abtsc_base_C::InMember_Yuffie' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, InMember_Sonon) == 0x0003CA, "Member 'Abtsc_base_C::InMember_Sonon' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, BattlleSceneSituation) == 0x0003CB, "Member 'Abtsc_base_C::BattlleSceneSituation' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, MortallyAlart_Cloud) == 0x0003CC, "Member 'Abtsc_base_C::MortallyAlart_Cloud' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, MortallyAlart_Barret) == 0x0003CD, "Member 'Abtsc_base_C::MortallyAlart_Barret' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, MortallyAlart_Tifa) == 0x0003CE, "Member 'Abtsc_base_C::MortallyAlart_Tifa' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, MortallyAlart_Aerith) == 0x0003CF, "Member 'Abtsc_base_C::MortallyAlart_Aerith' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, MortallyAlart_Yuffie) == 0x0003D0, "Member 'Abtsc_base_C::MortallyAlart_Yuffie' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, MortallyAlart_Sonon) == 0x0003D1, "Member 'Abtsc_base_C::MortallyAlart_Sonon' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, RatioTwin_SoloStart) == 0x0003D4, "Member 'Abtsc_base_C::RatioTwin_SoloStart' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, RatioTwin_TwinStart) == 0x0003D8, "Member 'Abtsc_base_C::RatioTwin_TwinStart' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, Ratio_Trinity_SoloStart) == 0x0003DC, "Member 'Abtsc_base_C::Ratio_Trinity_SoloStart' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, Ratio_Trinity_TwinStart) == 0x0003E0, "Member 'Abtsc_base_C::Ratio_Trinity_TwinStart' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, LeaderChecker) == 0x0003E4, "Member 'Abtsc_base_C::LeaderChecker' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, ActiveMemberCount) == 0x0003E8, "Member 'Abtsc_base_C::ActiveMemberCount' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, m_MaskedTwinTalkRatio) == 0x0003EC, "Member 'Abtsc_base_C::m_MaskedTwinTalkRatio' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, RatioSolo_plus) == 0x0003F0, "Member 'Abtsc_base_C::RatioSolo_plus' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, RatioTwin_plus) == 0x0003F4, "Member 'Abtsc_base_C::RatioTwin_plus' has a wrong offset!");
static_assert(offsetof(Abtsc_base_C, test_patternchange) == 0x0003F8, "Member 'Abtsc_base_C::test_patternchange' has a wrong offset!");

}

