#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: btsc_sbil0_80_boss020

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass btsc_sbil0_80_boss020.btsc_sbil0_80_boss020_C
// 0x0028 (0x03D0 - 0x03A8)
class Abtsc_sbil0_80_boss020_C final : public AEndBattleSceneBlueprint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   DarkNation_RaceName;                               // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Rufus_RaceName;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Link_Off_Done;                                     // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x3];                                      // 0x03C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SyncCounter_AutoTalk_Multiple;                     // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveTick(float DeltaSeconds);
	void ChangePhase(int32 mphase);
	void ExecuteUbergraph_btsc_sbil0_80_boss020(int32 EntryPoint);
	void OnCharaSyncAction(const class FName& AttackedCharaName, const class FName& ReceivedCharaName, const class FName& StateId, int32 StateCount, const class FName& syncActionID, const class FName& CauserCharaName);
	void OnTakeDamage(int32 Damage, const class FName& CauserCharaName, const class FName& DamagedCharaName, const class FName& AbilityID, bool bBind, bool bGuard, bool bDodge, const class FName& hitBoneName, bool bAttributeHit, const class FName& DamageSourceID, EEndBattleAttributeType DmgSrcAttributeType, float justHitRotYaw, const struct FVector& hitPosition, bool bHeal);
	void OnMetaMessage(const class FString& InMessage);
	void OnIncrementBattleCountPerID(class FName CauserCharaName, class FName TargetCharaName, EEndBattleCountLogType Type, class FName ID, int32 Count);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"btsc_sbil0_80_boss020_C">();
	}
	static class Abtsc_sbil0_80_boss020_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Abtsc_sbil0_80_boss020_C>();
	}
};
static_assert(alignof(Abtsc_sbil0_80_boss020_C) == 0x000008, "Wrong alignment on Abtsc_sbil0_80_boss020_C");
static_assert(sizeof(Abtsc_sbil0_80_boss020_C) == 0x0003D0, "Wrong size on Abtsc_sbil0_80_boss020_C");
static_assert(offsetof(Abtsc_sbil0_80_boss020_C, UberGraphFrame) == 0x0003A8, "Member 'Abtsc_sbil0_80_boss020_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_80_boss020_C, DefaultSceneRoot) == 0x0003B0, "Member 'Abtsc_sbil0_80_boss020_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_80_boss020_C, DarkNation_RaceName) == 0x0003B8, "Member 'Abtsc_sbil0_80_boss020_C::DarkNation_RaceName' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_80_boss020_C, Rufus_RaceName) == 0x0003C0, "Member 'Abtsc_sbil0_80_boss020_C::Rufus_RaceName' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_80_boss020_C, Link_Off_Done) == 0x0003C8, "Member 'Abtsc_sbil0_80_boss020_C::Link_Off_Done' has a wrong offset!");
static_assert(offsetof(Abtsc_sbil0_80_boss020_C, SyncCounter_AutoTalk_Multiple) == 0x0003CC, "Member 'Abtsc_sbil0_80_boss020_C::SyncCounter_AutoTalk_Multiple' has a wrong offset!");

}

