#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Burst_In

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Burst_In.Burst_In_C
// 0x0020 (0x0380 - 0x0360)
class UBurst_In_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Transform;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_EffectBG;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Burst_In_C">();
	}
	static class UBurst_In_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBurst_In_C>();
	}
};
static_assert(alignof(UBurst_In_C) == 0x000008, "Wrong alignment on UBurst_In_C");
static_assert(sizeof(UBurst_In_C) == 0x000380, "Wrong size on UBurst_In_C");
static_assert(offsetof(UBurst_In_C, Out) == 0x000360, "Member 'UBurst_In_C::Out' has a wrong offset!");
static_assert(offsetof(UBurst_In_C, Transform) == 0x000368, "Member 'UBurst_In_C::Transform' has a wrong offset!");
static_assert(offsetof(UBurst_In_C, In) == 0x000370, "Member 'UBurst_In_C::In' has a wrong offset!");
static_assert(offsetof(UBurst_In_C, Img_EffectBG) == 0x000378, "Member 'UBurst_In_C::Img_EffectBG' has a wrong offset!");

}

