#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChapterTitle

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChapterTitle.ChapterTitle_C
// 0x0060 (0x03C0 - 0x0360)
class UChapterTitle_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_ChapterTitle;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Chapter_00;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Title_00;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Com_Effect;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_ChapterTitle;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLight;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLight2;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Number;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChapterTitle_C">();
	}
	static class UChapterTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChapterTitle_C>();
	}
};
static_assert(alignof(UChapterTitle_C) == 0x000008, "Wrong alignment on UChapterTitle_C");
static_assert(sizeof(UChapterTitle_C) == 0x0003C0, "Wrong size on UChapterTitle_C");
static_assert(offsetof(UChapterTitle_C, Out) == 0x000360, "Member 'UChapterTitle_C::Out' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, Loop) == 0x000368, "Member 'UChapterTitle_C::Loop' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, In) == 0x000370, "Member 'UChapterTitle_C::In' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, All_ChapterTitle) == 0x000378, "Member 'UChapterTitle_C::All_ChapterTitle' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, Img_Base_Chapter_00) == 0x000380, "Member 'UChapterTitle_C::Img_Base_Chapter_00' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, Img_Base_Title_00) == 0x000388, "Member 'UChapterTitle_C::Img_Base_Title_00' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, Img_Com_Effect) == 0x000390, "Member 'UChapterTitle_C::Img_Com_Effect' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, Pnl_ChapterTitle) == 0x000398, "Member 'UChapterTitle_C::Pnl_ChapterTitle' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, TitleLight) == 0x0003A0, "Member 'UChapterTitle_C::TitleLight' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, TitleLight2) == 0x0003A8, "Member 'UChapterTitle_C::TitleLight2' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, Txt_Number) == 0x0003B0, "Member 'UChapterTitle_C::Txt_Number' has a wrong offset!");
static_assert(offsetof(UChapterTitle_C, Txt_Title) == 0x0003B8, "Member 'UChapterTitle_C::Txt_Title' has a wrong offset!");

}

