#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCarriage_Loca2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCarriage_Loca2.ChocoboCarriage_Loca2_C
// 0x0020 (0x0380 - 0x0360)
class UChocoboCarriage_Loca2_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Current;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Current;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point;                                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCarriage_Loca2_C">();
	}
	static class UChocoboCarriage_Loca2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCarriage_Loca2_C>();
	}
};
static_assert(alignof(UChocoboCarriage_Loca2_C) == 0x000008, "Wrong alignment on UChocoboCarriage_Loca2_C");
static_assert(sizeof(UChocoboCarriage_Loca2_C) == 0x000380, "Wrong size on UChocoboCarriage_Loca2_C");
static_assert(offsetof(UChocoboCarriage_Loca2_C, Normal) == 0x000360, "Member 'UChocoboCarriage_Loca2_C::Normal' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca2_C, Current) == 0x000368, "Member 'UChocoboCarriage_Loca2_C::Current' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca2_C, Icon_Current) == 0x000370, "Member 'UChocoboCarriage_Loca2_C::Icon_Current' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca2_C, Point) == 0x000378, "Member 'UChocoboCarriage_Loca2_C::Point' has a wrong offset!");

}

