#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCarriage_Map

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCarriage_Map.ChocoboCarriage_Map_C
// 0x00A0 (0x0400 - 0x0360)
class UChocoboCarriage_Map_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Menu_In;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca2_C*               Icon_Boarding1;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca2_C*               Icon_Boarding2;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca2_C*               Icon_Boarding3;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca2_C*               Icon_Boarding4;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_KaKa;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_LoLo;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_MoMo;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Map_Billboard;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Loca_00;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Loca_01;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Loca_02;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Loca_03;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Loca_04;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_C*                Loca_05;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UChocoboCarriage_Loca_Right_C*          Loca_08;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MapBase;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MapFrame;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCarriage_Map_C">();
	}
	static class UChocoboCarriage_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCarriage_Map_C>();
	}
};
static_assert(alignof(UChocoboCarriage_Map_C) == 0x000008, "Wrong alignment on UChocoboCarriage_Map_C");
static_assert(sizeof(UChocoboCarriage_Map_C) == 0x000400, "Wrong size on UChocoboCarriage_Map_C");
static_assert(offsetof(UChocoboCarriage_Map_C, Menu_In) == 0x000360, "Member 'UChocoboCarriage_Map_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Icon_Boarding1) == 0x000368, "Member 'UChocoboCarriage_Map_C::Icon_Boarding1' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Icon_Boarding2) == 0x000370, "Member 'UChocoboCarriage_Map_C::Icon_Boarding2' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Icon_Boarding3) == 0x000378, "Member 'UChocoboCarriage_Map_C::Icon_Boarding3' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Icon_Boarding4) == 0x000380, "Member 'UChocoboCarriage_Map_C::Icon_Boarding4' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Icon_KaKa) == 0x000388, "Member 'UChocoboCarriage_Map_C::Icon_KaKa' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Icon_LoLo) == 0x000390, "Member 'UChocoboCarriage_Map_C::Icon_LoLo' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Icon_MoMo) == 0x000398, "Member 'UChocoboCarriage_Map_C::Icon_MoMo' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Img_Map_Billboard) == 0x0003A0, "Member 'UChocoboCarriage_Map_C::Img_Map_Billboard' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Light1) == 0x0003A8, "Member 'UChocoboCarriage_Map_C::Light1' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Light2) == 0x0003B0, "Member 'UChocoboCarriage_Map_C::Light2' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Loca_00) == 0x0003B8, "Member 'UChocoboCarriage_Map_C::Loca_00' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Loca_01) == 0x0003C0, "Member 'UChocoboCarriage_Map_C::Loca_01' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Loca_02) == 0x0003C8, "Member 'UChocoboCarriage_Map_C::Loca_02' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Loca_03) == 0x0003D0, "Member 'UChocoboCarriage_Map_C::Loca_03' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Loca_04) == 0x0003D8, "Member 'UChocoboCarriage_Map_C::Loca_04' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Loca_05) == 0x0003E0, "Member 'UChocoboCarriage_Map_C::Loca_05' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, Loca_08) == 0x0003E8, "Member 'UChocoboCarriage_Map_C::Loca_08' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, MapBase) == 0x0003F0, "Member 'UChocoboCarriage_Map_C::MapBase' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Map_C, MapFrame) == 0x0003F8, "Member 'UChocoboCarriage_Map_C::MapFrame' has a wrong offset!");

}

