#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChocoboCarriage_Loca

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChocoboCarriage_Loca.ChocoboCarriage_Loca_C
// 0x0068 (0x03C8 - 0x0360)
class UChocoboCarriage_Loca_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Current;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_Loop;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_00;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_01;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Current;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Target;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Circle_01;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Point;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChocoboCarriage_Loca_C">();
	}
	static class UChocoboCarriage_Loca_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChocoboCarriage_Loca_C>();
	}
};
static_assert(alignof(UChocoboCarriage_Loca_C) == 0x000008, "Wrong alignment on UChocoboCarriage_Loca_C");
static_assert(sizeof(UChocoboCarriage_Loca_C) == 0x0003C8, "Wrong size on UChocoboCarriage_Loca_C");
static_assert(offsetof(UChocoboCarriage_Loca_C, Normal) == 0x000360, "Member 'UChocoboCarriage_Loca_C::Normal' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Current) == 0x000368, "Member 'UChocoboCarriage_Loca_C::Current' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Menu_In) == 0x000370, "Member 'UChocoboCarriage_Loca_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Target_Loop) == 0x000378, "Member 'UChocoboCarriage_Loca_C::Target_Loop' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Base) == 0x000380, "Member 'UChocoboCarriage_Loca_C::Base' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Cursor_00) == 0x000388, "Member 'UChocoboCarriage_Loca_C::Cursor_00' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Cursor_01) == 0x000390, "Member 'UChocoboCarriage_Loca_C::Cursor_01' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Frame) == 0x000398, "Member 'UChocoboCarriage_Loca_C::Frame' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Icon_Current) == 0x0003A0, "Member 'UChocoboCarriage_Loca_C::Icon_Current' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Icon_Target) == 0x0003A8, "Member 'UChocoboCarriage_Loca_C::Icon_Target' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Img_Circle_01) == 0x0003B0, "Member 'UChocoboCarriage_Loca_C::Img_Circle_01' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Point) == 0x0003B8, "Member 'UChocoboCarriage_Loca_C::Point' has a wrong offset!");
static_assert(offsetof(UChocoboCarriage_Loca_C, Shadow) == 0x0003C0, "Member 'UChocoboCarriage_Loca_C::Shadow' has a wrong offset!");

}

