#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Attenuation

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Attenuation.Clip_Attenuation
// 0x0038 (0x0038 - 0x0000)
struct FClip_Attenuation final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ActorName_32_FAF8E6244E3450393CFDA5BE5C8470CB;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 AssetName_29_AE6F648142F232AD3900D6BB39044FE0;     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5;      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_Attenuation) == 0x000008, "Wrong alignment on FClip_Attenuation");
static_assert(sizeof(FClip_Attenuation) == 0x000038, "Wrong size on FClip_Attenuation");
static_assert(offsetof(FClip_Attenuation, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_Attenuation::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_Attenuation, ActorName_32_FAF8E6244E3450393CFDA5BE5C8470CB) == 0x000010, "Member 'FClip_Attenuation::ActorName_32_FAF8E6244E3450393CFDA5BE5C8470CB' has a wrong offset!");
static_assert(offsetof(FClip_Attenuation, AssetName_29_AE6F648142F232AD3900D6BB39044FE0) == 0x000020, "Member 'FClip_Attenuation::AssetName_29_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_Attenuation, Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5) == 0x000030, "Member 'FClip_Attenuation::Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5' has a wrong offset!");

}

