#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_TempEquip

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_TempEquip.Clip_TempEquip
// 0x0014 (0x0014 - 0x0000)
struct FClip_TempEquip final
{
public:
	class FName                                   LevelName_59_C6B2ED9E46658F5DCB520C98721C4A88;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChangePatternID_58_3D00341949DB07E6367B2D8CEE1B44F4; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Priority_57_94EE08084C3DF3EDAA722BB8B461CF8E;      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_TempEquip) == 0x000004, "Wrong alignment on FClip_TempEquip");
static_assert(sizeof(FClip_TempEquip) == 0x000014, "Wrong size on FClip_TempEquip");
static_assert(offsetof(FClip_TempEquip, LevelName_59_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_TempEquip::LevelName_59_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_TempEquip, ChangePatternID_58_3D00341949DB07E6367B2D8CEE1B44F4) == 0x000008, "Member 'FClip_TempEquip::ChangePatternID_58_3D00341949DB07E6367B2D8CEE1B44F4' has a wrong offset!");
static_assert(offsetof(FClip_TempEquip, Priority_57_94EE08084C3DF3EDAA722BB8B461CF8E) == 0x000010, "Member 'FClip_TempEquip::Priority_57_94EE08084C3DF3EDAA722BB8B461CF8E' has a wrong offset!");

}

