#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_UnderEnvLight

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_UnderEnvLight.Clip_UnderEnvLight
// 0x0020 (0x0020 - 0x0000)
struct FClip_UnderEnvLight final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   ActorName_36_AE6F648142F232AD3900D6BB39044FE0;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_35_F2B5CECF4C216749680E3284B76AD108;        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_33_AB5BF63F4EE3831B9F394B9B6AD09C9E;      // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_UnderEnvLight) == 0x000008, "Wrong alignment on FClip_UnderEnvLight");
static_assert(sizeof(FClip_UnderEnvLight) == 0x000020, "Wrong size on FClip_UnderEnvLight");
static_assert(offsetof(FClip_UnderEnvLight, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_UnderEnvLight::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_UnderEnvLight, ActorName_36_AE6F648142F232AD3900D6BB39044FE0) == 0x000010, "Member 'FClip_UnderEnvLight::ActorName_36_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_UnderEnvLight, Enable_35_F2B5CECF4C216749680E3284B76AD108) == 0x000018, "Member 'FClip_UnderEnvLight::Enable_35_F2B5CECF4C216749680E3284B76AD108' has a wrong offset!");
static_assert(offsetof(FClip_UnderEnvLight, Priority_33_AB5BF63F4EE3831B9F394B9B6AD09C9E) == 0x000019, "Member 'FClip_UnderEnvLight::Priority_33_AB5BF63F4EE3831B9F394B9B6AD09C9E' has a wrong offset!");

}

