#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ActorMoveMode

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ActorMoveMode.Clip_ActorMoveMode
// 0x0020 (0x0020 - 0x0000)
struct FClip_ActorMoveMode final
{
public:
	class FString                                 LevelName_40_C6B2ED9E46658F5DCB520C98721C4A88;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   ActorName_34_AE6F648142F232AD3900D6BB39044FE0;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EActorMoveMode                                MoveMode_41_117A962E40A780A2647C6693698DDC0D;      // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Priority_37_637ECE4F4C822008E80E21BF3F3BE48F;      // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ActorMoveMode) == 0x000008, "Wrong alignment on FClip_ActorMoveMode");
static_assert(sizeof(FClip_ActorMoveMode) == 0x000020, "Wrong size on FClip_ActorMoveMode");
static_assert(offsetof(FClip_ActorMoveMode, LevelName_40_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_ActorMoveMode::LevelName_40_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_ActorMoveMode, ActorName_34_AE6F648142F232AD3900D6BB39044FE0) == 0x000010, "Member 'FClip_ActorMoveMode::ActorName_34_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_ActorMoveMode, MoveMode_41_117A962E40A780A2647C6693698DDC0D) == 0x000018, "Member 'FClip_ActorMoveMode::MoveMode_41_117A962E40A780A2647C6693698DDC0D' has a wrong offset!");
static_assert(offsetof(FClip_ActorMoveMode, Priority_37_637ECE4F4C822008E80E21BF3F3BE48F) == 0x000019, "Member 'FClip_ActorMoveMode::Priority_37_637ECE4F4C822008E80E21BF3F3BE48F' has a wrong offset!");

}

