#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ActorHiddenInGame

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ActorHiddenInGame.Clip_ActorHiddenInGame
// 0x0014 (0x0014 - 0x0000)
struct FClip_ActorHiddenInGame final
{
public:
	class FName                                   ActorLevelName_12_0D93A8A0401B750D709331BE83440C49; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActorName_10_4B78467E4A543483ACF15497B9255C3F;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden_16_ED98E90840B1012D996C83A78146AC8C;        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_17_ED4998FE42F30A8A7B65348BEC1B2580;      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ActorHiddenInGame) == 0x000004, "Wrong alignment on FClip_ActorHiddenInGame");
static_assert(sizeof(FClip_ActorHiddenInGame) == 0x000014, "Wrong size on FClip_ActorHiddenInGame");
static_assert(offsetof(FClip_ActorHiddenInGame, ActorLevelName_12_0D93A8A0401B750D709331BE83440C49) == 0x000000, "Member 'FClip_ActorHiddenInGame::ActorLevelName_12_0D93A8A0401B750D709331BE83440C49' has a wrong offset!");
static_assert(offsetof(FClip_ActorHiddenInGame, ActorName_10_4B78467E4A543483ACF15497B9255C3F) == 0x000008, "Member 'FClip_ActorHiddenInGame::ActorName_10_4B78467E4A543483ACF15497B9255C3F' has a wrong offset!");
static_assert(offsetof(FClip_ActorHiddenInGame, Hidden_16_ED98E90840B1012D996C83A78146AC8C) == 0x000010, "Member 'FClip_ActorHiddenInGame::Hidden_16_ED98E90840B1012D996C83A78146AC8C' has a wrong offset!");
static_assert(offsetof(FClip_ActorHiddenInGame, Priority_17_ED4998FE42F30A8A7B65348BEC1B2580) == 0x000011, "Member 'FClip_ActorHiddenInGame::Priority_17_ED4998FE42F30A8A7B65348BEC1B2580' has a wrong offset!");

}

