#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Scale

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Scale.Clip_Scale
// 0x0018 (0x0018 - 0x0000)
struct FClip_Scale final
{
public:
	class FName                                   ActorName_11_7404A59A475B8091C08C45A4CDB37920;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         X_26_95470FAE4195A7E035A65FB4AAB306D5;             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y_27_0B0A6F9E41D72DCF040D56B1ABA0434A;             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z_28_82E375674D95F67759F45FB8BD7A7F13;             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Priority_22_916BFFE8418D4A765D853DAFDCD63C62;      // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_Scale) == 0x000004, "Wrong alignment on FClip_Scale");
static_assert(sizeof(FClip_Scale) == 0x000018, "Wrong size on FClip_Scale");
static_assert(offsetof(FClip_Scale, ActorName_11_7404A59A475B8091C08C45A4CDB37920) == 0x000000, "Member 'FClip_Scale::ActorName_11_7404A59A475B8091C08C45A4CDB37920' has a wrong offset!");
static_assert(offsetof(FClip_Scale, X_26_95470FAE4195A7E035A65FB4AAB306D5) == 0x000008, "Member 'FClip_Scale::X_26_95470FAE4195A7E035A65FB4AAB306D5' has a wrong offset!");
static_assert(offsetof(FClip_Scale, Y_27_0B0A6F9E41D72DCF040D56B1ABA0434A) == 0x00000C, "Member 'FClip_Scale::Y_27_0B0A6F9E41D72DCF040D56B1ABA0434A' has a wrong offset!");
static_assert(offsetof(FClip_Scale, Z_28_82E375674D95F67759F45FB8BD7A7F13) == 0x000010, "Member 'FClip_Scale::Z_28_82E375674D95F67759F45FB8BD7A7F13' has a wrong offset!");
static_assert(offsetof(FClip_Scale, Priority_22_916BFFE8418D4A765D853DAFDCD63C62) == 0x000014, "Member 'FClip_Scale::Priority_22_916BFFE8418D4A765D853DAFDCD63C62' has a wrong offset!");

}

