#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_StoryActorDraw

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_StoryActorDraw.Clip_StoryActorDraw
// 0x0028 (0x0028 - 0x0000)
struct FClip_StoryActorDraw final
{
public:
	class FString                                 LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   ActorName_37_AE6F648142F232AD3900D6BB39044FE0;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StoryName_39_E3FF898A4059BB99A368599E1DD3553F;     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden_49_7EEAD0A34F1D64BC30AEA18D12BDD29F;        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_47_0AA6C112432BFB7CA197E9ABD3F215B1;      // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_StoryActorDraw) == 0x000008, "Wrong alignment on FClip_StoryActorDraw");
static_assert(sizeof(FClip_StoryActorDraw) == 0x000028, "Wrong size on FClip_StoryActorDraw");
static_assert(offsetof(FClip_StoryActorDraw, LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_StoryActorDraw::LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_StoryActorDraw, ActorName_37_AE6F648142F232AD3900D6BB39044FE0) == 0x000010, "Member 'FClip_StoryActorDraw::ActorName_37_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_StoryActorDraw, StoryName_39_E3FF898A4059BB99A368599E1DD3553F) == 0x000018, "Member 'FClip_StoryActorDraw::StoryName_39_E3FF898A4059BB99A368599E1DD3553F' has a wrong offset!");
static_assert(offsetof(FClip_StoryActorDraw, Hidden_49_7EEAD0A34F1D64BC30AEA18D12BDD29F) == 0x000020, "Member 'FClip_StoryActorDraw::Hidden_49_7EEAD0A34F1D64BC30AEA18D12BDD29F' has a wrong offset!");
static_assert(offsetof(FClip_StoryActorDraw, Priority_47_0AA6C112432BFB7CA197E9ABD3F215B1) == 0x000021, "Member 'FClip_StoryActorDraw::Priority_47_0AA6C112432BFB7CA197E9ABD3F215B1' has a wrong offset!");

}

