#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_BranchToClip

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_BranchToClip.Clip_BranchToClip
// 0x0068 (0x0068 - 0x0000)
struct FClip_BranchToClip final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Case0_43_AE6F648142F232AD3900D6BB39044FE0;         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Case1_44_58350A1F4269240B2388EF80C1393CE3;         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Case2_45_4AEFDCA2428CB4E48092A592DE75B325;         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Case3_46_A11EC535491C06D2D37CC596DA1C4470;         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Default_47_E50D88244D2E0E613C7825B8250BEC71;       // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          EvalOnSkip_50_4702DB94489EEFE0A879D7825D7388E3;    // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_42_4C8458A242AAEB34769A82B06B4A5789;      // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_BranchToClip) == 0x000008, "Wrong alignment on FClip_BranchToClip");
static_assert(sizeof(FClip_BranchToClip) == 0x000068, "Wrong size on FClip_BranchToClip");
static_assert(offsetof(FClip_BranchToClip, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_BranchToClip::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_BranchToClip, Case0_43_AE6F648142F232AD3900D6BB39044FE0) == 0x000010, "Member 'FClip_BranchToClip::Case0_43_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_BranchToClip, Case1_44_58350A1F4269240B2388EF80C1393CE3) == 0x000020, "Member 'FClip_BranchToClip::Case1_44_58350A1F4269240B2388EF80C1393CE3' has a wrong offset!");
static_assert(offsetof(FClip_BranchToClip, Case2_45_4AEFDCA2428CB4E48092A592DE75B325) == 0x000030, "Member 'FClip_BranchToClip::Case2_45_4AEFDCA2428CB4E48092A592DE75B325' has a wrong offset!");
static_assert(offsetof(FClip_BranchToClip, Case3_46_A11EC535491C06D2D37CC596DA1C4470) == 0x000040, "Member 'FClip_BranchToClip::Case3_46_A11EC535491C06D2D37CC596DA1C4470' has a wrong offset!");
static_assert(offsetof(FClip_BranchToClip, Default_47_E50D88244D2E0E613C7825B8250BEC71) == 0x000050, "Member 'FClip_BranchToClip::Default_47_E50D88244D2E0E613C7825B8250BEC71' has a wrong offset!");
static_assert(offsetof(FClip_BranchToClip, EvalOnSkip_50_4702DB94489EEFE0A879D7825D7388E3) == 0x000060, "Member 'FClip_BranchToClip::EvalOnSkip_50_4702DB94489EEFE0A879D7825D7388E3' has a wrong offset!");
static_assert(offsetof(FClip_BranchToClip, Priority_42_4C8458A242AAEB34769A82B06B4A5789) == 0x000061, "Member 'FClip_BranchToClip::Priority_42_4C8458A242AAEB34769A82B06B4A5789' has a wrong offset!");

}

