#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_AttachToCamera

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_AttachToCamera.Clip_AttachToCamera
// 0x0014 (0x0014 - 0x0000)
struct FClip_AttachToCamera final
{
public:
	class FName                                   ActorLevelName_17_473097EF4DCFAD6996E883B623E8CB3B; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActorName_16_4CF9BDBD4F87C1C8F23AD580079A6316;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Detatch_10_E1782EB546AB1165500DF299D630220E;       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_12_163B639E414B819CD1BC2FB05F85FFC6;      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_AttachToCamera) == 0x000004, "Wrong alignment on FClip_AttachToCamera");
static_assert(sizeof(FClip_AttachToCamera) == 0x000014, "Wrong size on FClip_AttachToCamera");
static_assert(offsetof(FClip_AttachToCamera, ActorLevelName_17_473097EF4DCFAD6996E883B623E8CB3B) == 0x000000, "Member 'FClip_AttachToCamera::ActorLevelName_17_473097EF4DCFAD6996E883B623E8CB3B' has a wrong offset!");
static_assert(offsetof(FClip_AttachToCamera, ActorName_16_4CF9BDBD4F87C1C8F23AD580079A6316) == 0x000008, "Member 'FClip_AttachToCamera::ActorName_16_4CF9BDBD4F87C1C8F23AD580079A6316' has a wrong offset!");
static_assert(offsetof(FClip_AttachToCamera, Detatch_10_E1782EB546AB1165500DF299D630220E) == 0x000010, "Member 'FClip_AttachToCamera::Detatch_10_E1782EB546AB1165500DF299D630220E' has a wrong offset!");
static_assert(offsetof(FClip_AttachToCamera, Priority_12_163B639E414B819CD1BC2FB05F85FFC6) == 0x000011, "Member 'FClip_AttachToCamera::Priority_12_163B639E414B819CD1BC2FB05F85FFC6' has a wrong offset!");

}

