#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_WeaponConstraint

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_WeaponConstraint.Clip_WeaponConstraint
// 0x0024 (0x0024 - 0x0000)
struct FClip_WeaponConstraint final
{
public:
	class FName                                   LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ActorName_41_B866B4C142789D9BC2167CA4BCE4A280;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ParentName_42_FBC98ECF426C6ED2E04A5AA17E472FA6;    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_43_27E6A3FD4B007DE1565510A411874070;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Detach_37_96C1761542C2F2E20018F2BE47E11229;        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_48_967A000F4DD4CD63EB6F13BA61ADAF18;      // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_WeaponConstraint) == 0x000004, "Wrong alignment on FClip_WeaponConstraint");
static_assert(sizeof(FClip_WeaponConstraint) == 0x000024, "Wrong size on FClip_WeaponConstraint");
static_assert(offsetof(FClip_WeaponConstraint, LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_WeaponConstraint::LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_WeaponConstraint, ActorName_41_B866B4C142789D9BC2167CA4BCE4A280) == 0x000008, "Member 'FClip_WeaponConstraint::ActorName_41_B866B4C142789D9BC2167CA4BCE4A280' has a wrong offset!");
static_assert(offsetof(FClip_WeaponConstraint, ParentName_42_FBC98ECF426C6ED2E04A5AA17E472FA6) == 0x000010, "Member 'FClip_WeaponConstraint::ParentName_42_FBC98ECF426C6ED2E04A5AA17E472FA6' has a wrong offset!");
static_assert(offsetof(FClip_WeaponConstraint, SocketName_43_27E6A3FD4B007DE1565510A411874070) == 0x000018, "Member 'FClip_WeaponConstraint::SocketName_43_27E6A3FD4B007DE1565510A411874070' has a wrong offset!");
static_assert(offsetof(FClip_WeaponConstraint, Detach_37_96C1761542C2F2E20018F2BE47E11229) == 0x000020, "Member 'FClip_WeaponConstraint::Detach_37_96C1761542C2F2E20018F2BE47E11229' has a wrong offset!");
static_assert(offsetof(FClip_WeaponConstraint, Priority_48_967A000F4DD4CD63EB6F13BA61ADAF18) == 0x000021, "Member 'FClip_WeaponConstraint::Priority_48_967A000F4DD4CD63EB6F13BA61ADAF18' has a wrong offset!");

}

