#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ActorCulling

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ActorCulling.Clip_ActorCulling
// 0x0020 (0x0020 - 0x0000)
struct FClip_ActorCulling final
{
public:
	class FName                                   LevelName_32_C6B2ED9E46658F5DCB520C98721C4A88;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           ActorNames_45_AE6F648142F232AD3900D6BB39044FE0;    // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          Enable_44_94F059764C0E39AE52BB06A8A35C2084;        // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_40_744368504A3CC4C5A132C38984E74586;      // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ActorCulling) == 0x000008, "Wrong alignment on FClip_ActorCulling");
static_assert(sizeof(FClip_ActorCulling) == 0x000020, "Wrong size on FClip_ActorCulling");
static_assert(offsetof(FClip_ActorCulling, LevelName_32_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_ActorCulling::LevelName_32_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_ActorCulling, ActorNames_45_AE6F648142F232AD3900D6BB39044FE0) == 0x000008, "Member 'FClip_ActorCulling::ActorNames_45_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_ActorCulling, Enable_44_94F059764C0E39AE52BB06A8A35C2084) == 0x000018, "Member 'FClip_ActorCulling::Enable_44_94F059764C0E39AE52BB06A8A35C2084' has a wrong offset!");
static_assert(offsetof(FClip_ActorCulling, Priority_40_744368504A3CC4C5A132C38984E74586) == 0x000019, "Member 'FClip_ActorCulling::Priority_40_744368504A3CC4C5A132C38984E74586' has a wrong offset!");

}

