#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_LoadMovie

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_LoadMovie.Clip_LoadMovie
// 0x0028 (0x0028 - 0x0000)
struct FClip_LoadMovie final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MovieMaterial_26_1F6495734024815C222D5FA35D22BE72; // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Priority_30_D63677AA4B77403A8333A0B97D2140E5;      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_LoadMovie) == 0x000008, "Wrong alignment on FClip_LoadMovie");
static_assert(sizeof(FClip_LoadMovie) == 0x000028, "Wrong size on FClip_LoadMovie");
static_assert(offsetof(FClip_LoadMovie, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_LoadMovie::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_LoadMovie, MovieMaterial_26_1F6495734024815C222D5FA35D22BE72) == 0x000010, "Member 'FClip_LoadMovie::MovieMaterial_26_1F6495734024815C222D5FA35D22BE72' has a wrong offset!");
static_assert(offsetof(FClip_LoadMovie, Priority_30_D63677AA4B77403A8333A0B97D2140E5) == 0x000020, "Member 'FClip_LoadMovie::Priority_30_D63677AA4B77403A8333A0B97D2140E5' has a wrong offset!");

}

