#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_BGM

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_BGM.Clip_BGM
// 0x0030 (0x0030 - 0x0000)
struct FClip_BGM final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MusicName_28_047B33D749EF5DEC71574CBAFCDBFF96;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         FadeStart_29_9EDFBE1A4D1816BDC8A23EB73F6E7D03;     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeEnd_30_DEFB138D4B6615718E1754A4F129A6D8;       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CrossFade_32_97EC6116435C1C6D005456913B240A1E;     // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_35_B2265C3F45B29380469F20A9E9D050A9;      // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_BGM) == 0x000008, "Wrong alignment on FClip_BGM");
static_assert(sizeof(FClip_BGM) == 0x000030, "Wrong size on FClip_BGM");
static_assert(offsetof(FClip_BGM, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_BGM::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_BGM, MusicName_28_047B33D749EF5DEC71574CBAFCDBFF96) == 0x000010, "Member 'FClip_BGM::MusicName_28_047B33D749EF5DEC71574CBAFCDBFF96' has a wrong offset!");
static_assert(offsetof(FClip_BGM, FadeStart_29_9EDFBE1A4D1816BDC8A23EB73F6E7D03) == 0x000020, "Member 'FClip_BGM::FadeStart_29_9EDFBE1A4D1816BDC8A23EB73F6E7D03' has a wrong offset!");
static_assert(offsetof(FClip_BGM, FadeEnd_30_DEFB138D4B6615718E1754A4F129A6D8) == 0x000024, "Member 'FClip_BGM::FadeEnd_30_DEFB138D4B6615718E1754A4F129A6D8' has a wrong offset!");
static_assert(offsetof(FClip_BGM, CrossFade_32_97EC6116435C1C6D005456913B240A1E) == 0x000028, "Member 'FClip_BGM::CrossFade_32_97EC6116435C1C6D005456913B240A1E' has a wrong offset!");
static_assert(offsetof(FClip_BGM, Priority_35_B2265C3F45B29380469F20A9E9D050A9) == 0x000029, "Member 'FClip_BGM::Priority_35_B2265C3F45B29380469F20A9E9D050A9' has a wrong offset!");

}

