#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Se

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Se.Clip_Se
// 0x0030 (0x0030 - 0x0000)
struct FClip_Se final
{
public:
	class FString                                 LevelName_10_88A21DC140A5A32F1BF89692A01AF3A1;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 SeName_13_70DD8E1F42AC37FADBA55C9C8C707D73;        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   SourceActorName_33_3B0256CC4406EE733119618F90DF0A84; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Priority_30_DCBE2E7F412EED5060B8D093D1FC3A77;      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_Se) == 0x000008, "Wrong alignment on FClip_Se");
static_assert(sizeof(FClip_Se) == 0x000030, "Wrong size on FClip_Se");
static_assert(offsetof(FClip_Se, LevelName_10_88A21DC140A5A32F1BF89692A01AF3A1) == 0x000000, "Member 'FClip_Se::LevelName_10_88A21DC140A5A32F1BF89692A01AF3A1' has a wrong offset!");
static_assert(offsetof(FClip_Se, SeName_13_70DD8E1F42AC37FADBA55C9C8C707D73) == 0x000010, "Member 'FClip_Se::SeName_13_70DD8E1F42AC37FADBA55C9C8C707D73' has a wrong offset!");
static_assert(offsetof(FClip_Se, SourceActorName_33_3B0256CC4406EE733119618F90DF0A84) == 0x000020, "Member 'FClip_Se::SourceActorName_33_3B0256CC4406EE733119618F90DF0A84' has a wrong offset!");
static_assert(offsetof(FClip_Se, Priority_30_DCBE2E7F412EED5060B8D093D1FC3A77) == 0x000028, "Member 'FClip_Se::Priority_30_DCBE2E7F412EED5060B8D093D1FC3A77' has a wrong offset!");

}

