#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_DirLightModify

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_DirLightModify.Clip_DirLightModify
// 0x0018 (0x0018 - 0x0000)
struct FClip_DirLightModify final
{
public:
	TArray<class FName>                           ActorNames_5_A93409164F638BF138BB088AF51D0370;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          Enable_13_65B09665409119D03C5E69A972F40DA6;        // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_14_1D1199354A4D9173839D16984D6903A6;      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_DirLightModify) == 0x000008, "Wrong alignment on FClip_DirLightModify");
static_assert(sizeof(FClip_DirLightModify) == 0x000018, "Wrong size on FClip_DirLightModify");
static_assert(offsetof(FClip_DirLightModify, ActorNames_5_A93409164F638BF138BB088AF51D0370) == 0x000000, "Member 'FClip_DirLightModify::ActorNames_5_A93409164F638BF138BB088AF51D0370' has a wrong offset!");
static_assert(offsetof(FClip_DirLightModify, Enable_13_65B09665409119D03C5E69A972F40DA6) == 0x000010, "Member 'FClip_DirLightModify::Enable_13_65B09665409119D03C5E69A972F40DA6' has a wrong offset!");
static_assert(offsetof(FClip_DirLightModify, Priority_14_1D1199354A4D9173839D16984D6903A6) == 0x000011, "Member 'FClip_DirLightModify::Priority_14_1D1199354A4D9173839D16984D6903A6' has a wrong offset!");

}

