#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_TargetEnemyDraw

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_TargetEnemyDraw.Clip_TargetEnemyDraw
// 0x000C (0x000C - 0x0000)
struct FClip_TargetEnemyDraw final
{
public:
	class FName                                   LevelName_33_C6B2ED9E46658F5DCB520C98721C4A88;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden_29_B620A2B3462916D5B03C8D98B72CC288;        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_32_D4BB2840400522CE3AB8E2A2340A3108;      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_TargetEnemyDraw) == 0x000004, "Wrong alignment on FClip_TargetEnemyDraw");
static_assert(sizeof(FClip_TargetEnemyDraw) == 0x00000C, "Wrong size on FClip_TargetEnemyDraw");
static_assert(offsetof(FClip_TargetEnemyDraw, LevelName_33_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_TargetEnemyDraw::LevelName_33_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_TargetEnemyDraw, Hidden_29_B620A2B3462916D5B03C8D98B72CC288) == 0x000008, "Member 'FClip_TargetEnemyDraw::Hidden_29_B620A2B3462916D5B03C8D98B72CC288' has a wrong offset!");
static_assert(offsetof(FClip_TargetEnemyDraw, Priority_32_D4BB2840400522CE3AB8E2A2340A3108) == 0x000009, "Member 'FClip_TargetEnemyDraw::Priority_32_D4BB2840400522CE3AB8E2A2340A3108' has a wrong offset!");

}

