#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_OverrideCharaPopDistance

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_OverrideCharaPopDistance.Clip_OverrideCharaPopDistance
// 0x0010 (0x0010 - 0x0000)
struct FClip_OverrideCharaPopDistance final
{
public:
	int32                                         EnableDrawDistance_8_842DFDAE410C4AAB175061AE191D684A; // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCameraTickDistance_9_79B178B747C6CD3C399D5C80DDF784CC; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OutCameraTickDistance_10_F8A7710149BCDDC8587436949C0DE0F2; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Priority_11_8A8B399D4BEEE84EE1C47099546A1C36;      // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_OverrideCharaPopDistance) == 0x000004, "Wrong alignment on FClip_OverrideCharaPopDistance");
static_assert(sizeof(FClip_OverrideCharaPopDistance) == 0x000010, "Wrong size on FClip_OverrideCharaPopDistance");
static_assert(offsetof(FClip_OverrideCharaPopDistance, EnableDrawDistance_8_842DFDAE410C4AAB175061AE191D684A) == 0x000000, "Member 'FClip_OverrideCharaPopDistance::EnableDrawDistance_8_842DFDAE410C4AAB175061AE191D684A' has a wrong offset!");
static_assert(offsetof(FClip_OverrideCharaPopDistance, InCameraTickDistance_9_79B178B747C6CD3C399D5C80DDF784CC) == 0x000004, "Member 'FClip_OverrideCharaPopDistance::InCameraTickDistance_9_79B178B747C6CD3C399D5C80DDF784CC' has a wrong offset!");
static_assert(offsetof(FClip_OverrideCharaPopDistance, OutCameraTickDistance_10_F8A7710149BCDDC8587436949C0DE0F2) == 0x000008, "Member 'FClip_OverrideCharaPopDistance::OutCameraTickDistance_10_F8A7710149BCDDC8587436949C0DE0F2' has a wrong offset!");
static_assert(offsetof(FClip_OverrideCharaPopDistance, Priority_11_8A8B399D4BEEE84EE1C47099546A1C36) == 0x00000C, "Member 'FClip_OverrideCharaPopDistance::Priority_11_8A8B399D4BEEE84EE1C47099546A1C36' has a wrong offset!");

}

