#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_EnvLightModify

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_EnvLightModify.Clip_EnvLightModify
// 0x0030 (0x0030 - 0x0000)
struct FClip_EnvLightModify final
{
public:
	class FString                                 LevelName_2_62BF73974658CD8BFA8661B4022251B0;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EEndCutEnvironmentLightMode                   Mode_18_2A25DEE74DE94402FA73B2A647E8C010;          // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           ActorNames_12_1D30F9924BB76C6E881E028EAA8466EB;    // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	uint8                                         Priority_15_6AEB05A54042FB9DBB7D2095D49373B6;      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_EnvLightModify) == 0x000008, "Wrong alignment on FClip_EnvLightModify");
static_assert(sizeof(FClip_EnvLightModify) == 0x000030, "Wrong size on FClip_EnvLightModify");
static_assert(offsetof(FClip_EnvLightModify, LevelName_2_62BF73974658CD8BFA8661B4022251B0) == 0x000000, "Member 'FClip_EnvLightModify::LevelName_2_62BF73974658CD8BFA8661B4022251B0' has a wrong offset!");
static_assert(offsetof(FClip_EnvLightModify, Mode_18_2A25DEE74DE94402FA73B2A647E8C010) == 0x000010, "Member 'FClip_EnvLightModify::Mode_18_2A25DEE74DE94402FA73B2A647E8C010' has a wrong offset!");
static_assert(offsetof(FClip_EnvLightModify, ActorNames_12_1D30F9924BB76C6E881E028EAA8466EB) == 0x000018, "Member 'FClip_EnvLightModify::ActorNames_12_1D30F9924BB76C6E881E028EAA8466EB' has a wrong offset!");
static_assert(offsetof(FClip_EnvLightModify, Priority_15_6AEB05A54042FB9DBB7D2095D49373B6) == 0x000028, "Member 'FClip_EnvLightModify::Priority_15_6AEB05A54042FB9DBB7D2095D49373B6' has a wrong offset!");

}

