#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_FieldLight

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_FieldLight.Clip_FieldLight
// 0x0018 (0x0018 - 0x0000)
struct FClip_FieldLight final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ShowLight_34_AE6F648142F232AD3900D6BB39044FE0;     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CastShadow_35_68E7E4CD4414647712119C8B25DD194B;    // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5;      // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_FieldLight) == 0x000008, "Wrong alignment on FClip_FieldLight");
static_assert(sizeof(FClip_FieldLight) == 0x000018, "Wrong size on FClip_FieldLight");
static_assert(offsetof(FClip_FieldLight, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_FieldLight::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_FieldLight, ShowLight_34_AE6F648142F232AD3900D6BB39044FE0) == 0x000010, "Member 'FClip_FieldLight::ShowLight_34_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_FieldLight, CastShadow_35_68E7E4CD4414647712119C8B25DD194B) == 0x000011, "Member 'FClip_FieldLight::CastShadow_35_68E7E4CD4414647712119C8B25DD194B' has a wrong offset!");
static_assert(offsetof(FClip_FieldLight, Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5) == 0x000012, "Member 'FClip_FieldLight::Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5' has a wrong offset!");

}

