#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_SelectWidget

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_SelectWidget.Clip_SelectWidget
// 0x0068 (0x0068 - 0x0000)
struct FClip_SelectWidget final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Title_28_8D92B141417D05A0E5D22EB6AE177136;         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Item0_29_82E44E7143E37AEF86BB53951CB95FF8;         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Item1_30_09A2001F4E268E6FE6CBE7875D3D97FB;         // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Item2_31_5CAED2A94C3ECAA119DFC7B549FFADBA;         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Item3_32_0DCABA9540ECEA3D40DF3EAA59C4B0A2;         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          NewStyle_34_D33940344CE4E88BBB48D9851D79B6E3;      // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Erase_39_705D46074ADE3B7FD248F9928EB93F70;         // 0x0061(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndCutSelectWidgetOption                     Option0_49_61E8BAC640235125C16D3A8CD77FAAF7;       // 0x0062(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndCutSelectWidgetOption                     Option1_54_B60BAB02456079BE3302AC86DA3D6200;       // 0x0063(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndCutSelectWidgetOption                     Option2_55_0235BA594990B12445B536BFAEAC8E64;       // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndCutSelectWidgetOption                     Option3_56_281F8E74441472ACD2708AA44B898818;       // 0x0065(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Priority_58_90CC4FB24F9C3C3FD0531CB4CB310D14;      // 0x0066(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_SelectWidget) == 0x000008, "Wrong alignment on FClip_SelectWidget");
static_assert(sizeof(FClip_SelectWidget) == 0x000068, "Wrong size on FClip_SelectWidget");
static_assert(offsetof(FClip_SelectWidget, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_SelectWidget::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Title_28_8D92B141417D05A0E5D22EB6AE177136) == 0x000010, "Member 'FClip_SelectWidget::Title_28_8D92B141417D05A0E5D22EB6AE177136' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Item0_29_82E44E7143E37AEF86BB53951CB95FF8) == 0x000020, "Member 'FClip_SelectWidget::Item0_29_82E44E7143E37AEF86BB53951CB95FF8' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Item1_30_09A2001F4E268E6FE6CBE7875D3D97FB) == 0x000030, "Member 'FClip_SelectWidget::Item1_30_09A2001F4E268E6FE6CBE7875D3D97FB' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Item2_31_5CAED2A94C3ECAA119DFC7B549FFADBA) == 0x000040, "Member 'FClip_SelectWidget::Item2_31_5CAED2A94C3ECAA119DFC7B549FFADBA' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Item3_32_0DCABA9540ECEA3D40DF3EAA59C4B0A2) == 0x000050, "Member 'FClip_SelectWidget::Item3_32_0DCABA9540ECEA3D40DF3EAA59C4B0A2' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, NewStyle_34_D33940344CE4E88BBB48D9851D79B6E3) == 0x000060, "Member 'FClip_SelectWidget::NewStyle_34_D33940344CE4E88BBB48D9851D79B6E3' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Erase_39_705D46074ADE3B7FD248F9928EB93F70) == 0x000061, "Member 'FClip_SelectWidget::Erase_39_705D46074ADE3B7FD248F9928EB93F70' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Option0_49_61E8BAC640235125C16D3A8CD77FAAF7) == 0x000062, "Member 'FClip_SelectWidget::Option0_49_61E8BAC640235125C16D3A8CD77FAAF7' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Option1_54_B60BAB02456079BE3302AC86DA3D6200) == 0x000063, "Member 'FClip_SelectWidget::Option1_54_B60BAB02456079BE3302AC86DA3D6200' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Option2_55_0235BA594990B12445B536BFAEAC8E64) == 0x000064, "Member 'FClip_SelectWidget::Option2_55_0235BA594990B12445B536BFAEAC8E64' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Option3_56_281F8E74441472ACD2708AA44B898818) == 0x000065, "Member 'FClip_SelectWidget::Option3_56_281F8E74441472ACD2708AA44B898818' has a wrong offset!");
static_assert(offsetof(FClip_SelectWidget, Priority_58_90CC4FB24F9C3C3FD0531CB4CB310D14) == 0x000066, "Member 'FClip_SelectWidget::Priority_58_90CC4FB24F9C3C3FD0531CB4CB310D14' has a wrong offset!");

}

