#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_SendTrigger

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_SendTrigger.Clip_SendTrigger
// 0x0060 (0x0060 - 0x0000)
struct FClip_SendTrigger final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EEndCutExtraClipType                          TriggerType_42_1F6495734024815C222D5FA35D22BE72;   // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Value00_43_20DDB4604ECA9E04B6CAD683BC2054D3;       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Value01_44_6A2F0FDB4952BAF08931F0A7EB20D24C;       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Value02_45_A2AB323E43AFC368C3DCC3B603119025;       // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Value03_46_6DB9140743F14D537A52A3A7D2733578;       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Priority_49_5FE1067847672A734D60A9B9A87E2A3C;      // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_SendTrigger) == 0x000008, "Wrong alignment on FClip_SendTrigger");
static_assert(sizeof(FClip_SendTrigger) == 0x000060, "Wrong size on FClip_SendTrigger");
static_assert(offsetof(FClip_SendTrigger, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_SendTrigger::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_SendTrigger, TriggerType_42_1F6495734024815C222D5FA35D22BE72) == 0x000010, "Member 'FClip_SendTrigger::TriggerType_42_1F6495734024815C222D5FA35D22BE72' has a wrong offset!");
static_assert(offsetof(FClip_SendTrigger, Value00_43_20DDB4604ECA9E04B6CAD683BC2054D3) == 0x000018, "Member 'FClip_SendTrigger::Value00_43_20DDB4604ECA9E04B6CAD683BC2054D3' has a wrong offset!");
static_assert(offsetof(FClip_SendTrigger, Value01_44_6A2F0FDB4952BAF08931F0A7EB20D24C) == 0x000028, "Member 'FClip_SendTrigger::Value01_44_6A2F0FDB4952BAF08931F0A7EB20D24C' has a wrong offset!");
static_assert(offsetof(FClip_SendTrigger, Value02_45_A2AB323E43AFC368C3DCC3B603119025) == 0x000038, "Member 'FClip_SendTrigger::Value02_45_A2AB323E43AFC368C3DCC3B603119025' has a wrong offset!");
static_assert(offsetof(FClip_SendTrigger, Value03_46_6DB9140743F14D537A52A3A7D2733578) == 0x000048, "Member 'FClip_SendTrigger::Value03_46_6DB9140743F14D537A52A3A7D2733578' has a wrong offset!");
static_assert(offsetof(FClip_SendTrigger, Priority_49_5FE1067847672A734D60A9B9A87E2A3C) == 0x000058, "Member 'FClip_SendTrigger::Priority_49_5FE1067847672A734D60A9B9A87E2A3C' has a wrong offset!");

}

