#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Skip

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Skip.Clip_Skip
// 0x000C (0x000C - 0x0000)
struct FClip_Skip final
{
public:
	class FName                                   LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88;     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_52_96C1761542C2F2E20018F2BE47E11229;        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_48_967A000F4DD4CD63EB6F13BA61ADAF18;      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_Skip) == 0x000004, "Wrong alignment on FClip_Skip");
static_assert(sizeof(FClip_Skip) == 0x00000C, "Wrong size on FClip_Skip");
static_assert(offsetof(FClip_Skip, LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_Skip::LevelName_50_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_Skip, Enable_52_96C1761542C2F2E20018F2BE47E11229) == 0x000008, "Member 'FClip_Skip::Enable_52_96C1761542C2F2E20018F2BE47E11229' has a wrong offset!");
static_assert(offsetof(FClip_Skip, Priority_48_967A000F4DD4CD63EB6F13BA61ADAF18) == 0x000009, "Member 'FClip_Skip::Priority_48_967A000F4DD4CD63EB6F13BA61ADAF18' has a wrong offset!");

}

