#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_JumpByStory

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_JumpByStory.Clip_JumpByStory
// 0x0028 (0x0028 - 0x0000)
struct FClip_JumpByStory final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 StoryName_29_AE6F648142F232AD3900D6BB39044FE0;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Goto_28_6746FC6340EE339F7D930B86143509EA;          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Priority_32_D491FC3F4B0010E332BA86AA31093A47;      // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_JumpByStory) == 0x000008, "Wrong alignment on FClip_JumpByStory");
static_assert(sizeof(FClip_JumpByStory) == 0x000028, "Wrong size on FClip_JumpByStory");
static_assert(offsetof(FClip_JumpByStory, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_JumpByStory::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_JumpByStory, StoryName_29_AE6F648142F232AD3900D6BB39044FE0) == 0x000010, "Member 'FClip_JumpByStory::StoryName_29_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_JumpByStory, Goto_28_6746FC6340EE339F7D930B86143509EA) == 0x000020, "Member 'FClip_JumpByStory::Goto_28_6746FC6340EE339F7D930B86143509EA' has a wrong offset!");
static_assert(offsetof(FClip_JumpByStory, Priority_32_D491FC3F4B0010E332BA86AA31093A47) == 0x000024, "Member 'FClip_JumpByStory::Priority_32_D491FC3F4B0010E332BA86AA31093A47' has a wrong offset!");

}

