#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Bind

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_Bind.Clip_Bind
// 0x0048 (0x0048 - 0x0000)
struct FClip_Bind final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ActorName_28_B40E29B7452E697A8A1C67A882E87128;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 TrackName_29_09C8E363422B4D82580660A37ECB9429;     // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Unbind_31_86700CD84DC7C2872CF84CB74503CF09;        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NoOffset_37_2EB8AF1745FE48440734268533BA4E44;      // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideAnimBlend_44_61E98A124E38A07D2C7B129BA2B76E7F; // 0x0032(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimBlendTime_35_61AE8C6F4172E57C5AA26EAB6492DF2F; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OverrideIKBlend_45_F4CF329B4F09981A015300A7C73A1553; // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IKBlendTime_46_1F8D8EA24CC1FEC9844906B652C66456;   // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Priority_49_1002E91B40780671158C5194CE498BA2;      // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_Bind) == 0x000008, "Wrong alignment on FClip_Bind");
static_assert(sizeof(FClip_Bind) == 0x000048, "Wrong size on FClip_Bind");
static_assert(offsetof(FClip_Bind, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_Bind::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_Bind, ActorName_28_B40E29B7452E697A8A1C67A882E87128) == 0x000010, "Member 'FClip_Bind::ActorName_28_B40E29B7452E697A8A1C67A882E87128' has a wrong offset!");
static_assert(offsetof(FClip_Bind, TrackName_29_09C8E363422B4D82580660A37ECB9429) == 0x000020, "Member 'FClip_Bind::TrackName_29_09C8E363422B4D82580660A37ECB9429' has a wrong offset!");
static_assert(offsetof(FClip_Bind, Unbind_31_86700CD84DC7C2872CF84CB74503CF09) == 0x000030, "Member 'FClip_Bind::Unbind_31_86700CD84DC7C2872CF84CB74503CF09' has a wrong offset!");
static_assert(offsetof(FClip_Bind, NoOffset_37_2EB8AF1745FE48440734268533BA4E44) == 0x000031, "Member 'FClip_Bind::NoOffset_37_2EB8AF1745FE48440734268533BA4E44' has a wrong offset!");
static_assert(offsetof(FClip_Bind, OverrideAnimBlend_44_61E98A124E38A07D2C7B129BA2B76E7F) == 0x000032, "Member 'FClip_Bind::OverrideAnimBlend_44_61E98A124E38A07D2C7B129BA2B76E7F' has a wrong offset!");
static_assert(offsetof(FClip_Bind, AnimBlendTime_35_61AE8C6F4172E57C5AA26EAB6492DF2F) == 0x000034, "Member 'FClip_Bind::AnimBlendTime_35_61AE8C6F4172E57C5AA26EAB6492DF2F' has a wrong offset!");
static_assert(offsetof(FClip_Bind, OverrideIKBlend_45_F4CF329B4F09981A015300A7C73A1553) == 0x000038, "Member 'FClip_Bind::OverrideIKBlend_45_F4CF329B4F09981A015300A7C73A1553' has a wrong offset!");
static_assert(offsetof(FClip_Bind, IKBlendTime_46_1F8D8EA24CC1FEC9844906B652C66456) == 0x00003C, "Member 'FClip_Bind::IKBlendTime_46_1F8D8EA24CC1FEC9844906B652C66456' has a wrong offset!");
static_assert(offsetof(FClip_Bind, Priority_49_1002E91B40780671158C5194CE498BA2) == 0x000040, "Member 'FClip_Bind::Priority_49_1002E91B40780671158C5194CE498BA2' has a wrong offset!");

}

