#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ResidentEffect

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ResidentEffect.Clip_ResidentEffect
// 0x0028 (0x0028 - 0x0000)
struct FClip_ResidentEffect final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   ActorName_32_8C42B06B40E741F13D2051854D16EC61;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocationMap_44_6523F3C34A97E78BE779C1B7F1A09FDB;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden_43_C3B467A6415F9DBA193C418B4FB871E9;        // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_42_3D12DBFF497BD09F38090289C5DF8151;      // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ResidentEffect) == 0x000008, "Wrong alignment on FClip_ResidentEffect");
static_assert(sizeof(FClip_ResidentEffect) == 0x000028, "Wrong size on FClip_ResidentEffect");
static_assert(offsetof(FClip_ResidentEffect, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_ResidentEffect::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_ResidentEffect, ActorName_32_8C42B06B40E741F13D2051854D16EC61) == 0x000010, "Member 'FClip_ResidentEffect::ActorName_32_8C42B06B40E741F13D2051854D16EC61' has a wrong offset!");
static_assert(offsetof(FClip_ResidentEffect, LocationMap_44_6523F3C34A97E78BE779C1B7F1A09FDB) == 0x000018, "Member 'FClip_ResidentEffect::LocationMap_44_6523F3C34A97E78BE779C1B7F1A09FDB' has a wrong offset!");
static_assert(offsetof(FClip_ResidentEffect, Hidden_43_C3B467A6415F9DBA193C418B4FB871E9) == 0x000020, "Member 'FClip_ResidentEffect::Hidden_43_C3B467A6415F9DBA193C418B4FB871E9' has a wrong offset!");
static_assert(offsetof(FClip_ResidentEffect, Priority_42_3D12DBFF497BD09F38090289C5DF8151) == 0x000021, "Member 'FClip_ResidentEffect::Priority_42_3D12DBFF497BD09F38090289C5DF8151' has a wrong offset!");

}

