#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ActorDrawByState

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ActorDrawByState.Clip_ActorDrawByState
// 0x000C (0x000C - 0x0000)
struct FClip_ActorDrawByState final
{
public:
	class FName                                   CharaID_47_AE6F648142F232AD3900D6BB39044FE0;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndCutBattleCharaStateType                   ActorState_45_F35ADDCF4354CED91EEBC0906FF7BCC3;    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hidden_41_B3BD485B472BCB4FEE197BADE248D893;        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Priority_44_035B9D0A46F6823A6BA01E9ABA0D4108;      // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ActorDrawByState) == 0x000004, "Wrong alignment on FClip_ActorDrawByState");
static_assert(sizeof(FClip_ActorDrawByState) == 0x00000C, "Wrong size on FClip_ActorDrawByState");
static_assert(offsetof(FClip_ActorDrawByState, CharaID_47_AE6F648142F232AD3900D6BB39044FE0) == 0x000000, "Member 'FClip_ActorDrawByState::CharaID_47_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_ActorDrawByState, ActorState_45_F35ADDCF4354CED91EEBC0906FF7BCC3) == 0x000008, "Member 'FClip_ActorDrawByState::ActorState_45_F35ADDCF4354CED91EEBC0906FF7BCC3' has a wrong offset!");
static_assert(offsetof(FClip_ActorDrawByState, Hidden_41_B3BD485B472BCB4FEE197BADE248D893) == 0x000009, "Member 'FClip_ActorDrawByState::Hidden_41_B3BD485B472BCB4FEE197BADE248D893' has a wrong offset!");
static_assert(offsetof(FClip_ActorDrawByState, Priority_44_035B9D0A46F6823A6BA01E9ABA0D4108) == 0x00000A, "Member 'FClip_ActorDrawByState::Priority_44_035B9D0A46F6823A6BA01E9ABA0D4108' has a wrong offset!");

}

