#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_ColorCorrection

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_ColorCorrection.Clip_ColorCorrection
// 0x0030 (0x0030 - 0x0000)
struct FClip_ColorCorrection final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	float                                         Intensity_33_3135DDB049984C9207DB25B22D36F2C8;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ActorName_32_AE6F648142F232AD3900D6BB39044FE0;     // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5;      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_ColorCorrection) == 0x000008, "Wrong alignment on FClip_ColorCorrection");
static_assert(sizeof(FClip_ColorCorrection) == 0x000030, "Wrong size on FClip_ColorCorrection");
static_assert(offsetof(FClip_ColorCorrection, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_ColorCorrection::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_ColorCorrection, Intensity_33_3135DDB049984C9207DB25B22D36F2C8) == 0x000010, "Member 'FClip_ColorCorrection::Intensity_33_3135DDB049984C9207DB25B22D36F2C8' has a wrong offset!");
static_assert(offsetof(FClip_ColorCorrection, ActorName_32_AE6F648142F232AD3900D6BB39044FE0) == 0x000018, "Member 'FClip_ColorCorrection::ActorName_32_AE6F648142F232AD3900D6BB39044FE0' has a wrong offset!");
static_assert(offsetof(FClip_ColorCorrection, Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5) == 0x000028, "Member 'FClip_ColorCorrection::Priority_28_398BEF424ED0E29C9F2367AEAD2C69E5' has a wrong offset!");

}

