#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_CacheBGM

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Clip_CacheBGM.Clip_CacheBGM
// 0x0028 (0x0028 - 0x0000)
struct FClip_CacheBGM final
{
public:
	class FString                                 LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88;      // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 MusicName_28_047B33D749EF5DEC71574CBAFCDBFF96;     // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	uint8                                         Priority_35_6FBE5ABC4821FDC6059C5F882BF8ACC0;      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FClip_CacheBGM) == 0x000008, "Wrong alignment on FClip_CacheBGM");
static_assert(sizeof(FClip_CacheBGM) == 0x000028, "Wrong size on FClip_CacheBGM");
static_assert(offsetof(FClip_CacheBGM, LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88) == 0x000000, "Member 'FClip_CacheBGM::LevelName_7_C6B2ED9E46658F5DCB520C98721C4A88' has a wrong offset!");
static_assert(offsetof(FClip_CacheBGM, MusicName_28_047B33D749EF5DEC71574CBAFCDBFF96) == 0x000010, "Member 'FClip_CacheBGM::MusicName_28_047B33D749EF5DEC71574CBAFCDBFF96' has a wrong offset!");
static_assert(offsetof(FClip_CacheBGM, Priority_35_6FBE5ABC4821FDC6059C5F882BF8ACC0) == 0x000020, "Member 'FClip_CacheBGM::Priority_35_6FBE5ABC4821FDC6059C5F882BF8ACC0' has a wrong offset!");

}

