#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Coliseum_ScrollItem

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Coliseum_ScrollItem.Coliseum_ScrollItem_C
// 0x0110 (0x0470 - 0x0360)
class UColiseum_ScrollItem_C final : public UEndUserWidget
{
public:
	class UEndImage*                              G1_Base1;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy1;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy10;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy11;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy12;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy13;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy14;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy15;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy16;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy2;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy3;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy4;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy5;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy6;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy7;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy8;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Enemy9;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num1;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num10;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num11;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num12;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num13;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num14;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num15;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num16;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num2;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num3;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num4;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num5;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num6;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num7;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num8;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num9;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title1;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Coliseum_ScrollItem_C">();
	}
	static class UColiseum_ScrollItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColiseum_ScrollItem_C>();
	}
};
static_assert(alignof(UColiseum_ScrollItem_C) == 0x000008, "Wrong alignment on UColiseum_ScrollItem_C");
static_assert(sizeof(UColiseum_ScrollItem_C) == 0x000470, "Wrong size on UColiseum_ScrollItem_C");
static_assert(offsetof(UColiseum_ScrollItem_C, G1_Base1) == 0x000360, "Member 'UColiseum_ScrollItem_C::G1_Base1' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy1) == 0x000368, "Member 'UColiseum_ScrollItem_C::Txt_Enemy1' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy10) == 0x000370, "Member 'UColiseum_ScrollItem_C::Txt_Enemy10' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy11) == 0x000378, "Member 'UColiseum_ScrollItem_C::Txt_Enemy11' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy12) == 0x000380, "Member 'UColiseum_ScrollItem_C::Txt_Enemy12' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy13) == 0x000388, "Member 'UColiseum_ScrollItem_C::Txt_Enemy13' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy14) == 0x000390, "Member 'UColiseum_ScrollItem_C::Txt_Enemy14' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy15) == 0x000398, "Member 'UColiseum_ScrollItem_C::Txt_Enemy15' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy16) == 0x0003A0, "Member 'UColiseum_ScrollItem_C::Txt_Enemy16' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy2) == 0x0003A8, "Member 'UColiseum_ScrollItem_C::Txt_Enemy2' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy3) == 0x0003B0, "Member 'UColiseum_ScrollItem_C::Txt_Enemy3' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy4) == 0x0003B8, "Member 'UColiseum_ScrollItem_C::Txt_Enemy4' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy5) == 0x0003C0, "Member 'UColiseum_ScrollItem_C::Txt_Enemy5' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy6) == 0x0003C8, "Member 'UColiseum_ScrollItem_C::Txt_Enemy6' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy7) == 0x0003D0, "Member 'UColiseum_ScrollItem_C::Txt_Enemy7' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy8) == 0x0003D8, "Member 'UColiseum_ScrollItem_C::Txt_Enemy8' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Enemy9) == 0x0003E0, "Member 'UColiseum_ScrollItem_C::Txt_Enemy9' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num1) == 0x0003E8, "Member 'UColiseum_ScrollItem_C::Txt_Num1' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num10) == 0x0003F0, "Member 'UColiseum_ScrollItem_C::Txt_Num10' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num11) == 0x0003F8, "Member 'UColiseum_ScrollItem_C::Txt_Num11' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num12) == 0x000400, "Member 'UColiseum_ScrollItem_C::Txt_Num12' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num13) == 0x000408, "Member 'UColiseum_ScrollItem_C::Txt_Num13' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num14) == 0x000410, "Member 'UColiseum_ScrollItem_C::Txt_Num14' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num15) == 0x000418, "Member 'UColiseum_ScrollItem_C::Txt_Num15' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num16) == 0x000420, "Member 'UColiseum_ScrollItem_C::Txt_Num16' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num2) == 0x000428, "Member 'UColiseum_ScrollItem_C::Txt_Num2' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num3) == 0x000430, "Member 'UColiseum_ScrollItem_C::Txt_Num3' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num4) == 0x000438, "Member 'UColiseum_ScrollItem_C::Txt_Num4' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num5) == 0x000440, "Member 'UColiseum_ScrollItem_C::Txt_Num5' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num6) == 0x000448, "Member 'UColiseum_ScrollItem_C::Txt_Num6' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num7) == 0x000450, "Member 'UColiseum_ScrollItem_C::Txt_Num7' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num8) == 0x000458, "Member 'UColiseum_ScrollItem_C::Txt_Num8' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Num9) == 0x000460, "Member 'UColiseum_ScrollItem_C::Txt_Num9' has a wrong offset!");
static_assert(offsetof(UColiseum_ScrollItem_C, Txt_Title1) == 0x000468, "Member 'UColiseum_ScrollItem_C::Txt_Title1' has a wrong offset!");

}

