#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_Btn_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Com_Btn_01.Com_Btn_01_C
// 0x0058 (0x03B8 - 0x0360)
class UCom_Btn_01_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Left;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light2;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Left;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Left2;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt;                                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Com_Btn_01(int32 EntryPoint);
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_153_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_179_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Com_Btn_01_C">();
	}
	static class UCom_Btn_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCom_Btn_01_C>();
	}
};
static_assert(alignof(UCom_Btn_01_C) == 0x000008, "Wrong alignment on UCom_Btn_01_C");
static_assert(sizeof(UCom_Btn_01_C) == 0x0003B8, "Wrong size on UCom_Btn_01_C");
static_assert(offsetof(UCom_Btn_01_C, UberGraphFrame) == 0x000360, "Member 'UCom_Btn_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Loop) == 0x000368, "Member 'UCom_Btn_01_C::Loop' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, BtnHover) == 0x000370, "Member 'UCom_Btn_01_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Base) == 0x000378, "Member 'UCom_Btn_01_C::Base' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Base_Left) == 0x000380, "Member 'UCom_Btn_01_C::Base_Left' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Btn_Light) == 0x000388, "Member 'UCom_Btn_01_C::Btn_Light' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Btn_Light2) == 0x000390, "Member 'UCom_Btn_01_C::Btn_Light2' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Btn_Light_Left) == 0x000398, "Member 'UCom_Btn_01_C::Btn_Light_Left' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Btn_Light_Left2) == 0x0003A0, "Member 'UCom_Btn_01_C::Btn_Light_Left2' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Button_00) == 0x0003A8, "Member 'UCom_Btn_01_C::Button_00' has a wrong offset!");
static_assert(offsetof(UCom_Btn_01_C, Txt) == 0x0003B0, "Member 'UCom_Btn_01_C::Txt' has a wrong offset!");

}

