#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_Loading

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Com_Loading.Com_Loading_C
// 0x0120 (0x0480 - 0x0360)
class UCom_Loading_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop2;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           All_Com_Loading;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                All_Nut_BG;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                All_Nut_LoadingText;                               // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Block1;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Block2;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Block3;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Block4;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Block5;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Block6;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Block7;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Block8;                                            // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_22;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_23;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_24;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_25;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_26;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_27;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_28;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_29;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightDot;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Pnl_BG;                                            // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Pnl_LoadingText;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Loading;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Com_Loading(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Com_Loading_C">();
	}
	static class UCom_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCom_Loading_C>();
	}
};
static_assert(alignof(UCom_Loading_C) == 0x000008, "Wrong alignment on UCom_Loading_C");
static_assert(sizeof(UCom_Loading_C) == 0x000480, "Wrong size on UCom_Loading_C");
static_assert(offsetof(UCom_Loading_C, UberGraphFrame) == 0x000360, "Member 'UCom_Loading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Loop2) == 0x000368, "Member 'UCom_Loading_C::Loop2' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Out) == 0x000370, "Member 'UCom_Loading_C::Out' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, In) == 0x000378, "Member 'UCom_Loading_C::In' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Loop) == 0x000380, "Member 'UCom_Loading_C::Loop' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, All_Com_Loading) == 0x000388, "Member 'UCom_Loading_C::All_Com_Loading' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, All_Nut_BG) == 0x000390, "Member 'UCom_Loading_C::All_Nut_BG' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, All_Nut_LoadingText) == 0x000398, "Member 'UCom_Loading_C::All_Nut_LoadingText' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Base) == 0x0003A0, "Member 'UCom_Loading_C::Base' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Block1) == 0x0003A8, "Member 'UCom_Loading_C::Block1' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Block2) == 0x0003B0, "Member 'UCom_Loading_C::Block2' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Block3) == 0x0003B8, "Member 'UCom_Loading_C::Block3' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Block4) == 0x0003C0, "Member 'UCom_Loading_C::Block4' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Block5) == 0x0003C8, "Member 'UCom_Loading_C::Block5' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Block6) == 0x0003D0, "Member 'UCom_Loading_C::Block6' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Block7) == 0x0003D8, "Member 'UCom_Loading_C::Block7' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Block8) == 0x0003E0, "Member 'UCom_Loading_C::Block8' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_4) == 0x0003E8, "Member 'UCom_Loading_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_5) == 0x0003F0, "Member 'UCom_Loading_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_22) == 0x0003F8, "Member 'UCom_Loading_C::EndImage_22' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_23) == 0x000400, "Member 'UCom_Loading_C::EndImage_23' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_24) == 0x000408, "Member 'UCom_Loading_C::EndImage_24' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_25) == 0x000410, "Member 'UCom_Loading_C::EndImage_25' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_26) == 0x000418, "Member 'UCom_Loading_C::EndImage_26' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_27) == 0x000420, "Member 'UCom_Loading_C::EndImage_27' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_28) == 0x000428, "Member 'UCom_Loading_C::EndImage_28' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, EndImage_29) == 0x000430, "Member 'UCom_Loading_C::EndImage_29' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Img_BG) == 0x000438, "Member 'UCom_Loading_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, LightDot) == 0x000440, "Member 'UCom_Loading_C::LightDot' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Line1) == 0x000448, "Member 'UCom_Loading_C::Line1' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Line2) == 0x000450, "Member 'UCom_Loading_C::Line2' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Pnl_BG) == 0x000458, "Member 'UCom_Loading_C::Pnl_BG' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Pnl_LoadingText) == 0x000460, "Member 'UCom_Loading_C::Pnl_LoadingText' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Txt_Info) == 0x000468, "Member 'UCom_Loading_C::Txt_Info' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Txt_Loading) == 0x000470, "Member 'UCom_Loading_C::Txt_Loading' has a wrong offset!");
static_assert(offsetof(UCom_Loading_C, Txt_Title) == 0x000478, "Member 'UCom_Loading_C::Txt_Title' has a wrong offset!");

}

