#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Com_Btn_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Com_Btn_00.Com_Btn_00_C
// 0x0038 (0x0398 - 0x0360)
class UCom_Btn_00_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt;                                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Com_Btn_00(int32 EntryPoint);
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_338_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_351_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Com_Btn_00_C">();
	}
	static class UCom_Btn_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCom_Btn_00_C>();
	}
};
static_assert(alignof(UCom_Btn_00_C) == 0x000008, "Wrong alignment on UCom_Btn_00_C");
static_assert(sizeof(UCom_Btn_00_C) == 0x000398, "Wrong size on UCom_Btn_00_C");
static_assert(offsetof(UCom_Btn_00_C, UberGraphFrame) == 0x000360, "Member 'UCom_Btn_00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Loop) == 0x000368, "Member 'UCom_Btn_00_C::Loop' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, BtnHover) == 0x000370, "Member 'UCom_Btn_00_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Btn_Light) == 0x000378, "Member 'UCom_Btn_00_C::Btn_Light' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Button_00) == 0x000380, "Member 'UCom_Btn_00_C::Button_00' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Light) == 0x000388, "Member 'UCom_Btn_00_C::Light' has a wrong offset!");
static_assert(offsetof(UCom_Btn_00_C, Txt) == 0x000390, "Member 'UCom_Btn_00_C::Txt' has a wrong offset!");

}

