#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_SummonEffect

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_SummonEffect.Command_SummonEffect_C
// 0x00C8 (0x0440 - 0x0378)
class UCommand_SummonEffect_C final : public UEndMenuCmdSummonEffect
{
public:
	class UWidgetAnimation*                       Hovered;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Press;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_Nut;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Color_00;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_00;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_01;                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_02;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_03;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_04;                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Line_00;                                // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_00;                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_01;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_02;                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_03;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_04;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_05;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_06;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Effect_Color;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Effect_Light;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Effect_Particle;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_SummonEffect_C">();
	}
	static class UCommand_SummonEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_SummonEffect_C>();
	}
};
static_assert(alignof(UCommand_SummonEffect_C) == 0x000008, "Wrong alignment on UCommand_SummonEffect_C");
static_assert(sizeof(UCommand_SummonEffect_C) == 0x000440, "Wrong size on UCommand_SummonEffect_C");
static_assert(offsetof(UCommand_SummonEffect_C, Hovered) == 0x000378, "Member 'UCommand_SummonEffect_C::Hovered' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Out) == 0x000380, "Member 'UCommand_SummonEffect_C::Out' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Press) == 0x000388, "Member 'UCommand_SummonEffect_C::Press' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, In) == 0x000390, "Member 'UCommand_SummonEffect_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Loop) == 0x000398, "Member 'UCommand_SummonEffect_C::Loop' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, All_Nut) == 0x0003A0, "Member 'UCommand_SummonEffect_C::All_Nut' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, EndImage_0) == 0x0003A8, "Member 'UCommand_SummonEffect_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, EndImage_1) == 0x0003B0, "Member 'UCommand_SummonEffect_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Color_00) == 0x0003B8, "Member 'UCommand_SummonEffect_C::Img_Effect_Color_00' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Light_00) == 0x0003C0, "Member 'UCommand_SummonEffect_C::Img_Effect_Light_00' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Light_01) == 0x0003C8, "Member 'UCommand_SummonEffect_C::Img_Effect_Light_01' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Light_02) == 0x0003D0, "Member 'UCommand_SummonEffect_C::Img_Effect_Light_02' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Light_03) == 0x0003D8, "Member 'UCommand_SummonEffect_C::Img_Effect_Light_03' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Light_04) == 0x0003E0, "Member 'UCommand_SummonEffect_C::Img_Effect_Light_04' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Line_00) == 0x0003E8, "Member 'UCommand_SummonEffect_C::Img_Effect_Line_00' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Particle_00) == 0x0003F0, "Member 'UCommand_SummonEffect_C::Img_Effect_Particle_00' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Particle_01) == 0x0003F8, "Member 'UCommand_SummonEffect_C::Img_Effect_Particle_01' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Particle_02) == 0x000400, "Member 'UCommand_SummonEffect_C::Img_Effect_Particle_02' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Particle_03) == 0x000408, "Member 'UCommand_SummonEffect_C::Img_Effect_Particle_03' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Particle_04) == 0x000410, "Member 'UCommand_SummonEffect_C::Img_Effect_Particle_04' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Particle_05) == 0x000418, "Member 'UCommand_SummonEffect_C::Img_Effect_Particle_05' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Img_Effect_Particle_06) == 0x000420, "Member 'UCommand_SummonEffect_C::Img_Effect_Particle_06' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Nut_Effect_Color) == 0x000428, "Member 'UCommand_SummonEffect_C::Nut_Effect_Color' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Nut_Effect_Light) == 0x000430, "Member 'UCommand_SummonEffect_C::Nut_Effect_Light' has a wrong offset!");
static_assert(offsetof(UCommand_SummonEffect_C, Nut_Effect_Particle) == 0x000438, "Member 'UCommand_SummonEffect_C::Nut_Effect_Particle' has a wrong offset!");

}

