#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_Cell_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_Cell_00.Command_Cell_00_C
// 0x00B0 (0x0448 - 0x0398)
class UCommand_Cell_00_C final : public UEndCmdShortcutCell
{
public:
	class UWidgetAnimation*                       Default;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CellPage_L;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CellPage_R;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Executed;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn;                                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_CellPage_C*                    Command_CellPage;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_Ability_00;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_TargetHP;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Burst;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Burst_00;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Sense;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status;                                       // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_00;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hovered_Btn;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hovered_Effect;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_HP_Gauge_BG;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_GaugeCharge;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_GaugeCover;                                    // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Number;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Symbol;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_Cell_00_C">();
	}
	static class UCommand_Cell_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_Cell_00_C>();
	}
};
static_assert(alignof(UCommand_Cell_00_C) == 0x000008, "Wrong alignment on UCommand_Cell_00_C");
static_assert(sizeof(UCommand_Cell_00_C) == 0x000448, "Wrong size on UCommand_Cell_00_C");
static_assert(offsetof(UCommand_Cell_00_C, Default) == 0x000398, "Member 'UCommand_Cell_00_C::Default' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, CellPage_L) == 0x0003A0, "Member 'UCommand_Cell_00_C::CellPage_L' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, CellPage_R) == 0x0003A8, "Member 'UCommand_Cell_00_C::CellPage_R' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Executed) == 0x0003B0, "Member 'UCommand_Cell_00_C::Executed' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Hovered) == 0x0003B8, "Member 'UCommand_Cell_00_C::Hovered' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Btn) == 0x0003C0, "Member 'UCommand_Cell_00_C::Btn' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Command_CellPage) == 0x0003C8, "Member 'UCommand_Cell_00_C::Command_CellPage' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Gauge_Ability_00) == 0x0003D0, "Member 'UCommand_Cell_00_C::Gauge_Ability_00' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Gauge_TargetHP) == 0x0003D8, "Member 'UCommand_Cell_00_C::Gauge_TargetHP' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Icon_ATBCost) == 0x0003E0, "Member 'UCommand_Cell_00_C::Icon_ATBCost' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Icon_Burst) == 0x0003E8, "Member 'UCommand_Cell_00_C::Icon_Burst' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Icon_Burst_00) == 0x0003F0, "Member 'UCommand_Cell_00_C::Icon_Burst_00' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Icon_Sense) == 0x0003F8, "Member 'UCommand_Cell_00_C::Icon_Sense' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Icon_Status) == 0x000400, "Member 'UCommand_Cell_00_C::Icon_Status' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Img_Effect_00) == 0x000408, "Member 'UCommand_Cell_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Img_Hovered_Btn) == 0x000410, "Member 'UCommand_Cell_00_C::Img_Hovered_Btn' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Img_Hovered_Effect) == 0x000418, "Member 'UCommand_Cell_00_C::Img_Hovered_Effect' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Img_HP_Gauge_BG) == 0x000420, "Member 'UCommand_Cell_00_C::Img_HP_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Ims_GaugeCharge) == 0x000428, "Member 'UCommand_Cell_00_C::Ims_GaugeCharge' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Ims_GaugeCover) == 0x000430, "Member 'UCommand_Cell_00_C::Ims_GaugeCover' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Txt_Number) == 0x000438, "Member 'UCommand_Cell_00_C::Txt_Number' has a wrong offset!");
static_assert(offsetof(UCommand_Cell_00_C, Txt_Symbol) == 0x000440, "Member 'UCommand_Cell_00_C::Txt_Symbol' has a wrong offset!");

}

