#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_Default

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_Default.Command_Default_C
// 0x0038 (0x0418 - 0x03E0)
class UCommand_Default_C final : public UEndUniqueActionPane
{
public:
	class UWidgetAnimation*                       ShortCut_Shift;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switching;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_Default_Cell_00_C*             Command_Default_Cell_00;                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_Default_Cell_00_C*             Command_Default_Cell_01;                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_Default_C">();
	}
	static class UCommand_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_Default_C>();
	}
};
static_assert(alignof(UCommand_Default_C) == 0x000008, "Wrong alignment on UCommand_Default_C");
static_assert(sizeof(UCommand_Default_C) == 0x000418, "Wrong size on UCommand_Default_C");
static_assert(offsetof(UCommand_Default_C, ShortCut_Shift) == 0x0003E0, "Member 'UCommand_Default_C::ShortCut_Shift' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Out) == 0x0003E8, "Member 'UCommand_Default_C::Out' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Switching) == 0x0003F0, "Member 'UCommand_Default_C::Switching' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, In) == 0x0003F8, "Member 'UCommand_Default_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Command_Default_Cell_00) == 0x000400, "Member 'UCommand_Default_C::Command_Default_Cell_00' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Command_Default_Cell_01) == 0x000408, "Member 'UCommand_Default_C::Command_Default_Cell_01' has a wrong offset!");
static_assert(offsetof(UCommand_Default_C, Icon_ATBCost) == 0x000410, "Member 'UCommand_Default_C::Icon_ATBCost' has a wrong offset!");

}

