#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_List_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_List_00.Command_List_00_C
// 0x0088 (0x03E8 - 0x0360)
class UCommand_List_00_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Preinput_In;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Command_In;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       List_Fade;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hierarchy_In;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hierarchy_Out;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Frame_ATBCost_00;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_LimitEffect_C*                 LimitEffect_00;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPreInput_Icon_C*                       PreInput_Icon;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_SummonEffect_C*                SummonEffect_00;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MP;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MP_MaxNum;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MP_Num;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_List_00_C">();
	}
	static class UCommand_List_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_List_00_C>();
	}
};
static_assert(alignof(UCommand_List_00_C) == 0x000008, "Wrong alignment on UCommand_List_00_C");
static_assert(sizeof(UCommand_List_00_C) == 0x0003E8, "Wrong size on UCommand_List_00_C");
static_assert(offsetof(UCommand_List_00_C, Preinput_In) == 0x000360, "Member 'UCommand_List_00_C::Preinput_In' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Command_In) == 0x000368, "Member 'UCommand_List_00_C::Command_In' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, List_Fade) == 0x000370, "Member 'UCommand_List_00_C::List_Fade' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Hierarchy_In) == 0x000378, "Member 'UCommand_List_00_C::Hierarchy_In' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Hierarchy_Out) == 0x000380, "Member 'UCommand_List_00_C::Hierarchy_Out' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, EndImage_0) == 0x000388, "Member 'UCommand_List_00_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, EndImage_1) == 0x000390, "Member 'UCommand_List_00_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Frame_ATBCost_00) == 0x000398, "Member 'UCommand_List_00_C::Frame_ATBCost_00' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Icon_ATBCost) == 0x0003A0, "Member 'UCommand_List_00_C::Icon_ATBCost' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Img_Base) == 0x0003A8, "Member 'UCommand_List_00_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Img_Player) == 0x0003B0, "Member 'UCommand_List_00_C::Img_Player' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, LimitEffect_00) == 0x0003B8, "Member 'UCommand_List_00_C::LimitEffect_00' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, PreInput_Icon) == 0x0003C0, "Member 'UCommand_List_00_C::PreInput_Icon' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, SummonEffect_00) == 0x0003C8, "Member 'UCommand_List_00_C::SummonEffect_00' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Txt_MP) == 0x0003D0, "Member 'UCommand_List_00_C::Txt_MP' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Txt_MP_MaxNum) == 0x0003D8, "Member 'UCommand_List_00_C::Txt_MP_MaxNum' has a wrong offset!");
static_assert(offsetof(UCommand_List_00_C, Txt_MP_Num) == 0x0003E0, "Member 'UCommand_List_00_C::Txt_MP_Num' has a wrong offset!");

}

