#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_BtnLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_BtnLight.Command_BtnLight_C
// 0x0028 (0x0388 - 0x0360)
class UCommand_BtnLight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hovered_Btn;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Command_BtnLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_BtnLight_C">();
	}
	static class UCommand_BtnLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_BtnLight_C>();
	}
};
static_assert(alignof(UCommand_BtnLight_C) == 0x000008, "Wrong alignment on UCommand_BtnLight_C");
static_assert(sizeof(UCommand_BtnLight_C) == 0x000388, "Wrong size on UCommand_BtnLight_C");
static_assert(offsetof(UCommand_BtnLight_C, UberGraphFrame) == 0x000360, "Member 'UCommand_BtnLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCommand_BtnLight_C, In) == 0x000368, "Member 'UCommand_BtnLight_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_BtnLight_C, Loop) == 0x000370, "Member 'UCommand_BtnLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UCommand_BtnLight_C, Img_BtnLight) == 0x000378, "Member 'UCommand_BtnLight_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UCommand_BtnLight_C, Img_Hovered_Btn) == 0x000380, "Member 'UCommand_BtnLight_C::Img_Hovered_Btn' has a wrong offset!");

}

