#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommandLinkage

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CommandLinkage.CommandLinkage_C
// 0x0090 (0x0440 - 0x03B0)
class UCommandLinkage_C final : public UEndBattleLinkageIcon
{
public:
	class UWidgetAnimation*                       Linkage_Out;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Linkage_Hit;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Linkage_Loop;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Linkage_In;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_00;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_01;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_Shadow;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndNumberLabel*                        EndNumberLabel_0;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Horz_Linkage_Magni;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light_01;                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_00;                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Particle_01;                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_EffectBG_00;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_EffectBG_01;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Linkage_Magni;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Magni;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Percent;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Symbol;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CommandLinkage_C">();
	}
	static class UCommandLinkage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommandLinkage_C>();
	}
};
static_assert(alignof(UCommandLinkage_C) == 0x000008, "Wrong alignment on UCommandLinkage_C");
static_assert(sizeof(UCommandLinkage_C) == 0x000440, "Wrong size on UCommandLinkage_C");
static_assert(offsetof(UCommandLinkage_C, Linkage_Out) == 0x0003B0, "Member 'UCommandLinkage_C::Linkage_Out' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Linkage_Hit) == 0x0003B8, "Member 'UCommandLinkage_C::Linkage_Hit' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Linkage_Loop) == 0x0003C0, "Member 'UCommandLinkage_C::Linkage_Loop' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Linkage_In) == 0x0003C8, "Member 'UCommandLinkage_C::Linkage_In' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Arrow_00) == 0x0003D0, "Member 'UCommandLinkage_C::Arrow_00' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Arrow_01) == 0x0003D8, "Member 'UCommandLinkage_C::Arrow_01' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Arrow_Shadow) == 0x0003E0, "Member 'UCommandLinkage_C::Arrow_Shadow' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, EndNumberLabel_0) == 0x0003E8, "Member 'UCommandLinkage_C::EndNumberLabel_0' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Horz_Linkage_Magni) == 0x0003F0, "Member 'UCommandLinkage_C::Horz_Linkage_Magni' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_Effect_Light_01) == 0x0003F8, "Member 'UCommandLinkage_C::Img_Effect_Light_01' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_Effect_Particle_00) == 0x000400, "Member 'UCommandLinkage_C::Img_Effect_Particle_00' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_Effect_Particle_01) == 0x000408, "Member 'UCommandLinkage_C::Img_Effect_Particle_01' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_EffectBG_00) == 0x000410, "Member 'UCommandLinkage_C::Img_EffectBG_00' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Img_EffectBG_01) == 0x000418, "Member 'UCommandLinkage_C::Img_EffectBG_01' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Nut_Linkage_Magni) == 0x000420, "Member 'UCommandLinkage_C::Nut_Linkage_Magni' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Txt_Magni) == 0x000428, "Member 'UCommandLinkage_C::Txt_Magni' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Txt_Percent) == 0x000430, "Member 'UCommandLinkage_C::Txt_Percent' has a wrong offset!");
static_assert(offsetof(UCommandLinkage_C, Txt_Symbol) == 0x000438, "Member 'UCommandLinkage_C::Txt_Symbol' has a wrong offset!");

}

