#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_ShortCut_List_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_ShortCut_List_00.Command_ShortCut_List_00_C
// 0x0078 (0x03D8 - 0x0360)
class UCommand_ShortCut_List_00_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Switching_R;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Switching_L;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost_L;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_ATBCost_C*                        Icon_ATBCost_R;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_00;                                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_01;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_02;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_Main;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_Shadow;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_ShortCut_List_00_C">();
	}
	static class UCommand_ShortCut_List_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_ShortCut_List_00_C>();
	}
};
static_assert(alignof(UCommand_ShortCut_List_00_C) == 0x000008, "Wrong alignment on UCommand_ShortCut_List_00_C");
static_assert(sizeof(UCommand_ShortCut_List_00_C) == 0x0003D8, "Wrong size on UCommand_ShortCut_List_00_C");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Switching_R) == 0x000360, "Member 'UCommand_ShortCut_List_00_C::Switching_R' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Switching_L) == 0x000368, "Member 'UCommand_ShortCut_List_00_C::Switching_L' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Out) == 0x000370, "Member 'UCommand_ShortCut_List_00_C::Out' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, In) == 0x000378, "Member 'UCommand_ShortCut_List_00_C::In' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Icon_ATBCost) == 0x000380, "Member 'UCommand_ShortCut_List_00_C::Icon_ATBCost' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Icon_ATBCost_L) == 0x000388, "Member 'UCommand_ShortCut_List_00_C::Icon_ATBCost_L' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Icon_ATBCost_R) == 0x000390, "Member 'UCommand_ShortCut_List_00_C::Icon_ATBCost_R' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_00) == 0x000398, "Member 'UCommand_ShortCut_List_00_C::Img_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_01) == 0x0003A0, "Member 'UCommand_ShortCut_List_00_C::Img_01' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_02) == 0x0003A8, "Member 'UCommand_ShortCut_List_00_C::Img_02' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Arrow_Main) == 0x0003B0, "Member 'UCommand_ShortCut_List_00_C::Img_Arrow_Main' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Arrow_Shadow) == 0x0003B8, "Member 'UCommand_ShortCut_List_00_C::Img_Arrow_Shadow' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Base) == 0x0003C0, "Member 'UCommand_ShortCut_List_00_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Effect_00) == 0x0003C8, "Member 'UCommand_ShortCut_List_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCommand_ShortCut_List_00_C, Img_Player) == 0x0003D0, "Member 'UCommand_ShortCut_List_00_C::Img_Player' has a wrong offset!");

}

