#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_Default_Cell_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_Default_Cell_00.Command_Default_Cell_00_C
// 0x0128 (0x04C0 - 0x0398)
class UCommand_Default_Cell_00_C final : public UEndCmdShortcutCell
{
public:
	class UWidgetAnimation*                       E_BtnDisabled;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       E_Execution;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       E_Executable;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       E_Default;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       D_Executable;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       D_Off;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       D_Default;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       C_Default;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       B_Default;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       A_Default;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Disabled;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       D_Execution;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       D_Charging_Loop;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       D_Charge;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       C_Pressed;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       B_Off;                                             // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       B_Running_Loop;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       B_Pressed;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       B_From3To1;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       B_From2To3;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       B_From1To2;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       A_Running_Loop;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       A_Switch_OnOff;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn;                                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommand_BtnPressedEffect_C*            BtnPressedEffect;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_00;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_01;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Gauge_02;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_B_01;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_B_02;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Gauge02;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnArrow;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnBase_Off;                                   // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnBase_On;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_00;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeBG;                                       // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_Default_Cell_00_C">();
	}
	static class UCommand_Default_Cell_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_Default_Cell_00_C>();
	}
};
static_assert(alignof(UCommand_Default_Cell_00_C) == 0x000008, "Wrong alignment on UCommand_Default_Cell_00_C");
static_assert(sizeof(UCommand_Default_Cell_00_C) == 0x0004C0, "Wrong size on UCommand_Default_Cell_00_C");
static_assert(offsetof(UCommand_Default_Cell_00_C, E_BtnDisabled) == 0x000398, "Member 'UCommand_Default_Cell_00_C::E_BtnDisabled' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, E_Execution) == 0x0003A0, "Member 'UCommand_Default_Cell_00_C::E_Execution' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, E_Executable) == 0x0003A8, "Member 'UCommand_Default_Cell_00_C::E_Executable' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, E_Default) == 0x0003B0, "Member 'UCommand_Default_Cell_00_C::E_Default' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, D_Executable) == 0x0003B8, "Member 'UCommand_Default_Cell_00_C::D_Executable' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, D_Off) == 0x0003C0, "Member 'UCommand_Default_Cell_00_C::D_Off' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, D_Default) == 0x0003C8, "Member 'UCommand_Default_Cell_00_C::D_Default' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, C_Default) == 0x0003D0, "Member 'UCommand_Default_Cell_00_C::C_Default' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, B_Default) == 0x0003D8, "Member 'UCommand_Default_Cell_00_C::B_Default' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, A_Default) == 0x0003E0, "Member 'UCommand_Default_Cell_00_C::A_Default' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Disabled) == 0x0003E8, "Member 'UCommand_Default_Cell_00_C::Disabled' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, D_Execution) == 0x0003F0, "Member 'UCommand_Default_Cell_00_C::D_Execution' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, D_Charging_Loop) == 0x0003F8, "Member 'UCommand_Default_Cell_00_C::D_Charging_Loop' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, D_Charge) == 0x000400, "Member 'UCommand_Default_Cell_00_C::D_Charge' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, C_Pressed) == 0x000408, "Member 'UCommand_Default_Cell_00_C::C_Pressed' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, B_Off) == 0x000410, "Member 'UCommand_Default_Cell_00_C::B_Off' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, B_Running_Loop) == 0x000418, "Member 'UCommand_Default_Cell_00_C::B_Running_Loop' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, B_Pressed) == 0x000420, "Member 'UCommand_Default_Cell_00_C::B_Pressed' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, B_From3To1) == 0x000428, "Member 'UCommand_Default_Cell_00_C::B_From3To1' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, B_From2To3) == 0x000430, "Member 'UCommand_Default_Cell_00_C::B_From2To3' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, B_From1To2) == 0x000438, "Member 'UCommand_Default_Cell_00_C::B_From1To2' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, A_Running_Loop) == 0x000440, "Member 'UCommand_Default_Cell_00_C::A_Running_Loop' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, A_Switch_OnOff) == 0x000448, "Member 'UCommand_Default_Cell_00_C::A_Switch_OnOff' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Btn) == 0x000450, "Member 'UCommand_Default_Cell_00_C::Btn' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, BtnPressedEffect) == 0x000458, "Member 'UCommand_Default_Cell_00_C::BtnPressedEffect' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Gauge_00) == 0x000460, "Member 'UCommand_Default_Cell_00_C::Gauge_00' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Gauge_01) == 0x000468, "Member 'UCommand_Default_Cell_00_C::Gauge_01' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Gauge_02) == 0x000470, "Member 'UCommand_Default_Cell_00_C::Gauge_02' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_B_01) == 0x000478, "Member 'UCommand_Default_Cell_00_C::Img_B_01' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_B_02) == 0x000480, "Member 'UCommand_Default_Cell_00_C::Img_B_02' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_Base_Gauge02) == 0x000488, "Member 'UCommand_Default_Cell_00_C::Img_Base_Gauge02' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_BtnArrow) == 0x000490, "Member 'UCommand_Default_Cell_00_C::Img_BtnArrow' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_BtnBase_Off) == 0x000498, "Member 'UCommand_Default_Cell_00_C::Img_BtnBase_Off' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_BtnBase_On) == 0x0004A0, "Member 'UCommand_Default_Cell_00_C::Img_BtnBase_On' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_Effect_00) == 0x0004A8, "Member 'UCommand_Default_Cell_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_Effect_01) == 0x0004B0, "Member 'UCommand_Default_Cell_00_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UCommand_Default_Cell_00_C, Img_GaugeBG) == 0x0004B8, "Member 'UCommand_Default_Cell_00_C::Img_GaugeBG' has a wrong offset!");

}

