#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Command_BtnPressedEffect

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Command_BtnPressedEffect.Command_BtnPressedEffect_C
// 0x0018 (0x0378 - 0x0360)
class UCommand_BtnPressedEffect_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Pressed;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Command_BtnPressedEffect_C">();
	}
	static class UCommand_BtnPressedEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCommand_BtnPressedEffect_C>();
	}
};
static_assert(alignof(UCommand_BtnPressedEffect_C) == 0x000008, "Wrong alignment on UCommand_BtnPressedEffect_C");
static_assert(sizeof(UCommand_BtnPressedEffect_C) == 0x000378, "Wrong size on UCommand_BtnPressedEffect_C");
static_assert(offsetof(UCommand_BtnPressedEffect_C, Pressed) == 0x000360, "Member 'UCommand_BtnPressedEffect_C::Pressed' has a wrong offset!");
static_assert(offsetof(UCommand_BtnPressedEffect_C, Img_Effect_01) == 0x000368, "Member 'UCommand_BtnPressedEffect_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UCommand_BtnPressedEffect_C, Img_Effect_02) == 0x000370, "Member 'UCommand_BtnPressedEffect_C::Img_Effect_02' has a wrong offset!");

}

