#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Compass_Effect_00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Compass_Effect_00.Compass_Effect_00_C
// 0x0028 (0x0388 - 0x0360)
class UCompass_Effect_00_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Compass_Effect_00(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Compass_Effect_00_C">();
	}
	static class UCompass_Effect_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCompass_Effect_00_C>();
	}
};
static_assert(alignof(UCompass_Effect_00_C) == 0x000008, "Wrong alignment on UCompass_Effect_00_C");
static_assert(sizeof(UCompass_Effect_00_C) == 0x000388, "Wrong size on UCompass_Effect_00_C");
static_assert(offsetof(UCompass_Effect_00_C, UberGraphFrame) == 0x000360, "Member 'UCompass_Effect_00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCompass_Effect_00_C, Loop) == 0x000368, "Member 'UCompass_Effect_00_C::Loop' has a wrong offset!");
static_assert(offsetof(UCompass_Effect_00_C, Img_Effect_00) == 0x000370, "Member 'UCompass_Effect_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UCompass_Effect_00_C, Img_Effect_01) == 0x000378, "Member 'UCompass_Effect_00_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UCompass_Effect_00_C, Img_Effect_02) == 0x000380, "Member 'UCompass_Effect_00_C::Img_Effect_02' has a wrong offset!");

}

