#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CondorFort_Timer

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CondorFort_Timer.CondorFort_Timer_C
// 0x0158 (0x04B8 - 0x0360)
class UCondorFort_Timer_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Beat_Out;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Beat_Loop;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       FailedOut;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CompletedOut;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCondorFort_Timer_Colon_C*              Colon_M_S;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Colon_M_S_Eff;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCondorFort_Timer_Colon_C*              Colon_S_ms;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Colon_S_ms_Eff;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Base;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Colon_M_S;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Colon_S_ms;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_010ms;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_01M;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_01S;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_100ms;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_10M;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Glow_Num_10S;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Hzbx_Number;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Hzbx_Number_Eff;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Blue;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Red;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Eff_Blue;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Eff_Red;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCondorFort_Timer_Num_C*                Num_010ms;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_010ms_Eff;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCondorFort_Timer_Num_C*                Num_01M;                                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_01M_Eff;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCondorFort_Timer_Num_C*                Num_01S;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_01S_Eff;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCondorFort_Timer_Num_C*                Num_100ms;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_100ms_Eff;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCondorFort_Timer_Num_C*                Num_10M;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_10M_Eff;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCondorFort_Timer_Num_C*                Num_10S;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Num_10S_Eff;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Blue;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Number;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Number_Eff;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Scbx_Number;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Scbx_Number_Eff;                                   // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CondorFort_Timer_C">();
	}
	static class UCondorFort_Timer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondorFort_Timer_C>();
	}
};
static_assert(alignof(UCondorFort_Timer_C) == 0x000008, "Wrong alignment on UCondorFort_Timer_C");
static_assert(sizeof(UCondorFort_Timer_C) == 0x0004B8, "Wrong size on UCondorFort_Timer_C");
static_assert(offsetof(UCondorFort_Timer_C, Beat_Out) == 0x000360, "Member 'UCondorFort_Timer_C::Beat_Out' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Beat_Loop) == 0x000368, "Member 'UCondorFort_Timer_C::Beat_Loop' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, FailedOut) == 0x000370, "Member 'UCondorFort_Timer_C::FailedOut' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, CompletedOut) == 0x000378, "Member 'UCondorFort_Timer_C::CompletedOut' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Loop) == 0x000380, "Member 'UCondorFort_Timer_C::Loop' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, In) == 0x000388, "Member 'UCondorFort_Timer_C::In' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Colon_M_S) == 0x000390, "Member 'UCondorFort_Timer_C::Colon_M_S' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Colon_M_S_Eff) == 0x000398, "Member 'UCondorFort_Timer_C::Colon_M_S_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Colon_S_ms) == 0x0003A0, "Member 'UCondorFort_Timer_C::Colon_S_ms' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Colon_S_ms_Eff) == 0x0003A8, "Member 'UCondorFort_Timer_C::Colon_S_ms_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Base) == 0x0003B0, "Member 'UCondorFort_Timer_C::Glow_Base' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Colon_M_S) == 0x0003B8, "Member 'UCondorFort_Timer_C::Glow_Colon_M_S' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Colon_S_ms) == 0x0003C0, "Member 'UCondorFort_Timer_C::Glow_Colon_S_ms' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Num_010ms) == 0x0003C8, "Member 'UCondorFort_Timer_C::Glow_Num_010ms' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Num_01M) == 0x0003D0, "Member 'UCondorFort_Timer_C::Glow_Num_01M' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Num_01S) == 0x0003D8, "Member 'UCondorFort_Timer_C::Glow_Num_01S' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Num_100ms) == 0x0003E0, "Member 'UCondorFort_Timer_C::Glow_Num_100ms' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Num_10M) == 0x0003E8, "Member 'UCondorFort_Timer_C::Glow_Num_10M' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Glow_Num_10S) == 0x0003F0, "Member 'UCondorFort_Timer_C::Glow_Num_10S' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Hzbx_Number) == 0x0003F8, "Member 'UCondorFort_Timer_C::Hzbx_Number' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Hzbx_Number_Eff) == 0x000400, "Member 'UCondorFort_Timer_C::Hzbx_Number_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Img_Base_00) == 0x000408, "Member 'UCondorFort_Timer_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Img_Base_Blue) == 0x000410, "Member 'UCondorFort_Timer_C::Img_Base_Blue' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Img_Base_Red) == 0x000418, "Member 'UCondorFort_Timer_C::Img_Base_Red' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Img_Eff_Blue) == 0x000420, "Member 'UCondorFort_Timer_C::Img_Eff_Blue' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Img_Eff_Red) == 0x000428, "Member 'UCondorFort_Timer_C::Img_Eff_Red' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_010ms) == 0x000430, "Member 'UCondorFort_Timer_C::Num_010ms' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_010ms_Eff) == 0x000438, "Member 'UCondorFort_Timer_C::Num_010ms_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_01M) == 0x000440, "Member 'UCondorFort_Timer_C::Num_01M' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_01M_Eff) == 0x000448, "Member 'UCondorFort_Timer_C::Num_01M_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_01S) == 0x000450, "Member 'UCondorFort_Timer_C::Num_01S' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_01S_Eff) == 0x000458, "Member 'UCondorFort_Timer_C::Num_01S_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_100ms) == 0x000460, "Member 'UCondorFort_Timer_C::Num_100ms' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_100ms_Eff) == 0x000468, "Member 'UCondorFort_Timer_C::Num_100ms_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_10M) == 0x000470, "Member 'UCondorFort_Timer_C::Num_10M' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_10M_Eff) == 0x000478, "Member 'UCondorFort_Timer_C::Num_10M_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_10S) == 0x000480, "Member 'UCondorFort_Timer_C::Num_10S' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Num_10S_Eff) == 0x000488, "Member 'UCondorFort_Timer_C::Num_10S_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Nut_Blue) == 0x000490, "Member 'UCondorFort_Timer_C::Nut_Blue' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Nut_Number) == 0x000498, "Member 'UCondorFort_Timer_C::Nut_Number' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Nut_Number_Eff) == 0x0004A0, "Member 'UCondorFort_Timer_C::Nut_Number_Eff' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Scbx_Number) == 0x0004A8, "Member 'UCondorFort_Timer_C::Scbx_Number' has a wrong offset!");
static_assert(offsetof(UCondorFort_Timer_C, Scbx_Number_Eff) == 0x0004B0, "Member 'UCondorFort_Timer_C::Scbx_Number_Eff' has a wrong offset!");

}

