#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CondorFort_RoleIconSet

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CondorFort_RoleIconSet.CondorFort_RoleIconSet_C
// 0x0018 (0x0378 - 0x0360)
class UCondorFort_RoleIconSet_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Weakness;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Ripples;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_RoleIcon;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CondorFort_RoleIconSet_C">();
	}
	static class UCondorFort_RoleIconSet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCondorFort_RoleIconSet_C>();
	}
};
static_assert(alignof(UCondorFort_RoleIconSet_C) == 0x000008, "Wrong alignment on UCondorFort_RoleIconSet_C");
static_assert(sizeof(UCondorFort_RoleIconSet_C) == 0x000378, "Wrong size on UCondorFort_RoleIconSet_C");
static_assert(offsetof(UCondorFort_RoleIconSet_C, Weakness) == 0x000360, "Member 'UCondorFort_RoleIconSet_C::Weakness' has a wrong offset!");
static_assert(offsetof(UCondorFort_RoleIconSet_C, Img_Ripples) == 0x000368, "Member 'UCondorFort_RoleIconSet_C::Img_Ripples' has a wrong offset!");
static_assert(offsetof(UCondorFort_RoleIconSet_C, Img_RoleIcon) == 0x000370, "Member 'UCondorFort_RoleIconSet_C::Img_RoleIcon' has a wrong offset!");

}

