#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Cooperation_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Cooperation_00.Cooperation_00_C
// 0x0030 (0x0390 - 0x0360)
class UCooperation_00_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       On_Loop;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OffOn_Shift;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Off;                                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Effect_On;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Off;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Cooperation_00_C">();
	}
	static class UCooperation_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCooperation_00_C>();
	}
};
static_assert(alignof(UCooperation_00_C) == 0x000008, "Wrong alignment on UCooperation_00_C");
static_assert(sizeof(UCooperation_00_C) == 0x000390, "Wrong size on UCooperation_00_C");
static_assert(offsetof(UCooperation_00_C, On_Loop) == 0x000360, "Member 'UCooperation_00_C::On_Loop' has a wrong offset!");
static_assert(offsetof(UCooperation_00_C, OffOn_Shift) == 0x000368, "Member 'UCooperation_00_C::OffOn_Shift' has a wrong offset!");
static_assert(offsetof(UCooperation_00_C, Off) == 0x000370, "Member 'UCooperation_00_C::Off' has a wrong offset!");
static_assert(offsetof(UCooperation_00_C, Effect_On) == 0x000378, "Member 'UCooperation_00_C::Effect_On' has a wrong offset!");
static_assert(offsetof(UCooperation_00_C, Img_Off) == 0x000380, "Member 'UCooperation_00_C::Img_Off' has a wrong offset!");
static_assert(offsetof(UCooperation_00_C, Img_On) == 0x000388, "Member 'UCooperation_00_C::Img_On' has a wrong offset!");

}

