#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DLC_Window

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DLC_Window.DLC_Window_C
// 0x0088 (0x0438 - 0x03B0)
class UDLC_Window_C final : public UEndTitleDlcWindow
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BG;                                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_00;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Banner_00;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Banner_01;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BaseMovie;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_B;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_L;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_R;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_T;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Movie_00;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn_00;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn_01;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn_02;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DLC_Window_C">();
	}
	static class UDLC_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDLC_Window_C>();
	}
};
static_assert(alignof(UDLC_Window_C) == 0x000008, "Wrong alignment on UDLC_Window_C");
static_assert(sizeof(UDLC_Window_C) == 0x000438, "Wrong size on UDLC_Window_C");
static_assert(offsetof(UDLC_Window_C, Out) == 0x0003B0, "Member 'UDLC_Window_C::Out' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, In) == 0x0003B8, "Member 'UDLC_Window_C::In' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, BG) == 0x0003C0, "Member 'UDLC_Window_C::BG' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Billboard_00) == 0x0003C8, "Member 'UDLC_Window_C::Billboard_00' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Frame) == 0x0003D0, "Member 'UDLC_Window_C::Frame' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Img_Banner_00) == 0x0003D8, "Member 'UDLC_Window_C::Img_Banner_00' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Img_Banner_01) == 0x0003E0, "Member 'UDLC_Window_C::Img_Banner_01' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Img_Base) == 0x0003E8, "Member 'UDLC_Window_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Img_BaseMovie) == 0x0003F0, "Member 'UDLC_Window_C::Img_BaseMovie' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Line_B) == 0x0003F8, "Member 'UDLC_Window_C::Line_B' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Line_L) == 0x000400, "Member 'UDLC_Window_C::Line_L' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Line_R) == 0x000408, "Member 'UDLC_Window_C::Line_R' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Line_T) == 0x000410, "Member 'UDLC_Window_C::Line_T' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Movie_00) == 0x000418, "Member 'UDLC_Window_C::Movie_00' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Txt_Btn_00) == 0x000420, "Member 'UDLC_Window_C::Txt_Btn_00' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Txt_Btn_01) == 0x000428, "Member 'UDLC_Window_C::Txt_Btn_01' has a wrong offset!");
static_assert(offsetof(UDLC_Window_C, Txt_Btn_02) == 0x000430, "Member 'UDLC_Window_C::Txt_Btn_02' has a wrong offset!");

}

