#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB0005_00_Rude_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EB0005_00_Rude_Standard_Animation.EB0005_00_Rude_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UEB0005_00_Rude_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_CC17BE4B422CBFE9288B7C9767EA6D0E; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_05BB2C634907C63732E9B29F7D75EBD0; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_FF80E12A4C1DD0B098ECB382A618B1B1; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_A32CB5A6462B1328C844B2B47612444A; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_D869C46A47509C6A8E5C44A91B34D045; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_23B939D14C36E62BDE192D9170CD7AE1; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E19B59FA42CFB8BD7B6E5EB7D7805D55; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_759DFCF147A29C8B38366A8D76A8823F; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_8B096D11481F8EFCF4908A8E34CDD9FD; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_38905C9F4AF66F289E9BEDA6F503E6F3; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_665C65964B9823F9642738ABFB116792; // 0x2740(0x0070)()

public:
	void ExecuteUbergraph_EB0005_00_Rude_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EB0005_00_Rude_Standard_Animation_C">();
	}
	static class UEB0005_00_Rude_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEB0005_00_Rude_Standard_Animation_C>();
	}
};
static_assert(alignof(UEB0005_00_Rude_Standard_Animation_C) == 0x000010, "Wrong alignment on UEB0005_00_Rude_Standard_Animation_C");
static_assert(sizeof(UEB0005_00_Rude_Standard_Animation_C) == 0x0027B0, "Wrong size on UEB0005_00_Rude_Standard_Animation_C");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UEB0005_00_Rude_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_Root_CC17BE4B422CBFE9288B7C9767EA6D0E) == 0x001788, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_Root_CC17BE4B422CBFE9288B7C9767EA6D0E' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_Slot_05BB2C634907C63732E9B29F7D75EBD0) == 0x0017D0, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_Slot_05BB2C634907C63732E9B29F7D75EBD0' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_FF80E12A4C1DD0B098ECB382A618B1B1) == 0x001838, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_FF80E12A4C1DD0B098ECB382A618B1B1' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_A32CB5A6462B1328C844B2B47612444A) == 0x001880, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_A32CB5A6462B1328C844B2B47612444A' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_D869C46A47509C6A8E5C44A91B34D045) == 0x0018C8, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_D869C46A47509C6A8E5C44A91B34D045' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_EndBehavior_23B939D14C36E62BDE192D9170CD7AE1) == 0x001968, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_EndBehavior_23B939D14C36E62BDE192D9170CD7AE1' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_Slot_E19B59FA42CFB8BD7B6E5EB7D7805D55) == 0x001998, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_Slot_E19B59FA42CFB8BD7B6E5EB7D7805D55' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_759DFCF147A29C8B38366A8D76A8823F) == 0x001A00, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_759DFCF147A29C8B38366A8D76A8823F' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_8B096D11481F8EFCF4908A8E34CDD9FD) == 0x001A50, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_8B096D11481F8EFCF4908A8E34CDD9FD' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_EndFace_38905C9F4AF66F289E9BEDA6F503E6F3) == 0x002390, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_EndFace_38905C9F4AF66F289E9BEDA6F503E6F3' has a wrong offset!");
static_assert(offsetof(UEB0005_00_Rude_Standard_Animation_C, AnimGraphNode_EndFaceBlend_665C65964B9823F9642738ABFB116792) == 0x002740, "Member 'UEB0005_00_Rude_Standard_Animation_C::AnimGraphNode_EndFaceBlend_665C65964B9823F9642738ABFB116792' has a wrong offset!");

}

