#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB0016_00_Rufus_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EB0016_00_Rufus_Standard_Animation.EB0016_00_Rufus_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UEB0016_00_Rufus_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F291B07C444161DCEAA18B9086BF8FE4; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_398DB3C2412AFB4FFE529D85EF2F07C8; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9CA144304762B5591051419AAC6AB038; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D7B594AE42FF4F5145B82992497D9A54; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_FD42354E4C44281D1EF4B4A91AF30A8C; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_9B52B8FD45A216C088AA5FB04D78806D; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E16E3C5B48332B502084CCA0A020193D; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_04C8932C46BE6C9C7808D5A96568A4ED; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_9A696901485B3700B36924B7984E6932; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_AAC5DF474C2F74A15CD83FA3D1910464; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_2EA836594B24898767BA0B9BCB9972B2; // 0x2740(0x0070)()

public:
	void ExecuteUbergraph_EB0016_00_Rufus_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EB0016_00_Rufus_Standard_Animation_C">();
	}
	static class UEB0016_00_Rufus_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEB0016_00_Rufus_Standard_Animation_C>();
	}
};
static_assert(alignof(UEB0016_00_Rufus_Standard_Animation_C) == 0x000010, "Wrong alignment on UEB0016_00_Rufus_Standard_Animation_C");
static_assert(sizeof(UEB0016_00_Rufus_Standard_Animation_C) == 0x0027B0, "Wrong size on UEB0016_00_Rufus_Standard_Animation_C");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UEB0016_00_Rufus_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_Root_F291B07C444161DCEAA18B9086BF8FE4) == 0x001788, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_Root_F291B07C444161DCEAA18B9086BF8FE4' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_Slot_398DB3C2412AFB4FFE529D85EF2F07C8) == 0x0017D0, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_Slot_398DB3C2412AFB4FFE529D85EF2F07C8' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_9CA144304762B5591051419AAC6AB038) == 0x001838, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_9CA144304762B5591051419AAC6AB038' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_D7B594AE42FF4F5145B82992497D9A54) == 0x001880, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_D7B594AE42FF4F5145B82992497D9A54' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_FD42354E4C44281D1EF4B4A91AF30A8C) == 0x0018C8, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_FD42354E4C44281D1EF4B4A91AF30A8C' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_EndBehavior_9B52B8FD45A216C088AA5FB04D78806D) == 0x001968, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_EndBehavior_9B52B8FD45A216C088AA5FB04D78806D' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_Slot_E16E3C5B48332B502084CCA0A020193D) == 0x001998, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_Slot_E16E3C5B48332B502084CCA0A020193D' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_04C8932C46BE6C9C7808D5A96568A4ED) == 0x001A00, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_04C8932C46BE6C9C7808D5A96568A4ED' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_9A696901485B3700B36924B7984E6932) == 0x001A50, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_9A696901485B3700B36924B7984E6932' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_EndFace_AAC5DF474C2F74A15CD83FA3D1910464) == 0x002390, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_EndFace_AAC5DF474C2F74A15CD83FA3D1910464' has a wrong offset!");
static_assert(offsetof(UEB0016_00_Rufus_Standard_Animation_C, AnimGraphNode_EndFaceBlend_2EA836594B24898767BA0B9BCB9972B2) == 0x002740, "Member 'UEB0016_00_Rufus_Standard_Animation_C::AnimGraphNode_EndFaceBlend_2EA836594B24898767BA0B9BCB9972B2' has a wrong offset!");

}

