#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB0005_01_Rude_Pillar_AI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnMetaMessageAboutCharacter
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter final
{
public:
	class AEndCharacter*                          InChara;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InMessage;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter, InChara) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter::InChara' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter, InMessage) == 0x000008, "Member 'EB0005_01_Rude_Pillar_AI_C_OnMetaMessageAboutCharacter::InMessage' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnChangePhase
// 0x0008 (0x0008 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnChangePhase final
{
public:
	int32                                         InNew;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InOld;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnChangePhase) == 0x000004, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnChangePhase");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnChangePhase) == 0x000008, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnChangePhase");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnChangePhase, InNew) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnChangePhase::InNew' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnChangePhase, InOld) == 0x000004, "Member 'EB0005_01_Rude_Pillar_AI_C_OnChangePhase::InOld' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnSyncActionChange
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange final
{
public:
	class FName                                   syncActionID;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChangeID;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DetachDamageSourceID;                              // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange) == 0x000004, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange, syncActionID) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange::syncActionID' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange, ChangeID) == 0x000008, "Member 'EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange::ChangeID' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange, DetachDamageSourceID) == 0x000010, "Member 'EB0005_01_Rude_Pillar_AI_C_OnSyncActionChange::DetachDamageSourceID' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnBurstEnd
// 0x0001 (0x0001 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnBurstEnd final
{
public:
	bool                                          instant;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnBurstEnd) == 0x000001, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnBurstEnd");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnBurstEnd) == 0x000001, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnBurstEnd");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnBurstEnd, instant) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnBurstEnd::instant' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnSuspendAbility
// 0x000C (0x000C - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAiAbilitySuspendFactor                    InFactor;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAiAbilitySuspendTiming                    InTiming;                                          // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility) == 0x000004, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility) == 0x00000C, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility, InName) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility::InName' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility, InFactor) == 0x000008, "Member 'EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility::InFactor' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility, InTiming) == 0x000009, "Member 'EB0005_01_Rude_Pillar_AI_C_OnSuspendAbility::InTiming' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnFinishTimer
// 0x0008 (0x0008 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnFinishTimer final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnFinishTimer) == 0x000004, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnFinishTimer");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnFinishTimer) == 0x000008, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnFinishTimer");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnFinishTimer, InName) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnFinishTimer::InName' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnMotionMessage
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnMotionMessage final
{
public:
	class FName                                   InMotionName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InIntValue;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InFloatValue;                                      // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnMotionMessage) == 0x000004, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnMotionMessage");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnMotionMessage) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnMotionMessage");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnMotionMessage, InMotionName) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnMotionMessage::InMotionName' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnMotionMessage, InName) == 0x000008, "Member 'EB0005_01_Rude_Pillar_AI_C_OnMotionMessage::InName' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnMotionMessage, InIntValue) == 0x000010, "Member 'EB0005_01_Rude_Pillar_AI_C_OnMotionMessage::InIntValue' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnMotionMessage, InFloatValue) == 0x000014, "Member 'EB0005_01_Rude_Pillar_AI_C_OnMotionMessage::InFloatValue' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnGiveDamage
// 0x0038 (0x0038 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnGiveDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          InTarget;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBind;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InGuard;                                           // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InJustGuard;                                       // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          KeepOver;                                          // 0x001B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InDodge;                                           // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InCounter;                                         // 0x001D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InBoneName;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAttributeWeak;                                   // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InDamageSourceID;                                  // 0x002C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InSteal;                                           // 0x0034(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          heal;                                              // 0x0035(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnGiveDamage");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage) == 0x000038, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnGiveDamage");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, Damage) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::Damage' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InTarget) == 0x000008, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InTarget' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InName) == 0x000010, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InName' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InBind) == 0x000018, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InBind' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InGuard) == 0x000019, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InGuard' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InJustGuard) == 0x00001A, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InJustGuard' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, KeepOver) == 0x00001B, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::KeepOver' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InDodge) == 0x00001C, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InDodge' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InCounter) == 0x00001D, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InCounter' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InBoneName) == 0x000020, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InBoneName' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InAttributeWeak) == 0x000028, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InAttributeWeak' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InDamageSourceID) == 0x00002C, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InDamageSourceID' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, InSteal) == 0x000034, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::InSteal' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnGiveDamage, heal) == 0x000035, "Member 'EB0005_01_Rude_Pillar_AI_C_OnGiveDamage::heal' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnUpdate
// 0x000C (0x000C - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnUpdate final
{
public:
	EEndAiBattleRole                              InRole;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InStep;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnUpdate) == 0x000004, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnUpdate");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnUpdate) == 0x00000C, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnUpdate");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnUpdate, InRole) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnUpdate::InRole' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnUpdate, InStep) == 0x000004, "Member 'EB0005_01_Rude_Pillar_AI_C_OnUpdate::InStep' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnUpdate, DeltaTime) == 0x000008, "Member 'EB0005_01_Rude_Pillar_AI_C_OnUpdate::DeltaTime' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.OnTakeDamage
// 0x0390 (0x0390 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_OnTakeDamage final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          InChara;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InName;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAbilityCommandType                  InCommandType;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBind;                                            // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InGuard;                                           // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InDodge;                                           // 0x001B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   InBoneName;                                        // 0x001C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InAttributeWeak;                                   // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InDmgSrcID;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       InDmgSrcAttribute;                                 // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         justHitRotYaw;                                     // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                hitPosition;                                       // 0x0038(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InHeal;                                            // 0x0044(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InCounter;                                         // 0x0045(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataTableBattleDamageSource        dataTableBattleDamageSource;                       // 0x0048(0x0340)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          useAbilityUCPC;                                    // 0x0388(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_OnTakeDamage");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage) == 0x000390, "Wrong size on EB0005_01_Rude_Pillar_AI_C_OnTakeDamage");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, Damage) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::Damage' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InChara) == 0x000008, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InChara' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InName) == 0x000010, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InName' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InCommandType) == 0x000018, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InCommandType' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InBind) == 0x000019, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InBind' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InGuard) == 0x00001A, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InGuard' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InDodge) == 0x00001B, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InDodge' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InBoneName) == 0x00001C, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InBoneName' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InAttributeWeak) == 0x000024, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InAttributeWeak' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InDmgSrcID) == 0x000028, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InDmgSrcID' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InDmgSrcAttribute) == 0x000030, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InDmgSrcAttribute' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, justHitRotYaw) == 0x000034, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::justHitRotYaw' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, hitPosition) == 0x000038, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::hitPosition' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InHeal) == 0x000044, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InHeal' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, InCounter) == 0x000045, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::InCounter' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, dataTableBattleDamageSource) == 0x000048, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::dataTableBattleDamageSource' has a wrong offset!");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_OnTakeDamage, useAbilityUCPC) == 0x000388, "Member 'EB0005_01_Rude_Pillar_AI_C_OnTakeDamage::useAbilityUCPC' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_Seven_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_Seven_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Seven_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Seven_K2Node_InputKeyEvent_0");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Seven_K2Node_InputKeyEvent_0) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Seven_K2Node_InputKeyEvent_0");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Seven_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_Seven_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_Six_K2Node_InputKeyEvent_1
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_Six_K2Node_InputKeyEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Six_K2Node_InputKeyEvent_1) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Six_K2Node_InputKeyEvent_1");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Six_K2Node_InputKeyEvent_1) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Six_K2Node_InputKeyEvent_1");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Six_K2Node_InputKeyEvent_1, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_Six_K2Node_InputKeyEvent_1::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_Five_K2Node_InputKeyEvent_2
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_Five_K2Node_InputKeyEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Five_K2Node_InputKeyEvent_2) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Five_K2Node_InputKeyEvent_2");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Five_K2Node_InputKeyEvent_2) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Five_K2Node_InputKeyEvent_2");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Five_K2Node_InputKeyEvent_2, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_Five_K2Node_InputKeyEvent_2::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_Four_K2Node_InputKeyEvent_3
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_Four_K2Node_InputKeyEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Four_K2Node_InputKeyEvent_3) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Four_K2Node_InputKeyEvent_3");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Four_K2Node_InputKeyEvent_3) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Four_K2Node_InputKeyEvent_3");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Four_K2Node_InputKeyEvent_3, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_Four_K2Node_InputKeyEvent_3::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_Three_K2Node_InputKeyEvent_4
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_Three_K2Node_InputKeyEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Three_K2Node_InputKeyEvent_4) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Three_K2Node_InputKeyEvent_4");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Three_K2Node_InputKeyEvent_4) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Three_K2Node_InputKeyEvent_4");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Three_K2Node_InputKeyEvent_4, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_Three_K2Node_InputKeyEvent_4::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_Zero_K2Node_InputKeyEvent_5
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_Zero_K2Node_InputKeyEvent_5 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Zero_K2Node_InputKeyEvent_5) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Zero_K2Node_InputKeyEvent_5");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Zero_K2Node_InputKeyEvent_5) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Zero_K2Node_InputKeyEvent_5");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Zero_K2Node_InputKeyEvent_5, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_Zero_K2Node_InputKeyEvent_5::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_Nine_K2Node_InputKeyEvent_6
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_Nine_K2Node_InputKeyEvent_6 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Nine_K2Node_InputKeyEvent_6) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Nine_K2Node_InputKeyEvent_6");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Nine_K2Node_InputKeyEvent_6) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Nine_K2Node_InputKeyEvent_6");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Nine_K2Node_InputKeyEvent_6, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_Nine_K2Node_InputKeyEvent_6::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_Two_K2Node_InputKeyEvent_7
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_Two_K2Node_InputKeyEvent_7 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Two_K2Node_InputKeyEvent_7) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Two_K2Node_InputKeyEvent_7");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Two_K2Node_InputKeyEvent_7) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_Two_K2Node_InputKeyEvent_7");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_Two_K2Node_InputKeyEvent_7, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_Two_K2Node_InputKeyEvent_7::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.InpActEvt_One_K2Node_InputKeyEvent_8
// 0x0018 (0x0018 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_InpActEvt_One_K2Node_InputKeyEvent_8 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_One_K2Node_InputKeyEvent_8) == 0x000008, "Wrong alignment on EB0005_01_Rude_Pillar_AI_C_InpActEvt_One_K2Node_InputKeyEvent_8");
static_assert(sizeof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_One_K2Node_InputKeyEvent_8) == 0x000018, "Wrong size on EB0005_01_Rude_Pillar_AI_C_InpActEvt_One_K2Node_InputKeyEvent_8");
static_assert(offsetof(EB0005_01_Rude_Pillar_AI_C_InpActEvt_One_K2Node_InputKeyEvent_8, Key) == 0x000000, "Member 'EB0005_01_Rude_Pillar_AI_C_InpActEvt_One_K2Node_InputKeyEvent_8::Key' has a wrong offset!");

// Function EB0005_01_Rude_Pillar_AI.EB0005_01_Rude_Pillar_AI_C.ExecuteUbergraph_EB0005_01_Rude_Pillar_AI
// 0x0D70 (0x0D70 - 0x0000)
struct EB0005_01_Rude_Pillar_AI_C_ExecuteUbergraph_EB0005_01_Rude_Pillar_AI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate2;             // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_Damage2;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          K2Node_Event_InChara2;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InName7;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAbilityCommandType                  K2Node_Event_InCommandType;                        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InBind2;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InGuard2;                             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InDodge2;                             // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_Event_InBoneName2;                          // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InAttributeWeak2;                     // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InDmgSrcID;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       K2Node_Event_InDmgSrcAttribute;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_JustHitRotYaw;                        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitPosition;                          // 0x0080(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InHeal;                               // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InCounter2;                           // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataTableBattleDamageSource        K2Node_Event_dataTableBattleDamageSource;          // 0x0090(0x0340)()
	bool                                          K2Node_Event_useAbilityUCPC;                       // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x03DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DD[0x3];                                      // 0x03DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URangeSwitch3*                          CallFunc_RangeSwitch3_ReturnValue;                 // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URangeSwitch3*                          CallFunc_RangeSwitch3_ReturnValue2;                // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue2;          // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue3;          // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x03FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x03FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x03FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x03FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName5_CmpSuccess;                     // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName6_CmpSuccess;                     // 0x0402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_403[0x5];                                      // 0x0403(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          K2Node_DynamicCast_AsEnd_Character;                // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          K2Node_DynamicCast_AsEnd_Character2;               // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0424(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSummon_ReturnValue;                     // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue;                // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsToad_ReturnValue;                       // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAiBattleRole                              K2Node_Event_InRole;                               // 0x0433(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InStep;                               // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Damage;                               // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          K2Node_Event_InTarget;                             // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InName6;                              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InBind;                               // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InGuard;                              // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InJustGuard;                          // 0x0452(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_KeepOver;                             // 0x0453(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InDodge;                              // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InCounter;                            // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_456[0x2];                                      // 0x0456(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InBoneName;                           // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InAttributeWeak;                      // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InDamageSourceID;                     // 0x0464(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InSteal;                              // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_heal;                                 // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46E[0x2];                                      // 0x046E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InMotionName;                         // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InName5;                              // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InIntValue;                           // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InFloatValue;                         // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName7_CmpSuccess;                     // 0x0489(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName8_CmpSuccess;                     // 0x048A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName9_CmpSuccess;                     // 0x048B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName10_CmpSuccess;                    // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName11_CmpSuccess;                    // 0x048D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName12_CmpSuccess;                    // 0x048E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName13_CmpSuccess;                    // 0x048F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName14_CmpSuccess;                    // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName15_CmpSuccess;                    // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName16_CmpSuccess;                    // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName17_CmpSuccess;                    // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName18_CmpSuccess;                    // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasStatusChangeFromChara_ReturnValue;     // 0x0495(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerType                                   CallFunc_GetPlayerType_ReturnValue2;               // 0x0496(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0497(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDamage_ReturnValue;                     // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_499[0x3];                                      // 0x0499(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_InName;                         // 0x049C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName19_CmpSuccess;                    // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetStep_ReturnValue;                      // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJumping_ReturnValue;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger2_CmpSuccess;                  // 0x04B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B2[0x6];                                      // 0x04B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x04B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Event_InName4;                              // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAiAbilitySuspendFactor                    K2Node_Event_InFactor;                             // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAiAbilitySuspendTiming                    K2Node_Event_InTiming;                             // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger3_CmpSuccess;                  // 0x04D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x04D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_GetEnumeratorName_ReturnValue;            // 0x04D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName20_CmpSuccess;                    // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName21_CmpSuccess;                    // 0x04DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DE[0x2];                                      // 0x04DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x04E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_instant;                              // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_SyncActionID;                         // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ChangeID;                             // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_DetachDamageSourceID;                 // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestAction_ReturnValue;                // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName22_CmpSuccess;                    // 0x0519(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName23_CmpSuccess;                    // 0x051A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName24_CmpSuccess;                    // 0x051B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName25_CmpSuccess;                    // 0x051C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D[0x3];                                      // 0x051D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InNew;                                // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InOld;                                // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger4_CmpSuccess;                  // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableFieldControler_ReturnValue;       // 0x052D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52E[0x2];                                      // 0x052E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEnemyDistance_ReturnValue;             // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestAction_ReturnValue2;               // 0x0535(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_536[0x2];                                      // 0x0536(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate7;             // 0x0538(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_RegisterMotion_ReturnValue;               // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBattleSceneID_ReturnValue;             // 0x054C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
