#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB0016_10_Helicopter_Missile_AI

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function EB0016_10_Helicopter_Missile_AI.EB0016_10_Helicopter_Missile_AI_C.ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI
// 0x0090 (0x0090 - 0x0000)
struct EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAiBattleRole                              K2Node_Event_InRole2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InStep2;                              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetTargetPlayer_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAiBattleRole                              K2Node_Event_InRole;                               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InStep;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBattleScenePhase_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_InMessage;                            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue2;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranch3                                 CallFunc_RatioBranch3_OutSignal;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotRunning_ReturnValue;                   // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranch6                                 CallFunc_RatioBranch6_OutSignal;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue2;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBattleScenePhase_ReturnValue2;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStep_ReturnValue;                      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRunning_ReturnValue;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndNavModifierVolume*                  CallFunc_GetNavFromName_ReturnValue3;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI) == 0x000008, "Wrong alignment on EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI");
static_assert(sizeof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI) == 0x000090, "Wrong size on EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, EntryPoint) == 0x000000, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_Event_InRole2) == 0x000004, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_Event_InRole2' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_Event_InStep2) == 0x000008, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_Event_InStep2' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_SetTargetPlayer_ReturnValue) == 0x00000C, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_SetTargetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_RandomFloatInRange_ReturnValue) == 0x000010, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_Event_InRole) == 0x000014, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_Event_InRole' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_Event_InStep) == 0x000018, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_Event_InStep' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_Event_DeltaTime) == 0x00001C, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, Temp_bool_Has_Been_Initd_Variable) == 0x000020, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_GetBattleScenePhase_ReturnValue) == 0x000024, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_GetBattleScenePhase_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_SwitchInteger_CmpSuccess) == 0x000028, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, Temp_bool_IsClosed_Variable) == 0x000029, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_Event_InMessage) == 0x000030, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_Event_InMessage' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_SwitchString_CmpSuccess) == 0x000040, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, Temp_bool_Variable) == 0x000041, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_Not_PreBool_ReturnValue) == 0x000042, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_GetCharacter_ReturnValue) == 0x000048, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_GetCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_GetNavFromName_ReturnValue) == 0x000050, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_GetNavFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_RandomFloatInRange_ReturnValue2) == 0x000058, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_RandomFloatInRange_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_GetDistanceTo_ReturnValue) == 0x00005C, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_Less_FloatFloat_ReturnValue) == 0x000060, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_RatioBranch3_OutSignal) == 0x000061, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_RatioBranch3_OutSignal' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_NotRunning_ReturnValue) == 0x000062, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_NotRunning_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_SwitchEnum_CmpSuccess) == 0x000063, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_BooleanAND_ReturnValue) == 0x000064, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_RatioBranch6_OutSignal) == 0x000065, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_RatioBranch6_OutSignal' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_GetNavFromName_ReturnValue2) == 0x000068, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_GetNavFromName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, K2Node_SwitchEnum2_CmpSuccess) == 0x000070, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_GetBattleScenePhase_ReturnValue2) == 0x000074, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_GetBattleScenePhase_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000078, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_BooleanAND_ReturnValue2) == 0x000079, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_GetStep_ReturnValue) == 0x00007C, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_GetStep_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000080, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_IsRunning_ReturnValue) == 0x000081, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_IsRunning_ReturnValue' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI, CallFunc_GetNavFromName_ReturnValue3) == 0x000088, "Member 'EB0016_10_Helicopter_Missile_AI_C_ExecuteUbergraph_EB0016_10_Helicopter_Missile_AI::CallFunc_GetNavFromName_ReturnValue3' has a wrong offset!");

// Function EB0016_10_Helicopter_Missile_AI.EB0016_10_Helicopter_Missile_AI_C.OnMetaMessage
// 0x0010 (0x0010 - 0x0000)
struct EB0016_10_Helicopter_Missile_AI_C_OnMetaMessage final
{
public:
	class FString                                 InMessage;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_10_Helicopter_Missile_AI_C_OnMetaMessage) == 0x000008, "Wrong alignment on EB0016_10_Helicopter_Missile_AI_C_OnMetaMessage");
static_assert(sizeof(EB0016_10_Helicopter_Missile_AI_C_OnMetaMessage) == 0x000010, "Wrong size on EB0016_10_Helicopter_Missile_AI_C_OnMetaMessage");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_OnMetaMessage, InMessage) == 0x000000, "Member 'EB0016_10_Helicopter_Missile_AI_C_OnMetaMessage::InMessage' has a wrong offset!");

// Function EB0016_10_Helicopter_Missile_AI.EB0016_10_Helicopter_Missile_AI_C.OnUpdate
// 0x000C (0x000C - 0x0000)
struct EB0016_10_Helicopter_Missile_AI_C_OnUpdate final
{
public:
	EEndAiBattleRole                              InRole;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InStep;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_10_Helicopter_Missile_AI_C_OnUpdate) == 0x000004, "Wrong alignment on EB0016_10_Helicopter_Missile_AI_C_OnUpdate");
static_assert(sizeof(EB0016_10_Helicopter_Missile_AI_C_OnUpdate) == 0x00000C, "Wrong size on EB0016_10_Helicopter_Missile_AI_C_OnUpdate");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_OnUpdate, InRole) == 0x000000, "Member 'EB0016_10_Helicopter_Missile_AI_C_OnUpdate::InRole' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_OnUpdate, InStep) == 0x000004, "Member 'EB0016_10_Helicopter_Missile_AI_C_OnUpdate::InStep' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_OnUpdate, DeltaTime) == 0x000008, "Member 'EB0016_10_Helicopter_Missile_AI_C_OnUpdate::DeltaTime' has a wrong offset!");

// Function EB0016_10_Helicopter_Missile_AI.EB0016_10_Helicopter_Missile_AI_C.OnFirstUpdate
// 0x0008 (0x0008 - 0x0000)
struct EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate final
{
public:
	EEndAiBattleRole                              InRole;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InStep;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate) == 0x000004, "Wrong alignment on EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate");
static_assert(sizeof(EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate) == 0x000008, "Wrong size on EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate, InRole) == 0x000000, "Member 'EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate::InRole' has a wrong offset!");
static_assert(offsetof(EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate, InStep) == 0x000004, "Member 'EB0016_10_Helicopter_Missile_AI_C_OnFirstUpdate::InStep' has a wrong offset!");

}

