#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB0003_00_Reno_Standard_Animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EB0003_00_Reno_Standard_Animation.EB0003_00_Reno_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UEB0003_00_Reno_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2AF8AF7544EBA86DF217E8B20AAFA848; // 0x1788(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_42A6F4D441F700C895EA899318BC25EF; // 0x17D0(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_041E7F814D4FE9820ABDB2A7E30DFBC6; // 0x1818(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_EE44EE5148C9600874F4E6A837F9D789; // 0x1860(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_BDB4A4BB435CF98EFF7A06B09FFD4D43; // 0x1900(0x0068)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_D31F36FF43E28E413DEECF86F01F7752; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_98AB2FA2446B01E116EF78810856B02E; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_B6BECD9847299A91BC207AA6F5909A65; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_91B2A9024BA422F20E223BA062E2854E; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_43C7F30B413FD25E0B1F71A15C70FE93; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_A66ECA234330EF3AAAC0AC915A671415; // 0x2740(0x0070)()

public:
	void ExecuteUbergraph_EB0003_00_Reno_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EB0003_00_Reno_Standard_Animation_C">();
	}
	static class UEB0003_00_Reno_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEB0003_00_Reno_Standard_Animation_C>();
	}
};
static_assert(alignof(UEB0003_00_Reno_Standard_Animation_C) == 0x000010, "Wrong alignment on UEB0003_00_Reno_Standard_Animation_C");
static_assert(sizeof(UEB0003_00_Reno_Standard_Animation_C) == 0x0027B0, "Wrong size on UEB0003_00_Reno_Standard_Animation_C");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UEB0003_00_Reno_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_Root_2AF8AF7544EBA86DF217E8B20AAFA848) == 0x001788, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_Root_2AF8AF7544EBA86DF217E8B20AAFA848' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_42A6F4D441F700C895EA899318BC25EF) == 0x0017D0, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_42A6F4D441F700C895EA899318BC25EF' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_041E7F814D4FE9820ABDB2A7E30DFBC6) == 0x001818, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_041E7F814D4FE9820ABDB2A7E30DFBC6' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_EE44EE5148C9600874F4E6A837F9D789) == 0x001860, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_EE44EE5148C9600874F4E6A837F9D789' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_Slot_BDB4A4BB435CF98EFF7A06B09FFD4D43) == 0x001900, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_Slot_BDB4A4BB435CF98EFF7A06B09FFD4D43' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_EndBehavior_D31F36FF43E28E413DEECF86F01F7752) == 0x001968, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_EndBehavior_D31F36FF43E28E413DEECF86F01F7752' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_Slot_98AB2FA2446B01E116EF78810856B02E) == 0x001998, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_Slot_98AB2FA2446B01E116EF78810856B02E' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_B6BECD9847299A91BC207AA6F5909A65) == 0x001A00, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_B6BECD9847299A91BC207AA6F5909A65' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_91B2A9024BA422F20E223BA062E2854E) == 0x001A50, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_91B2A9024BA422F20E223BA062E2854E' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_EndFace_43C7F30B413FD25E0B1F71A15C70FE93) == 0x002390, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_EndFace_43C7F30B413FD25E0B1F71A15C70FE93' has a wrong offset!");
static_assert(offsetof(UEB0003_00_Reno_Standard_Animation_C, AnimGraphNode_EndFaceBlend_A66ECA234330EF3AAAC0AC915A671415) == 0x002740, "Member 'UEB0003_00_Reno_Standard_Animation_C::AnimGraphNode_EndFaceBlend_A66ECA234330EF3AAAC0AC915A671415' has a wrong offset!");

}

