#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EB0021_00_Sephiroth_Standard_AI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EB0021_00_Sephiroth_Standard_AI.EB0021_00_Sephiroth_Standard_AI_C
// 0x0128 (0x2438 - 0x2310)
class AEB0021_00_Sephiroth_Standard_AI_C final : public AEndBattleAIEB0021Controller
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x2310(0x0008)(Transient, DuplicateTransient)
	class UEndAITimerComponent*                   EndAITimer;                                        // 0x2318(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Battle_Phase;                                      // 0x2320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                P3_JumpPoint;                                      // 0x2324(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CounterMotion;                                     // 0x2330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Cutscene_Flow_P2_1;                                // 0x2340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cutscene_Flow_P1;                                  // 0x2344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cutscene_Flow_P2_2;                                // 0x2348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Can_Counter;                                       // 0x234C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_234D[0x3];                                     // 0x234D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Slash_Count;                                       // 0x2350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DouchiHitCheck;                                    // 0x2354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2355[0x3];                                     // 0x2355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           DamageReactionMotion;                              // 0x2358(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           DodgeSucceed;                                      // 0x2368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         ReactionCount;                                     // 0x2378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GuardCheck;                                        // 0x237C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Phase_2_Down;                                      // 0x2380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2381[0x3];                                     // 0x2381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         GuardCheckNormal;                                  // 0x2384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Phase_3_Magic_Ability;                             // 0x2388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Phase_3_Physics_Ability;                           // 0x238C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Phase_3_Magic_Mode_Count;                          // 0x2390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GuardDamage;                                       // 0x2394(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          GuardBreak;                                        // 0x2395(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          GuardStart;                                        // 0x2396(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2397[0x1];                                     // 0x2397(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Phase_4_Loop_Count;                                // 0x2398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          P2_Trigger_Event;                                  // 0x239C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_2_Quick_Magic;                               // 0x239D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239E[0x2];                                     // 0x239E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Phase_3_Normal_Mode;                               // 0x23A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SetPlay_On;                                        // 0x23A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23A5[0x3];                                     // 0x23A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Phase_3_Blizzard_Reinforce;                        // 0x23A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GuardFlicked_Ability;                              // 0x23AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Phase_4_Meteor_Finished;                           // 0x23B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SetPlay_Running;                                   // 0x23B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23B6[0x2];                                     // 0x23B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           EB0021_00_FireWall01;                              // 0x23B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           EB0021_00_FireWall02;                              // 0x23C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           EB0021_00_FireWall03;                              // 0x23D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           EB0021_00_FireWall04;                              // 0x23E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          Phase_1_PCBurst;                                   // 0x23F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_1_FallBurst;                                 // 0x23F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_2_PCBust;                                    // 0x23FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_2_FallBurst;                                 // 0x23FB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_2_Bind_Zanshin;                              // 0x23FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PC_SetPlayStart;                                   // 0x23FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23FE[0x2];                                     // 0x23FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NewVar_0;                                          // 0x2400(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Phase_2_Event_Burst;                               // 0x2404(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_3_Event_Burst;                               // 0x2405(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Event_Sephiroth_2;                                 // 0x2406(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Event_Sephiroth_3;                                 // 0x2407(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Event_Sephiroth_1;                                 // 0x2408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2409[0x3];                                     // 0x2409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Phase_3_Random;                                    // 0x240C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Phase_1_Area02_Burst;                              // 0x2410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_1_Area03_Burst;                              // 0x2411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2412[0x6];                                     // 0x2412(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           Phase_4_CountDown;                                 // 0x2418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          Phase_4_Count_Finished;                            // 0x2428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_4_MetorCut;                                  // 0x2429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242A[0x2];                                     // 0x242A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Phase_2_GuardBreak_HP;                             // 0x242C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Phase_2_DouchiHitCloud;                            // 0x2430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Phase_2_Uchiai4;                                   // 0x2431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_EB0021_00_Sephiroth_Standard_AI(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnSummonCutSceneEnd();
	void OnPreBurstBegin();
	void Phase_3_Senkou_Counter_Finish();
	void Phase_2_Senkou_Counter_Finish();
	void Phase_1_SenkouCounterFinish();
	void OnEventDamageOverWeakCondition(EEndBattleWeakConditionType ConditionType);
	void OnBeginAbility(class AEndCharacter* InChara, class FName InAbilityName);
	void EB0021_00_P1_SetPlay_Sephiroth_01_01();
	void Guard_Start();
	void OnMotionStateMessageBegin(class FName InMotionName, class FName InName, int32 InIntValue, float InFloatValue, float InTotalDuration);
	void OnEndCutScene(const class FName& CutsceneID);
	void OnDestroyDamageSource(const class FName& DamageSourceID, const struct FVector& Location);
	void OnCutSceneMessage(const class FName& Message);
	void OnStartSetPlay();
