#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN0000_01_SecuritySoldier_Senior_AI

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function EN0000_01_SecuritySoldier_Senior_AI.EN0000_01_SecuritySoldier_Senior_AI_C.ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI
// 0x0518 (0x0518 - 0x0000)
struct EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWorkInt32_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetWorkBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AEndCharacter*>                  CallFunc_GetEnemyMembersFromID_ReturnValue;        // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class AEndCharacter*                          CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharaID_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaID_ReturnValue2;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaID_ReturnValue3;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaID_ReturnValue4;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaID_ReturnValue5;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaID_ReturnValue6;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaID_ReturnValue7;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterValid_ReturnValue;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue4;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaID_ReturnValue8;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaID_ReturnValue9;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue5;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue6;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharaHPP_ReturnValue;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharaHPP_ReturnValue;                   // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable2;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterValid_ReturnValue2;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranchBit                               CallFunc_BranchAnd_OutSignal;                      // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTakeRequestActionCountContainedName_ReturnValue; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue2;           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x006C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistance_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCharacterValid_ReturnValue3;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWorkBool_ReturnValue2;                 // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranchBit                               CallFunc_IsBoolBranch_OutSignal;                   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestAction_ReturnValue;                // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetWorkInt32_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SetWorkInt32_ReturnValue2;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Damage2;                              // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          K2Node_Event_InChara;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InName2;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAbilityCommandType                  K2Node_Event_InCommandType;                        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InBind2;                              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InGuard2;                             // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InDodge2;                             // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   K2Node_Event_InBoneName2;                          // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InAttributeWeak2;                     // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InDmgSrcID;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndBattleAttributeType                       K2Node_Event_InDmgSrcAttribute;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_JustHitRotYaw;                        // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitPosition;                          // 0x00C0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InHeal;                               // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InCounter2;                           // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataTableBattleDamageSource        K2Node_Event_dataTableBattleDamageSource;          // 0x00D0(0x0340)()
	bool                                          K2Node_Event_useAbilityUCPC;                       // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWorkBool_ReturnValue3;                 // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayer_ReturnValue;                     // 0x0413(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAIPC_ReturnValue;                       // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_415[0x3];                                      // 0x0415(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistance_ReturnValue2;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x041C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x041D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSummon_ReturnValue;                     // 0x041E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDummyPartyMember_ReturnValue;           // 0x041F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue3;                 // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue4;                 // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x0422(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranchBit                               CallFunc_NotBoolBranch_OutSignal;                  // 0x0423(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum3_CmpSuccess;                     // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x0426(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWorkBool_ReturnValue4;                 // 0x0427(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAiBattleRole                              K2Node_Event_InRole;                               // 0x0429(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42A[0x2];                                      // 0x042A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InStep;                               // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAIBranchBit                               CallFunc_IsBoolBranch_OutSignal2;                  // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetWorkBool_ReturnValue5;                 // 0x0435(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum4_CmpSuccess;                     // 0x0436(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetWorkBool_ReturnValue;                  // 0x0437(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsIdle_ReturnValue;                       // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue5;                 // 0x0439(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue6;                  // 0x043A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43B[0x1];                                      // 0x043B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCurrentAction_ReturnValue;             // 0x043C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          CallFunc_GetTarget_ReturnValue;                    // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0451(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue7;                  // 0x0452(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue8;                  // 0x0453(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranchBit                               CallFunc_IsWorkInt32Branch_OutSignal;              // 0x0454(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum5_CmpSuccess;                     // 0x0455(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestAction_ReturnValue2;               // 0x0456(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RequestBindAction_ReturnValue;            // 0x0457(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_Event_Damage;                               // 0x0458(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCharacter*                          K2Node_Event_InTarget;                             // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InName;                               // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InBind;                               // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InGuard;                              // 0x0471(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InJustGuard;                          // 0x0472(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_KeepOver;                             // 0x0473(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InDodge;                              // 0x0474(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_InCounter;                            // 0x0475(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_476[0x2];                                      // 0x0476(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InBoneName;                           // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InAttributeWeak;                      // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x3];                                      // 0x0481(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InDamageSourceID;                     // 0x0484(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InSteal;                              // 0x048C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_heal;                                 // 0x048D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWorkBool_ReturnValue6;                 // 0x048E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName2_CmpSuccess;                     // 0x048F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue6;                 // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue7;                 // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue8;                 // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue9;                 // 0x0493(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName3_CmpSuccess;                     // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue9;                  // 0x0495(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0496(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue10;                 // 0x0497(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue11;                 // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49A[0x2];                                      // 0x049A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x049C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndAIBranchBit                               CallFunc_BranchAnd_OutSignal2;                     // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum6_CmpSuccess;                     // 0x04A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWorkBool_ReturnValue7;                 // 0x04A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A7[0x1];                                      // 0x04A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ActionName;                           // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_CheckID;                              // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ComboIndex;                           // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x04BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName4_CmpSuccess;                     // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranchBit                               CallFunc_IsBoolBranch_OutSignal3;                  // 0x04C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetWorkBool_ReturnValue8;                 // 0x04C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum7_CmpSuccess;                     // 0x04C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetWorkBool_ReturnValue9;                 // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddBindAction_ReturnValue;                // 0x04C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CA[0x2];                                      // 0x04CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetWorkInt32_ReturnValue3;                // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_SetWorkName_ReturnValue;                  // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEndCharacter*                          CallFunc_GetCharacter_ReturnValue;                 // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWithinCharaEQS_ReturnValue;             // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharaHPMax_ReturnValue;                // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue12;                 // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x04EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue13;                 // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F1[0x3];                                      // 0x04F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetResidentParameterFloatBP_ReturnValue;  // 0x04F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetResidentParameterFloatBP_ReturnValue2; // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestAction_ReturnValue3;               // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranch2Other                            CallFunc_RangeSwitch2_OutSignal;                   // 0x04FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestAction_ReturnValue4;               // 0x04FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum8_CmpSuccess;                     // 0x04FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionTimeOver_ReturnValue;             // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionTimeOver_ReturnValue2;            // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActionTimeOver_ReturnValue3;            // 0x0502(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue14;                 // 0x0503(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetResidentParameterIntegerBP_ReturnValue; // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue15;                 // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharaHPP_ReturnValue2;                  // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndAIBranchBit                               CallFunc_BranchAnd_OutSignal3;                     // 0x050A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50B[0x1];                                      // 0x050B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SetWorkInt32_ReturnValue4;                // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum9_CmpSuccess;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI) == 0x000008, "Wrong alignment on EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI");
static_assert(sizeof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI) == 0x000518, "Wrong size on EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, EntryPoint) == 0x000000, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::EntryPoint' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_GetWorkInt32_ReturnValue) == 0x000004, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_GetWorkInt32_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_SetWorkBool_ReturnValue) == 0x000010, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_SetWorkBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_GetEnemyMembersFromID_ReturnValue) == 0x000018, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_GetEnemyMembersFromID_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_Array_Get_Item) == 0x000028, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue) == 0x000030, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue2) == 0x000031, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue3) == 0x000032, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue4) == 0x000033, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue5) == 0x000034, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue5' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanOR_ReturnValue) == 0x000035, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue6) == 0x000036, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue6' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanOR_ReturnValue2) == 0x000037, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanOR_ReturnValue3) == 0x000038, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_Not_PreBool_ReturnValue) == 0x000039, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue7) == 0x00003A, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue7' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharacterValid_ReturnValue) == 0x00003B, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharacterValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanOR_ReturnValue4) == 0x00003C, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanOR_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue8) == 0x00003D, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue8' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaID_ReturnValue9) == 0x00003E, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaID_ReturnValue9' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanOR_ReturnValue5) == 0x000044, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanOR_ReturnValue5' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanOR_ReturnValue6) == 0x000045, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanOR_ReturnValue6' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_GetCharaHPP_ReturnValue) == 0x000048, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_GetCharaHPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharaHPP_ReturnValue) == 0x00004C, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharaHPP_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, Temp_name_Variable) == 0x000050, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, Temp_name_Variable2) == 0x000058, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::Temp_name_Variable2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, Temp_bool_Variable) == 0x000060, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharacterValid_ReturnValue2) == 0x000061, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharacterValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BranchAnd_OutSignal) == 0x000062, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BranchAnd_OutSignal' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_GetTakeRequestActionCountContainedName_ReturnValue) == 0x000064, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_GetTakeRequestActionCountContainedName_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_EqualEqual_IntInt_ReturnValue2) == 0x000069, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_EqualEqual_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00006C, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_GetDistance_ReturnValue) == 0x000078, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_GetDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsCharacterValid_ReturnValue3) == 0x00007C, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsCharacterValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00007D, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_SetWorkBool_ReturnValue2) == 0x00007E, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_SetWorkBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanAND_ReturnValue) == 0x00007F, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsBoolBranch_OutSignal) == 0x000080, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsBoolBranch_OutSignal' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_RequestAction_ReturnValue) == 0x000081, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_RequestAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_SwitchEnum2_CmpSuccess) == 0x000082, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_SetWorkInt32_ReturnValue) == 0x000084, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_SetWorkInt32_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_SetWorkInt32_ReturnValue2) == 0x000088, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_SetWorkInt32_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_Damage2) == 0x00008C, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_Damage2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InChara) == 0x000090, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InChara' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InName2) == 0x000098, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InName2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InCommandType) == 0x0000A0, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InCommandType' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InBind2) == 0x0000A1, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InBind2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InGuard2) == 0x0000A2, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InGuard2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InDodge2) == 0x0000A3, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InDodge2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InBoneName2) == 0x0000A4, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InBoneName2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InAttributeWeak2) == 0x0000AC, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InAttributeWeak2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InDmgSrcID) == 0x0000B0, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InDmgSrcID' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InDmgSrcAttribute) == 0x0000B8, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InDmgSrcAttribute' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_JustHitRotYaw) == 0x0000BC, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_JustHitRotYaw' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_HitPosition) == 0x0000C0, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_HitPosition' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InHeal) == 0x0000CC, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InHeal' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InCounter2) == 0x0000CD, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InCounter2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_dataTableBattleDamageSource) == 0x0000D0, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_dataTableBattleDamageSource' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_useAbilityUCPC) == 0x000410, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_useAbilityUCPC' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_SetWorkBool_ReturnValue3) == 0x000411, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_SetWorkBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_SwitchName_CmpSuccess) == 0x000412, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsPlayer_ReturnValue) == 0x000413, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsAIPC_ReturnValue) == 0x000414, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsAIPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_GetDistance_ReturnValue2) == 0x000418, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_GetDistance_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_Not_PreBool_ReturnValue2) == 0x00041C, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_Not_PreBool_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_Less_FloatFloat_ReturnValue) == 0x00041D, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsSummon_ReturnValue) == 0x00041E, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsSummon_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_IsDummyPartyMember_ReturnValue) == 0x00041F, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_IsDummyPartyMember_ReturnValue' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_Not_PreBool_ReturnValue3) == 0x000420, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_Not_PreBool_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_Not_PreBool_ReturnValue4) == 0x000421, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_Not_PreBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanAND_ReturnValue2) == 0x000422, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_NotBoolBranch_OutSignal) == 0x000423, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_NotBoolBranch_OutSignal' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanAND_ReturnValue3) == 0x000424, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_SwitchEnum3_CmpSuccess) == 0x000425, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_SwitchEnum3_CmpSuccess' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanAND_ReturnValue4) == 0x000426, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_SetWorkBool_ReturnValue4) == 0x000427, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_SetWorkBool_ReturnValue4' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, CallFunc_BooleanAND_ReturnValue5) == 0x000428, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InRole) == 0x000429, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InRole' has a wrong offset!");
static_assert(offsetof(EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI, K2Node_Event_InStep) == 0x00042C, "Member 'EN0000_01_SecuritySoldier_Senior_AI_C_ExecuteUbergraph_EN0000_01_SecuritySoldier_Senior_AI::K2Node_Event_InStep' has a wrong offset!");
