#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN0000_00_SecuritySoldier_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EN0000_00_SecuritySoldier_Standard_Animation.EN0000_00_SecuritySoldier_Standard_Animation_C
// 0x1900 (0x3080 - 0x1780)
class UEN0000_00_SecuritySoldier_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_7C8D03B5459BA13FA19E549BA8321984; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_B25DF03842124DB0120F60A22C7FDCDA; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1D25BF4249061120C4E48EA40B0ADA38; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0CE9716845A7AF400C319693BAEB1385; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_30E761044A1ACFEB6CD265A98D2FF0A5; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_02DC0F5B491F7733DDAB8CB2B33D36A6; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_D57890E4463095FEB6CE2EB85A292582; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_B38231174009FD60B1217393DCD577D6; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_02352DCD44A6F28D03D55698F5E6C00B; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_7A86925D4BE3F3E532F0619D9EDBCE73; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_2B3987294928763C703470B02A0A63A9; // 0x2740(0x0070)()
	struct FAnimNode_EndBodyDriver                AnimGraphNode_EndBodyDriver_16D1D0E04FDF28AB2C1E61B90EBE2349; // 0x27B0(0x08D0)()

public:
	void ExecuteUbergraph_EN0000_00_SecuritySoldier_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EN0000_00_SecuritySoldier_Standard_Animation_C">();
	}
	static class UEN0000_00_SecuritySoldier_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEN0000_00_SecuritySoldier_Standard_Animation_C>();
	}
};
static_assert(alignof(UEN0000_00_SecuritySoldier_Standard_Animation_C) == 0x000010, "Wrong alignment on UEN0000_00_SecuritySoldier_Standard_Animation_C");
static_assert(sizeof(UEN0000_00_SecuritySoldier_Standard_Animation_C) == 0x003080, "Wrong size on UEN0000_00_SecuritySoldier_Standard_Animation_C");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_Root_7C8D03B5459BA13FA19E549BA8321984) == 0x001788, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_Root_7C8D03B5459BA13FA19E549BA8321984' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_Slot_B25DF03842124DB0120F60A22C7FDCDA) == 0x0017D0, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_Slot_B25DF03842124DB0120F60A22C7FDCDA' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_1D25BF4249061120C4E48EA40B0ADA38) == 0x001838, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_1D25BF4249061120C4E48EA40B0ADA38' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_0CE9716845A7AF400C319693BAEB1385) == 0x001880, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_0CE9716845A7AF400C319693BAEB1385' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_30E761044A1ACFEB6CD265A98D2FF0A5) == 0x0018C8, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_30E761044A1ACFEB6CD265A98D2FF0A5' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_EndBehavior_02DC0F5B491F7733DDAB8CB2B33D36A6) == 0x001968, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_EndBehavior_02DC0F5B491F7733DDAB8CB2B33D36A6' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_Slot_D57890E4463095FEB6CE2EB85A292582) == 0x001998, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_Slot_D57890E4463095FEB6CE2EB85A292582' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_B38231174009FD60B1217393DCD577D6) == 0x001A00, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_B38231174009FD60B1217393DCD577D6' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_02352DCD44A6F28D03D55698F5E6C00B) == 0x001A50, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_02352DCD44A6F28D03D55698F5E6C00B' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_EndFace_7A86925D4BE3F3E532F0619D9EDBCE73) == 0x002390, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_EndFace_7A86925D4BE3F3E532F0619D9EDBCE73' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_EndFaceBlend_2B3987294928763C703470B02A0A63A9) == 0x002740, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_EndFaceBlend_2B3987294928763C703470B02A0A63A9' has a wrong offset!");
static_assert(offsetof(UEN0000_00_SecuritySoldier_Standard_Animation_C, AnimGraphNode_EndBodyDriver_16D1D0E04FDF28AB2C1E61B90EBE2349) == 0x0027B0, "Member 'UEN0000_00_SecuritySoldier_Standard_Animation_C::AnimGraphNode_EndBodyDriver_16D1D0E04FDF28AB2C1E61B90EBE2349' has a wrong offset!");

}

