#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN2000_00_GuardHound_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass EN2000_00_GuardHound_Standard_Animation.EN2000_00_GuardHound_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UEN2000_00_GuardHound_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_607735F6430C328ECF0B50A0432F32AF; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E8F610794BFB8A7921637E960136987D; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3FDAC49D4BFB46D05F5BA4ACA468F9A9; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_81AA5B5E47BE7E9B09DA62945B6D9B41; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_409E108B4B42BEC745189CBCCE9CADA9; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_8C134D4D4E1BB4474DF35584EF1D5594; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_BC85CC13438C8D25BD5E7E9A531D9BC6; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_5D031B9740B6F3C55D0FDAB1D49372E3; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_6CBAB60045F068FFA3D09293678523C0; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_9B338302462A749A6BD5C5AFE1FF6640; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_D475B52844D64C9C190E5FBA86756E4C; // 0x2740(0x0070)()

public:
	void ExecuteUbergraph_EN2000_00_GuardHound_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EN2000_00_GuardHound_Standard_Animation_C">();
	}
	static class UEN2000_00_GuardHound_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEN2000_00_GuardHound_Standard_Animation_C>();
	}
};
static_assert(alignof(UEN2000_00_GuardHound_Standard_Animation_C) == 0x000010, "Wrong alignment on UEN2000_00_GuardHound_Standard_Animation_C");
static_assert(sizeof(UEN2000_00_GuardHound_Standard_Animation_C) == 0x0027B0, "Wrong size on UEN2000_00_GuardHound_Standard_Animation_C");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_Root_607735F6430C328ECF0B50A0432F32AF) == 0x001788, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_Root_607735F6430C328ECF0B50A0432F32AF' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_Slot_E8F610794BFB8A7921637E960136987D) == 0x0017D0, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_Slot_E8F610794BFB8A7921637E960136987D' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_3FDAC49D4BFB46D05F5BA4ACA468F9A9) == 0x001838, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_3FDAC49D4BFB46D05F5BA4ACA468F9A9' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_81AA5B5E47BE7E9B09DA62945B6D9B41) == 0x001880, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_81AA5B5E47BE7E9B09DA62945B6D9B41' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_409E108B4B42BEC745189CBCCE9CADA9) == 0x0018C8, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_409E108B4B42BEC745189CBCCE9CADA9' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_EndBehavior_8C134D4D4E1BB4474DF35584EF1D5594) == 0x001968, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_EndBehavior_8C134D4D4E1BB4474DF35584EF1D5594' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_Slot_BC85CC13438C8D25BD5E7E9A531D9BC6) == 0x001998, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_Slot_BC85CC13438C8D25BD5E7E9A531D9BC6' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_5D031B9740B6F3C55D0FDAB1D49372E3) == 0x001A00, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_5D031B9740B6F3C55D0FDAB1D49372E3' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_6CBAB60045F068FFA3D09293678523C0) == 0x001A50, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_6CBAB60045F068FFA3D09293678523C0' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_EndFace_9B338302462A749A6BD5C5AFE1FF6640) == 0x002390, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_EndFace_9B338302462A749A6BD5C5AFE1FF6640' has a wrong offset!");
static_assert(offsetof(UEN2000_00_GuardHound_Standard_Animation_C, AnimGraphNode_EndFaceBlend_D475B52844D64C9C190E5FBA86756E4C) == 0x002740, "Member 'UEN2000_00_GuardHound_Standard_Animation_C::AnimGraphNode_EndFaceBlend_D475B52844D64C9C190E5FBA86756E4C' has a wrong offset!");

}

