#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN9000_00_Feeler_Standard

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EN9000_00_Feeler_Standard.EN9000_00_Feeler_Standard_C
// 0x0020 (0x22E0 - 0x22C0)
class AEN9000_00_Feeler_Standard_C final : public AEndCharacter
{
public:
	uint8                                         Pad_22B8[0x8];                                     // 0x22B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UEndCharacterWhizSeComponent*           EndCharacterWhizSe;                                // 0x22C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_EN9000_Resident_Body_01;                        // 0x22C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UEndCharacterPushCollisionComponent*    EndCharacterPushCollision;                         // 0x22D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EN9000_00_Feeler_Standard_C">();
	}
	static class AEN9000_00_Feeler_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEN9000_00_Feeler_Standard_C>();
	}
};
static_assert(alignof(AEN9000_00_Feeler_Standard_C) == 0x000010, "Wrong alignment on AEN9000_00_Feeler_Standard_C");
static_assert(sizeof(AEN9000_00_Feeler_Standard_C) == 0x0022E0, "Wrong size on AEN9000_00_Feeler_Standard_C");
static_assert(offsetof(AEN9000_00_Feeler_Standard_C, EndCharacterWhizSe) == 0x0022C0, "Member 'AEN9000_00_Feeler_Standard_C::EndCharacterWhizSe' has a wrong offset!");
static_assert(offsetof(AEN9000_00_Feeler_Standard_C, FX_EN9000_Resident_Body_01) == 0x0022C8, "Member 'AEN9000_00_Feeler_Standard_C::FX_EN9000_Resident_Body_01' has a wrong offset!");
static_assert(offsetof(AEN9000_00_Feeler_Standard_C, EndCharacterPushCollision) == 0x0022D0, "Member 'AEN9000_00_Feeler_Standard_C::EndCharacterPushCollision' has a wrong offset!");

}

