#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EN9000_00_Feeler_Standard_01_AI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass EN9000_00_Feeler_Standard_01_AI.EN9000_00_Feeler_Standard_01_AI_C
// 0x0010 (0x22C0 - 0x22B0)
class AEN9000_00_Feeler_Standard_01_AI_C final : public AEndBattleAIEN9000Controller
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x22B0(0x0008)(Transient, DuplicateTransient)
	bool                                          ActionWondering;                                   // 0x22B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MovingConfrontNear;                                // 0x22B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MovingConfrontFar;                                 // 0x22BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ModeNear;                                          // 0x22BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FinishCheckFlg;                                    // 0x22BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ForceStop;                                         // 0x22BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_EN9000_00_Feeler_Standard_01_AI(int32 EntryPoint);
	void OnMetaMessageAboutCharacter(class AEndCharacter* InChara, const class FString& InMessage);
	void OnEntryBattleScene();
	void ReceiveTick(float DeltaSeconds);
	void OnUpdate(EEndAiBattleRole InRole, int32 InStep, float DeltaTime);
	void OnFirstUpdate(EEndAiBattleRole InRole, int32 InStep);
	void OnTakeDamageOnce(class AEndCharacter* InCauserChara, class FName InAbilityID, bool InAttributeWeak, EEndBattleAbilityCommandType AbilityCommandType);
	void AccentIdle();
	void FinishWondering();
	void MoveToFar();
	void MoveToNear();
	void OnMetaMessage(const class FString& InMessage);
	void SlapAttack();
	void UserConstructionScript();
	void Wondering();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EN9000_00_Feeler_Standard_01_AI_C">();
	}
	static class AEN9000_00_Feeler_Standard_01_AI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEN9000_00_Feeler_Standard_01_AI_C>();
	}
};
static_assert(alignof(AEN9000_00_Feeler_Standard_01_AI_C) == 0x000008, "Wrong alignment on AEN9000_00_Feeler_Standard_01_AI_C");
static_assert(sizeof(AEN9000_00_Feeler_Standard_01_AI_C) == 0x0022C0, "Wrong size on AEN9000_00_Feeler_Standard_01_AI_C");
static_assert(offsetof(AEN9000_00_Feeler_Standard_01_AI_C, UberGraphFrame) == 0x0022B0, "Member 'AEN9000_00_Feeler_Standard_01_AI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AEN9000_00_Feeler_Standard_01_AI_C, ActionWondering) == 0x0022B8, "Member 'AEN9000_00_Feeler_Standard_01_AI_C::ActionWondering' has a wrong offset!");
static_assert(offsetof(AEN9000_00_Feeler_Standard_01_AI_C, MovingConfrontNear) == 0x0022B9, "Member 'AEN9000_00_Feeler_Standard_01_AI_C::MovingConfrontNear' has a wrong offset!");
static_assert(offsetof(AEN9000_00_Feeler_Standard_01_AI_C, MovingConfrontFar) == 0x0022BA, "Member 'AEN9000_00_Feeler_Standard_01_AI_C::MovingConfrontFar' has a wrong offset!");
static_assert(offsetof(AEN9000_00_Feeler_Standard_01_AI_C, ModeNear) == 0x0022BB, "Member 'AEN9000_00_Feeler_Standard_01_AI_C::ModeNear' has a wrong offset!");
static_assert(offsetof(AEN9000_00_Feeler_Standard_01_AI_C, FinishCheckFlg) == 0x0022BC, "Member 'AEN9000_00_Feeler_Standard_01_AI_C::FinishCheckFlg' has a wrong offset!");
static_assert(offsetof(AEN9000_00_Feeler_Standard_01_AI_C, ForceStop) == 0x0022BD, "Member 'AEN9000_00_Feeler_Standard_01_AI_C::ForceStop' has a wrong offset!");

}

