#pragma once
#undef GetCurrentTime

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndGame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SQEXSEAD_structs.hpp"
#include "SQEXSEAD_classes.hpp"
#include "EndGame_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "AnimGraphRuntime_classes.hpp"
#include "LevelSequence_classes.hpp"
#include "Slate_structs.hpp"
#include "AnimationCore_structs.hpp"
#include "AnimationBudgetAllocator_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class EndGame.EndAerialRouteSearchInstance
// 0x0108 (0x0130 - 0x0028)
class UEndAerialRouteSearchInstance final : public UObject
{
public:
	uint8                                         Pad_28[0x108];                                     // 0x0028(0x0108)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndAerialRouteSearchInstance">();
	}
	static class UEndAerialRouteSearchInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndAerialRouteSearchInstance>();
	}
};
static_assert(alignof(UEndAerialRouteSearchInstance) == 0x000008, "Wrong alignment on UEndAerialRouteSearchInstance");
static_assert(sizeof(UEndAerialRouteSearchInstance) == 0x000130, "Wrong size on UEndAerialRouteSearchInstance");

// Class EndGame.EndUserWidget
// 0x0160 (0x0360 - 0x0200)
class UEndUserWidget : public UUserWidget
{
public:
	bool                                          bPauseable;                                        // 0x0200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAnimationDuplication;                             // 0x0201(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSupportsPromotionVideo;                           // 0x0202(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_203[0xBD];                                     // 0x0203(0x00BD)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UWidgetAnimation*>    ChachedAnimations;                                 // 0x02C0(0x0050)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class FName, class UWidgetAnimation*>    SharedAnimations;                                  // 0x0310(0x0050)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void AddToOffscreen(int32 ZOrder);
	bool AddToPlayerScreenEx(int32 ZOrder);
	void AddToScene(const struct FVector& InLocation, const struct FRotator& InRotation);
	void AddToViewportEx(int32 ZOrder);
	bool IsAnimationPlayingForwardByName(class FName InAnimationName);
	bool IsAnimationPlayingForwardEx(const class UWidgetAnimation* InAnimation);
	float PauseAnimationByName(class FName InAnimationName);
	float PauseAnimationEx(const class UWidgetAnimation* InAnimation);
	bool PlayAnimationByName(class FName InAnimationName, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	void PlayAnimationEx(class UWidgetAnimation* InAnimation, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	void PlayAnimationExAutoReverse(class UWidgetAnimation* InAnimation, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed, float ReverseSpeed);
	bool PlayAnimationToByName(class FName InAnimationName, float StartAtTime, float EndAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	void PlayAnimationToEx(class UWidgetAnimation* InAnimation, float StartAtTime, float EndAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	void PopFromFocusStack();
	void PushToFocusStack();
	void RemoveFromViewportEx();
	void ReverseAnimationByName(class FName InAnimationName);
	void ReverseAnimationEx(const class UWidgetAnimation* InAnimation);
	bool SetFocusToChild(class UWidget* InWidget, EFocusCause InFocusCause);
	void SetLocationInScene(const struct FVector& InLocation);
	void SetNumLoopsToPlayByName(class FName InAnimationName, int32 NumLoopsToPlay);
	void SetNumLoopsToPlayEx(const class UWidgetAnimation* InAnimation, int32 NumLoopsToPlay);
	void SetPlaybackSpeedByName(class FName InAnimationName, float PlaybackSpeed);
	void SetPlaybackSpeedEx(const class UWidgetAnimation* InAnimation, float PlaybackSpeed);
	void SetRotationInScene(const struct FRotator& InRotation);
	void StopAllAnimationsEx();
	void StopAnimationByName(class FName InAnimationName);
	void StopAnimationEx(const class UWidgetAnimation* InAnimation);

	float GetAnimationCurrentTimeByName(class FName InAnimationName) const;
	float GetAnimationCurrentTimeEx(const class UWidgetAnimation* InAnimation) const;
	float GetAnimationEndTimeByName(class FName InAnimationName) const;
	float GetAnimationStartTimeByName(class FName InAnimationName) const;
	class UWidget* GetFocusedChildWidget() const;
	struct FVector GetLocationInScene() const;
	struct FRotator GetRotationInScene() const;
	int32 GetZOrderInViewport() const;
	bool IsAnimationPlayingByName(class FName InAnimationName) const;
	bool IsAnimationPlayingEx(const class UWidgetAnimation* InAnimation) const;
	bool IsAnyAnimationPlayingEx() const;
	bool IsInViewportEx() const;
	bool IsPlayingAnimationEx() const;
	bool IsPlayingAnimationIgnoreStopped() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndUserWidget">();
	}
	static class UEndUserWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndUserWidget>();
	}
};
static_assert(alignof(UEndUserWidget) == 0x000008, "Wrong alignment on UEndUserWidget");
static_assert(sizeof(UEndUserWidget) == 0x000360, "Wrong size on UEndUserWidget");
static_assert(offsetof(UEndUserWidget, bPauseable) == 0x000200, "Member 'UEndUserWidget::bPauseable' has a wrong offset!");
static_assert(offsetof(UEndUserWidget, bAnimationDuplication) == 0x000201, "Member 'UEndUserWidget::bAnimationDuplication' has a wrong offset!");
static_assert(offsetof(UEndUserWidget, bSupportsPromotionVideo) == 0x000202, "Member 'UEndUserWidget::bSupportsPromotionVideo' has a wrong offset!");
static_assert(offsetof(UEndUserWidget, ChachedAnimations) == 0x0002C0, "Member 'UEndUserWidget::ChachedAnimations' has a wrong offset!");
static_assert(offsetof(UEndUserWidget, SharedAnimations) == 0x000310, "Member 'UEndUserWidget::SharedAnimations' has a wrong offset!");

// Class EndGame.EndEventProgressDisplay
// 0x0008 (0x0368 - 0x0360)
class UEndEventProgressDisplay : public UEndUserWidget
{
public:
	float                                         OffsetForNaviMap;                                  // 0x0360(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndEventProgressDisplay">();
	}
	static class UEndEventProgressDisplay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndEventProgressDisplay>();
	}
};
static_assert(alignof(UEndEventProgressDisplay) == 0x000008, "Wrong alignment on UEndEventProgressDisplay");
static_assert(sizeof(UEndEventProgressDisplay) == 0x000368, "Wrong size on UEndEventProgressDisplay");
static_assert(offsetof(UEndEventProgressDisplay, OffsetForNaviMap) == 0x000360, "Member 'UEndEventProgressDisplay::OffsetForNaviMap' has a wrong offset!");

// Class EndGame.AnimNotify_EndEmissiveAnimation
// 0x0020 (0x0058 - 0x0038)
class UAnimNotify_EndEmissiveAnimation final : public UAnimNotify
{
public:
	class FName                                   ColorPaletteId;                                    // 0x0038(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndEmissiveModifierType                      Modifier;                                          // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndEmissiveCurveType                         Curve;                                             // 0x0041(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0048(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x004C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartOffset;                                       // 0x0050(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndOffset;                                         // 0x0054(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndEmissiveAnimation">();
	}
	static class UAnimNotify_EndEmissiveAnimation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndEmissiveAnimation>();
	}
};
static_assert(alignof(UAnimNotify_EndEmissiveAnimation) == 0x000008, "Wrong alignment on UAnimNotify_EndEmissiveAnimation");
static_assert(sizeof(UAnimNotify_EndEmissiveAnimation) == 0x000058, "Wrong size on UAnimNotify_EndEmissiveAnimation");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimation, ColorPaletteId) == 0x000038, "Member 'UAnimNotify_EndEmissiveAnimation::ColorPaletteId' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimation, Modifier) == 0x000040, "Member 'UAnimNotify_EndEmissiveAnimation::Modifier' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimation, Curve) == 0x000041, "Member 'UAnimNotify_EndEmissiveAnimation::Curve' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimation, Duration) == 0x000044, "Member 'UAnimNotify_EndEmissiveAnimation::Duration' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimation, BlendInTime) == 0x000048, "Member 'UAnimNotify_EndEmissiveAnimation::BlendInTime' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimation, BlendOutTime) == 0x00004C, "Member 'UAnimNotify_EndEmissiveAnimation::BlendOutTime' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimation, StartOffset) == 0x000050, "Member 'UAnimNotify_EndEmissiveAnimation::StartOffset' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimation, EndOffset) == 0x000054, "Member 'UAnimNotify_EndEmissiveAnimation::EndOffset' has a wrong offset!");

// Class EndGame.EndEnvQueryContext_DangerDamageSource
// 0x0000 (0x0028 - 0x0028)
class UEndEnvQueryContext_DangerDamageSource final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndEnvQueryContext_DangerDamageSource">();
	}
	static class UEndEnvQueryContext_DangerDamageSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndEnvQueryContext_DangerDamageSource>();
	}
};
static_assert(alignof(UEndEnvQueryContext_DangerDamageSource) == 0x000008, "Wrong alignment on UEndEnvQueryContext_DangerDamageSource");
static_assert(sizeof(UEndEnvQueryContext_DangerDamageSource) == 0x000028, "Wrong size on UEndEnvQueryContext_DangerDamageSource");

// Class EndGame.EndAerialIgnoreComponent
// 0x0020 (0x02D0 - 0x02B0)
class UEndAerialIgnoreComponent final : public USceneComponent
{
public:
	class FName                                   AerialVolumeName;                                  // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAerialIgnoreShapeType                        MeshShapeType;                                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoxExtent;                                         // 0x02BC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         SphereRadius;                                      // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndAerialIgnoreComponent">();
	}
	static class UEndAerialIgnoreComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndAerialIgnoreComponent>();
	}
};
static_assert(alignof(UEndAerialIgnoreComponent) == 0x000008, "Wrong alignment on UEndAerialIgnoreComponent");
static_assert(sizeof(UEndAerialIgnoreComponent) == 0x0002D0, "Wrong size on UEndAerialIgnoreComponent");
static_assert(offsetof(UEndAerialIgnoreComponent, AerialVolumeName) == 0x0002B0, "Member 'UEndAerialIgnoreComponent::AerialVolumeName' has a wrong offset!");
static_assert(offsetof(UEndAerialIgnoreComponent, MeshShapeType) == 0x0002B8, "Member 'UEndAerialIgnoreComponent::MeshShapeType' has a wrong offset!");
static_assert(offsetof(UEndAerialIgnoreComponent, BoxExtent) == 0x0002BC, "Member 'UEndAerialIgnoreComponent::BoxExtent' has a wrong offset!");
static_assert(offsetof(UEndAerialIgnoreComponent, SphereRadius) == 0x0002C8, "Member 'UEndAerialIgnoreComponent::SphereRadius' has a wrong offset!");

// Class EndGame.EndEnvQueryTest_ProjectionGeneratorInitialScore
// 0x0000 (0x01C0 - 0x01C0)
class UEndEnvQueryTest_ProjectionGeneratorInitialScore final : public UEnvQueryTest
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndEnvQueryTest_ProjectionGeneratorInitialScore">();
	}
	static class UEndEnvQueryTest_ProjectionGeneratorInitialScore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndEnvQueryTest_ProjectionGeneratorInitialScore>();
	}
};
static_assert(alignof(UEndEnvQueryTest_ProjectionGeneratorInitialScore) == 0x000008, "Wrong alignment on UEndEnvQueryTest_ProjectionGeneratorInitialScore");
static_assert(sizeof(UEndEnvQueryTest_ProjectionGeneratorInitialScore) == 0x0001C0, "Wrong size on UEndEnvQueryTest_ProjectionGeneratorInitialScore");

// Class EndGame.AnimNotify_EndAim
// 0x0010 (0x0040 - 0x0030)
class UAnimNotify_EndAim final : public UAnimNotifyState
{
public:
	TArray<class FName>                           EffectorSettingNames;                              // 0x0030(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndAim">();
	}
	static class UAnimNotify_EndAim* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndAim>();
	}
};
static_assert(alignof(UAnimNotify_EndAim) == 0x000008, "Wrong alignment on UAnimNotify_EndAim");
static_assert(sizeof(UAnimNotify_EndAim) == 0x000040, "Wrong size on UAnimNotify_EndAim");
static_assert(offsetof(UAnimNotify_EndAim, EffectorSettingNames) == 0x000030, "Member 'UAnimNotify_EndAim::EffectorSettingNames' has a wrong offset!");

// Class EndGame.EndEnvQueryContext_AIPCCommandTarget
// 0x0000 (0x0028 - 0x0028)
class UEndEnvQueryContext_AIPCCommandTarget final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndEnvQueryContext_AIPCCommandTarget">();
	}
	static class UEndEnvQueryContext_AIPCCommandTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndEnvQueryContext_AIPCCommandTarget>();
	}
};
static_assert(alignof(UEndEnvQueryContext_AIPCCommandTarget) == 0x000008, "Wrong alignment on UEndEnvQueryContext_AIPCCommandTarget");
static_assert(sizeof(UEndEnvQueryContext_AIPCCommandTarget) == 0x000028, "Wrong size on UEndEnvQueryContext_AIPCCommandTarget");

// Class EndGame.EndAerialIgnoreVolume
// 0x0008 (0x0380 - 0x0378)
class AEndAerialIgnoreVolume final : public AActor
{
public:
	class UEndAerialIgnoreComponent*              AerialIgnoreComponent;                             // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndAerialIgnoreVolume">();
	}
	static class AEndAerialIgnoreVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEndAerialIgnoreVolume>();
	}
};
static_assert(alignof(AEndAerialIgnoreVolume) == 0x000008, "Wrong alignment on AEndAerialIgnoreVolume");
static_assert(sizeof(AEndAerialIgnoreVolume) == 0x000380, "Wrong size on AEndAerialIgnoreVolume");
static_assert(offsetof(AEndAerialIgnoreVolume, AerialIgnoreComponent) == 0x000378, "Member 'AEndAerialIgnoreVolume::AerialIgnoreComponent' has a wrong offset!");

// Class EndGame.EndFieldActionTriggerComponent
// 0x0020 (0x0740 - 0x0720)
class UEndFieldActionTriggerComponent : public UBoxComponent
{
public:
	EFieldActionActorType                         ActionType;                                        // 0x0720(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                IconOffsetLocation;                                // 0x0724(0x000C)(Edit, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               IconOffsetRotation;                                // 0x0730(0x000C)(Edit, DisableEditOnTemplate, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          DrawPlane;                                         // 0x073C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_73D[0x3];                                      // 0x073D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndFieldActionTriggerComponent">();
	}
	static class UEndFieldActionTriggerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndFieldActionTriggerComponent>();
	}
};
static_assert(alignof(UEndFieldActionTriggerComponent) == 0x000010, "Wrong alignment on UEndFieldActionTriggerComponent");
static_assert(sizeof(UEndFieldActionTriggerComponent) == 0x000740, "Wrong size on UEndFieldActionTriggerComponent");
static_assert(offsetof(UEndFieldActionTriggerComponent, ActionType) == 0x000720, "Member 'UEndFieldActionTriggerComponent::ActionType' has a wrong offset!");
static_assert(offsetof(UEndFieldActionTriggerComponent, IconOffsetLocation) == 0x000724, "Member 'UEndFieldActionTriggerComponent::IconOffsetLocation' has a wrong offset!");
static_assert(offsetof(UEndFieldActionTriggerComponent, IconOffsetRotation) == 0x000730, "Member 'UEndFieldActionTriggerComponent::IconOffsetRotation' has a wrong offset!");
static_assert(offsetof(UEndFieldActionTriggerComponent, DrawPlane) == 0x00073C, "Member 'UEndFieldActionTriggerComponent::DrawPlane' has a wrong offset!");

// Class EndGame.EndMonkeyBarTriggerComponent
// 0x0010 (0x0750 - 0x0740)
class UEndMonkeyBarTriggerComponent final : public UEndFieldActionTriggerComponent
{
public:
	uint16                                        Index_0;                                           // 0x0740(0x0002)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_742[0xE];                                      // 0x0742(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndMonkeyBarTriggerComponent">();
	}
	static class UEndMonkeyBarTriggerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndMonkeyBarTriggerComponent>();
	}
};
static_assert(alignof(UEndMonkeyBarTriggerComponent) == 0x000010, "Wrong alignment on UEndMonkeyBarTriggerComponent");
static_assert(sizeof(UEndMonkeyBarTriggerComponent) == 0x000750, "Wrong size on UEndMonkeyBarTriggerComponent");
static_assert(offsetof(UEndMonkeyBarTriggerComponent, Index_0) == 0x000740, "Member 'UEndMonkeyBarTriggerComponent::Index_0' has a wrong offset!");

// Class EndGame.EndBattleDamageSourceComponent
// 0x0368 (0x0460 - 0x00F8)
class UEndBattleDamageSourceComponent : public UActorComponent
{
public:
	uint8                                         Pad_F8[0x268];                                     // 0x00F8(0x0268)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndCollisionActor*                     PushCollisionActor;                                // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_368[0xF8];                                     // 0x0368(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	struct FVector GetDir() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndBattleDamageSourceComponent">();
	}
	static class UEndBattleDamageSourceComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndBattleDamageSourceComponent>();
	}
};
static_assert(alignof(UEndBattleDamageSourceComponent) == 0x000008, "Wrong alignment on UEndBattleDamageSourceComponent");
static_assert(sizeof(UEndBattleDamageSourceComponent) == 0x000460, "Wrong size on UEndBattleDamageSourceComponent");
static_assert(offsetof(UEndBattleDamageSourceComponent, PushCollisionActor) == 0x000360, "Member 'UEndBattleDamageSourceComponent::PushCollisionActor' has a wrong offset!");

// Class EndGame.EndBattleDamageSourceComponentRocketPunch
// 0x0010 (0x0470 - 0x0460)
class UEndBattleDamageSourceComponentRocketPunch final : public UEndBattleDamageSourceComponent
{
public:
	uint8                                         Pad_460[0x10];                                     // 0x0460(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndBattleDamageSourceComponentRocketPunch">();
	}
	static class UEndBattleDamageSourceComponentRocketPunch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndBattleDamageSourceComponentRocketPunch>();
	}
};
static_assert(alignof(UEndBattleDamageSourceComponentRocketPunch) == 0x000008, "Wrong alignment on UEndBattleDamageSourceComponentRocketPunch");
static_assert(sizeof(UEndBattleDamageSourceComponentRocketPunch) == 0x000470, "Wrong size on UEndBattleDamageSourceComponentRocketPunch");

// Class EndGame.AnimNotify_EndAimExtension
// 0x0000 (0x0030 - 0x0030)
class UAnimNotify_EndAimExtension final : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndAimExtension">();
	}
	static class UAnimNotify_EndAimExtension* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndAimExtension>();
	}
};
static_assert(alignof(UAnimNotify_EndAimExtension) == 0x000008, "Wrong alignment on UAnimNotify_EndAimExtension");
static_assert(sizeof(UAnimNotify_EndAimExtension) == 0x000030, "Wrong size on UAnimNotify_EndAimExtension");

// Class EndGame.AnimNotify_EndCharacterBoneAcceleration
// 0x0030 (0x0060 - 0x0030)
class UAnimNotify_EndCharacterBoneAcceleration final : public UAnimNotifyState
{
public:
	class FName                                   BoneName;                                          // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               MaxVelocity;                                       // 0x0038(0x000C)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               BeginAcceleration;                                 // 0x0044(0x000C)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               EndAcceleration;                                   // 0x0050(0x000C)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndCharacterBoneAcceleration">();
	}
	static class UAnimNotify_EndCharacterBoneAcceleration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndCharacterBoneAcceleration>();
	}
};
static_assert(alignof(UAnimNotify_EndCharacterBoneAcceleration) == 0x000008, "Wrong alignment on UAnimNotify_EndCharacterBoneAcceleration");
static_assert(sizeof(UAnimNotify_EndCharacterBoneAcceleration) == 0x000060, "Wrong size on UAnimNotify_EndCharacterBoneAcceleration");
static_assert(offsetof(UAnimNotify_EndCharacterBoneAcceleration, BoneName) == 0x000030, "Member 'UAnimNotify_EndCharacterBoneAcceleration::BoneName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndCharacterBoneAcceleration, MaxVelocity) == 0x000038, "Member 'UAnimNotify_EndCharacterBoneAcceleration::MaxVelocity' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndCharacterBoneAcceleration, BeginAcceleration) == 0x000044, "Member 'UAnimNotify_EndCharacterBoneAcceleration::BeginAcceleration' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndCharacterBoneAcceleration, EndAcceleration) == 0x000050, "Member 'UAnimNotify_EndCharacterBoneAcceleration::EndAcceleration' has a wrong offset!");

// Class EndGame.EndBattleLevelSequenceActor
// 0x0180 (0x05D0 - 0x0450)
class AEndBattleLevelSequenceActor final : public ALevelSequenceActor
{
public:
	uint8                                         Pad_450[0x18];                                     // 0x0450(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AEndBattleCameraActor*                  CameraActor;                                       // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_470[0x160];                                    // 0x0470(0x0160)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnStop();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndBattleLevelSequenceActor">();
	}
	static class AEndBattleLevelSequenceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEndBattleLevelSequenceActor>();
	}
};
static_assert(alignof(AEndBattleLevelSequenceActor) == 0x000008, "Wrong alignment on AEndBattleLevelSequenceActor");
static_assert(sizeof(AEndBattleLevelSequenceActor) == 0x0005D0, "Wrong size on AEndBattleLevelSequenceActor");
static_assert(offsetof(AEndBattleLevelSequenceActor, CameraActor) == 0x000468, "Member 'AEndBattleLevelSequenceActor::CameraActor' has a wrong offset!");

// Class EndGame.AnimNotify_EndDisableBoneLocalRotate
// 0x0000 (0x0030 - 0x0030)
class UAnimNotify_EndDisableBoneLocalRotate final : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndDisableBoneLocalRotate">();
	}
	static class UAnimNotify_EndDisableBoneLocalRotate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndDisableBoneLocalRotate>();
	}
};
static_assert(alignof(UAnimNotify_EndDisableBoneLocalRotate) == 0x000008, "Wrong alignment on UAnimNotify_EndDisableBoneLocalRotate");
static_assert(sizeof(UAnimNotify_EndDisableBoneLocalRotate) == 0x000030, "Wrong size on UAnimNotify_EndDisableBoneLocalRotate");

// Class EndGame.AnimNotify_EndDisableGlobalWind
// 0x0000 (0x0030 - 0x0030)
class UAnimNotify_EndDisableGlobalWind final : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndDisableGlobalWind">();
	}
	static class UAnimNotify_EndDisableGlobalWind* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndDisableGlobalWind>();
	}
};
static_assert(alignof(UAnimNotify_EndDisableGlobalWind) == 0x000008, "Wrong alignment on UAnimNotify_EndDisableGlobalWind");
static_assert(sizeof(UAnimNotify_EndDisableGlobalWind) == 0x000030, "Wrong size on UAnimNotify_EndDisableGlobalWind");

// Class EndGame.EndEnvQueryContext_AIPCMoveToLocation
// 0x0000 (0x0028 - 0x0028)
class UEndEnvQueryContext_AIPCMoveToLocation final : public UEnvQueryContext
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndEnvQueryContext_AIPCMoveToLocation">();
	}
	static class UEndEnvQueryContext_AIPCMoveToLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndEnvQueryContext_AIPCMoveToLocation>();
	}
};
static_assert(alignof(UEndEnvQueryContext_AIPCMoveToLocation) == 0x000008, "Wrong alignment on UEndEnvQueryContext_AIPCMoveToLocation");
static_assert(sizeof(UEndEnvQueryContext_AIPCMoveToLocation) == 0x000028, "Wrong size on UEndEnvQueryContext_AIPCMoveToLocation");

// Class EndGame.EndMainSaveLoadMenu
// 0x0100 (0x0460 - 0x0360)
class UEndMainSaveLoadMenu : public UEndUserWidget
{
public:
	uint8                                         Pad_360[0xF8];                                     // 0x0360(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	class UEndUserWidget*                         Throbber;                                          // 0x0458(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnSaveDataCancelled();
	void OnSaveDataPressedItem(int32 ItemIndex);
	void OnSaveDataSelectedIndexChanged(int32 ItemIndex);
	void OnSaveDataSetupItem(class UWidget* ItemWidget, int32 ItemIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndMainSaveLoadMenu">();
	}
	static class UEndMainSaveLoadMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndMainSaveLoadMenu>();
	}
};
static_assert(alignof(UEndMainSaveLoadMenu) == 0x000008, "Wrong alignment on UEndMainSaveLoadMenu");
static_assert(sizeof(UEndMainSaveLoadMenu) == 0x000460, "Wrong size on UEndMainSaveLoadMenu");
static_assert(offsetof(UEndMainSaveLoadMenu, Throbber) == 0x000458, "Member 'UEndMainSaveLoadMenu::Throbber' has a wrong offset!");

// Class EndGame.EndBikeTriggerBoxResetPhysActor
// 0x0010 (0x0390 - 0x0380)
class AEndBikeTriggerBoxResetPhysActor final : public ATriggerBox
{
public:
	class AEndCharacter*                          mTriggerTarget;                                    // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AEndBikeTriggerBoxSavePhysActor*        SaveTrigger;                                       // 0x0388(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void BeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndBikeTriggerBoxResetPhysActor">();
	}
	static class AEndBikeTriggerBoxResetPhysActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEndBikeTriggerBoxResetPhysActor>();
	}
};
static_assert(alignof(AEndBikeTriggerBoxResetPhysActor) == 0x000008, "Wrong alignment on AEndBikeTriggerBoxResetPhysActor");
static_assert(sizeof(AEndBikeTriggerBoxResetPhysActor) == 0x000390, "Wrong size on AEndBikeTriggerBoxResetPhysActor");
static_assert(offsetof(AEndBikeTriggerBoxResetPhysActor, mTriggerTarget) == 0x000380, "Member 'AEndBikeTriggerBoxResetPhysActor::mTriggerTarget' has a wrong offset!");
static_assert(offsetof(AEndBikeTriggerBoxResetPhysActor, SaveTrigger) == 0x000388, "Member 'AEndBikeTriggerBoxResetPhysActor::SaveTrigger' has a wrong offset!");

// Class EndGame.EndAerialNavBoxComponent
// 0x0010 (0x0730 - 0x0720)
class UEndAerialNavBoxComponent final : public UBoxComponent
{
public:
	uint8                                         BoxID;                                             // 0x0720(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_721[0xF];                                      // 0x0721(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndAerialNavBoxComponent">();
	}
	static class UEndAerialNavBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndAerialNavBoxComponent>();
	}
};
static_assert(alignof(UEndAerialNavBoxComponent) == 0x000010, "Wrong alignment on UEndAerialNavBoxComponent");
static_assert(sizeof(UEndAerialNavBoxComponent) == 0x000730, "Wrong size on UEndAerialNavBoxComponent");
static_assert(offsetof(UEndAerialNavBoxComponent, BoxID) == 0x000720, "Member 'UEndAerialNavBoxComponent::BoxID' has a wrong offset!");

// Class EndGame.AnimNotify_EndDisableLipSyncAudioAttack
// 0x0000 (0x0030 - 0x0030)
class UAnimNotify_EndDisableLipSyncAudioAttack final : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndDisableLipSyncAudioAttack">();
	}
	static class UAnimNotify_EndDisableLipSyncAudioAttack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndDisableLipSyncAudioAttack>();
	}
};
static_assert(alignof(UAnimNotify_EndDisableLipSyncAudioAttack) == 0x000008, "Wrong alignment on UAnimNotify_EndDisableLipSyncAudioAttack");
static_assert(sizeof(UAnimNotify_EndDisableLipSyncAudioAttack) == 0x000030, "Wrong size on UAnimNotify_EndDisableLipSyncAudioAttack");

// Class EndGame.EndAerialNavDebugDrawComponent
// 0x0000 (0x00F8 - 0x00F8)
class UEndAerialNavDebugDrawComponent final : public UActorComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndAerialNavDebugDrawComponent">();
	}
	static class UEndAerialNavDebugDrawComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndAerialNavDebugDrawComponent>();
	}
};
static_assert(alignof(UEndAerialNavDebugDrawComponent) == 0x000008, "Wrong alignment on UEndAerialNavDebugDrawComponent");
static_assert(sizeof(UEndAerialNavDebugDrawComponent) == 0x0000F8, "Wrong size on UEndAerialNavDebugDrawComponent");

// Class EndGame.AnimNotify_EndDisableWeaponAutoSetVisibility
// 0x0000 (0x0030 - 0x0030)
class UAnimNotify_EndDisableWeaponAutoSetVisibility final : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndDisableWeaponAutoSetVisibility">();
	}
	static class UAnimNotify_EndDisableWeaponAutoSetVisibility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndDisableWeaponAutoSetVisibility>();
	}
};
static_assert(alignof(UAnimNotify_EndDisableWeaponAutoSetVisibility) == 0x000008, "Wrong alignment on UAnimNotify_EndDisableWeaponAutoSetVisibility");
static_assert(sizeof(UAnimNotify_EndDisableWeaponAutoSetVisibility) == 0x000030, "Wrong size on UAnimNotify_EndDisableWeaponAutoSetVisibility");

// Class EndGame.EndBizarreBugWallActor
// 0x00D8 (0x0450 - 0x0378)
class AEndBizarreBugWallActor final : public AActor
{
public:
	uint8                                         Pad_378[0x10];                                     // 0x0378(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FEndBizarreBugWallInstanceContext> InstanceContexts;                                  // 0x0388(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	float                                         SpawnCycle;                                        // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SplineMoveSpeed;                                   // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverrideFadeInTime;                                // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OverrideFadeOutTime;                               // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndBizarreBugWallMoveType                    MoveType;                                          // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Direction;                                         // 0x03AC(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BeginAnimationFrame;                               // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EndAnimationFrame;                                 // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimationFrameRate;                                // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimationPlayRate;                                 // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                       SplineComponent;                                   // 0x03C8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInstancedStaticMeshComponent*          InstancedMeshComponent;                            // 0x03D0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3D8[0x78];                                     // 0x03D8(0x0078)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Play(float BlendTime);
	void Stop(float BlendTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndBizarreBugWallActor">();
	}
	static class AEndBizarreBugWallActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AEndBizarreBugWallActor>();
	}
};
static_assert(alignof(AEndBizarreBugWallActor) == 0x000008, "Wrong alignment on AEndBizarreBugWallActor");
static_assert(sizeof(AEndBizarreBugWallActor) == 0x000450, "Wrong size on AEndBizarreBugWallActor");
static_assert(offsetof(AEndBizarreBugWallActor, InstanceContexts) == 0x000388, "Member 'AEndBizarreBugWallActor::InstanceContexts' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, SpawnCycle) == 0x000398, "Member 'AEndBizarreBugWallActor::SpawnCycle' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, SplineMoveSpeed) == 0x00039C, "Member 'AEndBizarreBugWallActor::SplineMoveSpeed' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, OverrideFadeInTime) == 0x0003A0, "Member 'AEndBizarreBugWallActor::OverrideFadeInTime' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, OverrideFadeOutTime) == 0x0003A4, "Member 'AEndBizarreBugWallActor::OverrideFadeOutTime' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, MoveType) == 0x0003A8, "Member 'AEndBizarreBugWallActor::MoveType' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, Direction) == 0x0003AC, "Member 'AEndBizarreBugWallActor::Direction' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, BeginAnimationFrame) == 0x0003B8, "Member 'AEndBizarreBugWallActor::BeginAnimationFrame' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, EndAnimationFrame) == 0x0003BC, "Member 'AEndBizarreBugWallActor::EndAnimationFrame' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, AnimationFrameRate) == 0x0003C0, "Member 'AEndBizarreBugWallActor::AnimationFrameRate' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, AnimationPlayRate) == 0x0003C4, "Member 'AEndBizarreBugWallActor::AnimationPlayRate' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, SplineComponent) == 0x0003C8, "Member 'AEndBizarreBugWallActor::SplineComponent' has a wrong offset!");
static_assert(offsetof(AEndBizarreBugWallActor, InstancedMeshComponent) == 0x0003D0, "Member 'AEndBizarreBugWallActor::InstancedMeshComponent' has a wrong offset!");

// Class EndGame.EndAIAcceptAerialRootMove
// 0x0000 (0x0030 - 0x0030)
class UEndAIAcceptAerialRootMove final : public UAnimNotifyState
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndAIAcceptAerialRootMove">();
	}
	static class UEndAIAcceptAerialRootMove* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndAIAcceptAerialRootMove>();
	}
};
static_assert(alignof(UEndAIAcceptAerialRootMove) == 0x000008, "Wrong alignment on UEndAIAcceptAerialRootMove");
static_assert(sizeof(UEndAIAcceptAerialRootMove) == 0x000030, "Wrong size on UEndAIAcceptAerialRootMove");

// Class EndGame.AnimNotify_EndEmissiveAnimationRange
// 0x0020 (0x0050 - 0x0030)
class UAnimNotify_EndEmissiveAnimationRange final : public UAnimNotifyState
{
public:
	class FName                                   ColorPaletteId;                                    // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndEmissiveModifierType                      Modifier;                                          // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEndEmissiveCurveType                         Curve;                                             // 0x0039(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration;                                          // 0x003C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0040(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x0044(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCallStopOnEnd;                                    // 0x0048(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndEmissiveAnimationRange">();
	}
	static class UAnimNotify_EndEmissiveAnimationRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndEmissiveAnimationRange>();
	}
};
static_assert(alignof(UAnimNotify_EndEmissiveAnimationRange) == 0x000008, "Wrong alignment on UAnimNotify_EndEmissiveAnimationRange");
static_assert(sizeof(UAnimNotify_EndEmissiveAnimationRange) == 0x000050, "Wrong size on UAnimNotify_EndEmissiveAnimationRange");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimationRange, ColorPaletteId) == 0x000030, "Member 'UAnimNotify_EndEmissiveAnimationRange::ColorPaletteId' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimationRange, Modifier) == 0x000038, "Member 'UAnimNotify_EndEmissiveAnimationRange::Modifier' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimationRange, Curve) == 0x000039, "Member 'UAnimNotify_EndEmissiveAnimationRange::Curve' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimationRange, Duration) == 0x00003C, "Member 'UAnimNotify_EndEmissiveAnimationRange::Duration' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimationRange, BlendInTime) == 0x000040, "Member 'UAnimNotify_EndEmissiveAnimationRange::BlendInTime' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimationRange, BlendOutTime) == 0x000044, "Member 'UAnimNotify_EndEmissiveAnimationRange::BlendOutTime' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmissiveAnimationRange, bCallStopOnEnd) == 0x000048, "Member 'UAnimNotify_EndEmissiveAnimationRange::bCallStopOnEnd' has a wrong offset!");

// Class EndGame.EndAIAvoidanceAPI
// 0x0000 (0x0028 - 0x0028)
class UEndAIAvoidanceAPI final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndAIAvoidanceAPI">();
	}
	static class UEndAIAvoidanceAPI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndAIAvoidanceAPI>();
	}
};
static_assert(alignof(UEndAIAvoidanceAPI) == 0x000008, "Wrong alignment on UEndAIAvoidanceAPI");
static_assert(sizeof(UEndAIAvoidanceAPI) == 0x000028, "Wrong size on UEndAIAvoidanceAPI");

// Class EndGame.AnimNotify_EndEmotion
// 0x0010 (0x0040 - 0x0030)
class UAnimNotify_EndEmotion final : public UAnimNotifyState
{
public:
	class FName                                   Emotion;                                           // 0x0030(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendInTime;                                       // 0x0038(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlendOutTime;                                      // 0x003C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndEmotion">();
	}
	static class UAnimNotify_EndEmotion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndEmotion>();
	}
};
static_assert(alignof(UAnimNotify_EndEmotion) == 0x000008, "Wrong alignment on UAnimNotify_EndEmotion");
static_assert(sizeof(UAnimNotify_EndEmotion) == 0x000040, "Wrong size on UAnimNotify_EndEmotion");
static_assert(offsetof(UAnimNotify_EndEmotion, Emotion) == 0x000030, "Member 'UAnimNotify_EndEmotion::Emotion' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmotion, BlendInTime) == 0x000038, "Member 'UAnimNotify_EndEmotion::BlendInTime' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEmotion, BlendOutTime) == 0x00003C, "Member 'UAnimNotify_EndEmotion::BlendOutTime' has a wrong offset!");

// Class EndGame.EndHighlightFrameWindow
// 0x0008 (0x0368 - 0x0360)
class UEndHighlightFrameWindow : public UEndUserWidget
{
public:
	uint8                                         Pad_360[0x8];                                      // 0x0360(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndHighlightFrameWindow">();
	}
	static class UEndHighlightFrameWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndHighlightFrameWindow>();
	}
};
static_assert(alignof(UEndHighlightFrameWindow) == 0x000008, "Wrong alignment on UEndHighlightFrameWindow");
static_assert(sizeof(UEndHighlightFrameWindow) == 0x000368, "Wrong size on UEndHighlightFrameWindow");

// Class EndGame.EndMainMenuWindow
// 0x00D0 (0x0430 - 0x0360)
class UEndMainMenuWindow : public UEndUserWidget
{
public:
	uint8                                         Pad_360[0xD0];                                     // 0x0360(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndMainMenuWindow">();
	}
	static class UEndMainMenuWindow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndMainMenuWindow>();
	}
};
static_assert(alignof(UEndMainMenuWindow) == 0x000008, "Wrong alignment on UEndMainMenuWindow");
static_assert(sizeof(UEndMainMenuWindow) == 0x000430, "Wrong size on UEndMainMenuWindow");

// Class EndGame.EndBattleReportMenu
// 0x0170 (0x05A0 - 0x0430)
class UEndBattleReportMenu : public UEndMainMenuWindow
{
public:
	class UEndSortWindow*                         SortList;                                          // 0x0430(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_438[0xC0];                                     // 0x0438(0x00C0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FSoftObjectPath>   _ReportImages;                                     // 0x04F8(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class FString, struct FSoftObjectPath>   _ReportBgImages;                                   // 0x0548(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnReportMenuSelectedIndexChanged(int32 CellIndex);
	void OnReportMenuSetupItem(class UWidget* ItemWidget, int32 CellIndex);
	void OnSortListPressedItem(int32 CellIndex);
	void SetReportBgImage(const struct FSoftObjectPath& Path);
	void SetReportImage(const struct FSoftObjectPath& Path);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"EndBattleReportMenu">();
	}
	static class UEndBattleReportMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEndBattleReportMenu>();
	}
};
static_assert(alignof(UEndBattleReportMenu) == 0x000008, "Wrong alignment on UEndBattleReportMenu");
static_assert(sizeof(UEndBattleReportMenu) == 0x0005A0, "Wrong size on UEndBattleReportMenu");
static_assert(offsetof(UEndBattleReportMenu, SortList) == 0x000430, "Member 'UEndBattleReportMenu::SortList' has a wrong offset!");
static_assert(offsetof(UEndBattleReportMenu, _ReportImages) == 0x0004F8, "Member 'UEndBattleReportMenu::_ReportImages' has a wrong offset!");
static_assert(offsetof(UEndBattleReportMenu, _ReportBgImages) == 0x000548, "Member 'UEndBattleReportMenu::_ReportBgImages' has a wrong offset!");

// Class EndGame.AnimNotify_EndEnableFall
// 0x0000 (0x0038 - 0x0038)
class UAnimNotify_EndEnableFall final : public UAnimNotify
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndEnableFall">();
	}
	static class UAnimNotify_EndEnableFall* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndEnableFall>();
	}
};
static_assert(alignof(UAnimNotify_EndEnableFall) == 0x000008, "Wrong alignment on UAnimNotify_EndEnableFall");
static_assert(sizeof(UAnimNotify_EndEnableFall) == 0x000038, "Wrong size on UAnimNotify_EndEnableFall");

// Class EndGame.AnimNotify_EndEnableRagdollPhysics
// 0x0038 (0x0070 - 0x0038)
class UAnimNotify_EndEnableRagdollPhysics final : public UAnimNotify
{
public:
	uint8                                         bAddImpulse : 1;                                   // 0x0038(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EEndPhysicsImpulseType                        Type;                                              // 0x003C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Impulse;                                           // 0x0040(0x000C)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyImpulseToAllBones;                           // 0x004C(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneName;                                          // 0x0050(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0058(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Strength;                                          // 0x005C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBikeUseRoadForward;                               // 0x0060(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSimpleBehaviorBodyDriverForRiders;             // 0x0061(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bBodyDriverRagdoll : 1;                            // 0x0064(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinActivationTime;                                 // 0x0068(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxActivationTime;                                 // 0x006C(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AnimNotify_EndEnableRagdollPhysics">();
	}
	static class UAnimNotify_EndEnableRagdollPhysics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_EndEnableRagdollPhysics>();
	}
};
static_assert(alignof(UAnimNotify_EndEnableRagdollPhysics) == 0x000008, "Wrong alignment on UAnimNotify_EndEnableRagdollPhysics");
static_assert(sizeof(UAnimNotify_EndEnableRagdollPhysics) == 0x000070, "Wrong size on UAnimNotify_EndEnableRagdollPhysics");
static_assert(offsetof(UAnimNotify_EndEnableRagdollPhysics, Type) == 0x00003C, "Member 'UAnimNotify_EndEnableRagdollPhysics::Type' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEnableRagdollPhysics, Impulse) == 0x000040, "Member 'UAnimNotify_EndEnableRagdollPhysics::Impulse' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEnableRagdollPhysics, bApplyImpulseToAllBones) == 0x00004C, "Member 'UAnimNotify_EndEnableRagdollPhysics::bApplyImpulseToAllBones' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEnableRagdollPhysics, BoneName) == 0x000050, "Member 'UAnimNotify_EndEnableRagdollPhysics::BoneName' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEnableRagdollPhysics, Radius) == 0x000058, "Member 'UAnimNotify_EndEnableRagdollPhysics::Radius' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEnableRagdollPhysics, Strength) == 0x00005C, "Member 'UAnimNotify_EndEnableRagdollPhysics::Strength' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEnableRagdollPhysics, bBikeUseRoadForward) == 0x000060, "Member 'UAnimNotify_EndEnableRagdollPhysics::bBikeUseRoadForward' has a wrong offset!");
static_assert(offsetof(UAnimNotify_EndEnableRagdollPhysics, bUseSimpleBehaviorBodyDriverForRiders) == 0x000061, "Member 'UAnimNotify_EndEnableRagdollPhysics::bUseSimpleBehaviorBodyDriverForRiders' has a wrong offset!");
