#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EndGame

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function EndGame.EndUserWidget.AddToOffscreen
// 0x0004 (0x0004 - 0x0000)
struct EndUserWidget_AddToOffscreen final
{
public:
	int32                                         ZOrder;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_AddToOffscreen) == 0x000004, "Wrong alignment on EndUserWidget_AddToOffscreen");
static_assert(sizeof(EndUserWidget_AddToOffscreen) == 0x000004, "Wrong size on EndUserWidget_AddToOffscreen");
static_assert(offsetof(EndUserWidget_AddToOffscreen, ZOrder) == 0x000000, "Member 'EndUserWidget_AddToOffscreen::ZOrder' has a wrong offset!");

// Function EndGame.EndUserWidget.AddToPlayerScreenEx
// 0x0008 (0x0008 - 0x0000)
struct EndUserWidget_AddToPlayerScreenEx final
{
public:
	int32                                         ZOrder;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_AddToPlayerScreenEx) == 0x000004, "Wrong alignment on EndUserWidget_AddToPlayerScreenEx");
static_assert(sizeof(EndUserWidget_AddToPlayerScreenEx) == 0x000008, "Wrong size on EndUserWidget_AddToPlayerScreenEx");
static_assert(offsetof(EndUserWidget_AddToPlayerScreenEx, ZOrder) == 0x000000, "Member 'EndUserWidget_AddToPlayerScreenEx::ZOrder' has a wrong offset!");
static_assert(offsetof(EndUserWidget_AddToPlayerScreenEx, ReturnValue) == 0x000004, "Member 'EndUserWidget_AddToPlayerScreenEx::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.AddToScene
// 0x0018 (0x0018 - 0x0000)
struct EndUserWidget_AddToScene final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotation;                                        // 0x000C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_AddToScene) == 0x000004, "Wrong alignment on EndUserWidget_AddToScene");
static_assert(sizeof(EndUserWidget_AddToScene) == 0x000018, "Wrong size on EndUserWidget_AddToScene");
static_assert(offsetof(EndUserWidget_AddToScene, InLocation) == 0x000000, "Member 'EndUserWidget_AddToScene::InLocation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_AddToScene, InRotation) == 0x00000C, "Member 'EndUserWidget_AddToScene::InRotation' has a wrong offset!");

// Function EndGame.EndUserWidget.AddToViewportEx
// 0x0004 (0x0004 - 0x0000)
struct EndUserWidget_AddToViewportEx final
{
public:
	int32                                         ZOrder;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_AddToViewportEx) == 0x000004, "Wrong alignment on EndUserWidget_AddToViewportEx");
static_assert(sizeof(EndUserWidget_AddToViewportEx) == 0x000004, "Wrong size on EndUserWidget_AddToViewportEx");
static_assert(offsetof(EndUserWidget_AddToViewportEx, ZOrder) == 0x000000, "Member 'EndUserWidget_AddToViewportEx::ZOrder' has a wrong offset!");

// Function EndGame.EndUserWidget.IsAnimationPlayingForwardByName
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_IsAnimationPlayingForwardByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_IsAnimationPlayingForwardByName) == 0x000004, "Wrong alignment on EndUserWidget_IsAnimationPlayingForwardByName");
static_assert(sizeof(EndUserWidget_IsAnimationPlayingForwardByName) == 0x00000C, "Wrong size on EndUserWidget_IsAnimationPlayingForwardByName");
static_assert(offsetof(EndUserWidget_IsAnimationPlayingForwardByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_IsAnimationPlayingForwardByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_IsAnimationPlayingForwardByName, ReturnValue) == 0x000008, "Member 'EndUserWidget_IsAnimationPlayingForwardByName::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.IsAnimationPlayingForwardEx
// 0x0010 (0x0010 - 0x0000)
struct EndUserWidget_IsAnimationPlayingForwardEx final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_IsAnimationPlayingForwardEx) == 0x000008, "Wrong alignment on EndUserWidget_IsAnimationPlayingForwardEx");
static_assert(sizeof(EndUserWidget_IsAnimationPlayingForwardEx) == 0x000010, "Wrong size on EndUserWidget_IsAnimationPlayingForwardEx");
static_assert(offsetof(EndUserWidget_IsAnimationPlayingForwardEx, InAnimation) == 0x000000, "Member 'EndUserWidget_IsAnimationPlayingForwardEx::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_IsAnimationPlayingForwardEx, ReturnValue) == 0x000008, "Member 'EndUserWidget_IsAnimationPlayingForwardEx::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.PauseAnimationByName
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_PauseAnimationByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_PauseAnimationByName) == 0x000004, "Wrong alignment on EndUserWidget_PauseAnimationByName");
static_assert(sizeof(EndUserWidget_PauseAnimationByName) == 0x00000C, "Wrong size on EndUserWidget_PauseAnimationByName");
static_assert(offsetof(EndUserWidget_PauseAnimationByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_PauseAnimationByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PauseAnimationByName, ReturnValue) == 0x000008, "Member 'EndUserWidget_PauseAnimationByName::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.PauseAnimationEx
// 0x0010 (0x0010 - 0x0000)
struct EndUserWidget_PauseAnimationEx final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_PauseAnimationEx) == 0x000008, "Wrong alignment on EndUserWidget_PauseAnimationEx");
static_assert(sizeof(EndUserWidget_PauseAnimationEx) == 0x000010, "Wrong size on EndUserWidget_PauseAnimationEx");
static_assert(offsetof(EndUserWidget_PauseAnimationEx, InAnimation) == 0x000000, "Member 'EndUserWidget_PauseAnimationEx::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PauseAnimationEx, ReturnValue) == 0x000008, "Member 'EndUserWidget_PauseAnimationEx::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.PlayAnimationByName
// 0x001C (0x001C - 0x0000)
struct EndUserWidget_PlayAnimationByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_PlayAnimationByName) == 0x000004, "Wrong alignment on EndUserWidget_PlayAnimationByName");
static_assert(sizeof(EndUserWidget_PlayAnimationByName) == 0x00001C, "Wrong size on EndUserWidget_PlayAnimationByName");
static_assert(offsetof(EndUserWidget_PlayAnimationByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_PlayAnimationByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationByName, StartAtTime) == 0x000008, "Member 'EndUserWidget_PlayAnimationByName::StartAtTime' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationByName, NumLoopsToPlay) == 0x00000C, "Member 'EndUserWidget_PlayAnimationByName::NumLoopsToPlay' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationByName, PlayMode) == 0x000010, "Member 'EndUserWidget_PlayAnimationByName::PlayMode' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationByName, PlaybackSpeed) == 0x000014, "Member 'EndUserWidget_PlayAnimationByName::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationByName, ReturnValue) == 0x000018, "Member 'EndUserWidget_PlayAnimationByName::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.PlayAnimationEx
// 0x0018 (0x0018 - 0x0000)
struct EndUserWidget_PlayAnimationEx final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_PlayAnimationEx) == 0x000008, "Wrong alignment on EndUserWidget_PlayAnimationEx");
static_assert(sizeof(EndUserWidget_PlayAnimationEx) == 0x000018, "Wrong size on EndUserWidget_PlayAnimationEx");
static_assert(offsetof(EndUserWidget_PlayAnimationEx, InAnimation) == 0x000000, "Member 'EndUserWidget_PlayAnimationEx::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationEx, StartAtTime) == 0x000008, "Member 'EndUserWidget_PlayAnimationEx::StartAtTime' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationEx, NumLoopsToPlay) == 0x00000C, "Member 'EndUserWidget_PlayAnimationEx::NumLoopsToPlay' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationEx, PlayMode) == 0x000010, "Member 'EndUserWidget_PlayAnimationEx::PlayMode' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationEx, PlaybackSpeed) == 0x000014, "Member 'EndUserWidget_PlayAnimationEx::PlaybackSpeed' has a wrong offset!");

// Function EndGame.EndUserWidget.PlayAnimationExAutoReverse
// 0x0020 (0x0020 - 0x0000)
struct EndUserWidget_PlayAnimationExAutoReverse final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReverseSpeed;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_PlayAnimationExAutoReverse) == 0x000008, "Wrong alignment on EndUserWidget_PlayAnimationExAutoReverse");
static_assert(sizeof(EndUserWidget_PlayAnimationExAutoReverse) == 0x000020, "Wrong size on EndUserWidget_PlayAnimationExAutoReverse");
static_assert(offsetof(EndUserWidget_PlayAnimationExAutoReverse, InAnimation) == 0x000000, "Member 'EndUserWidget_PlayAnimationExAutoReverse::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationExAutoReverse, StartAtTime) == 0x000008, "Member 'EndUserWidget_PlayAnimationExAutoReverse::StartAtTime' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationExAutoReverse, NumLoopsToPlay) == 0x00000C, "Member 'EndUserWidget_PlayAnimationExAutoReverse::NumLoopsToPlay' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationExAutoReverse, PlayMode) == 0x000010, "Member 'EndUserWidget_PlayAnimationExAutoReverse::PlayMode' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationExAutoReverse, PlaybackSpeed) == 0x000014, "Member 'EndUserWidget_PlayAnimationExAutoReverse::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationExAutoReverse, ReverseSpeed) == 0x000018, "Member 'EndUserWidget_PlayAnimationExAutoReverse::ReverseSpeed' has a wrong offset!");

// Function EndGame.EndUserWidget.PlayAnimationToByName
// 0x0020 (0x0020 - 0x0000)
struct EndUserWidget_PlayAnimationToByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndAtTime;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_PlayAnimationToByName) == 0x000004, "Wrong alignment on EndUserWidget_PlayAnimationToByName");
static_assert(sizeof(EndUserWidget_PlayAnimationToByName) == 0x000020, "Wrong size on EndUserWidget_PlayAnimationToByName");
static_assert(offsetof(EndUserWidget_PlayAnimationToByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_PlayAnimationToByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToByName, StartAtTime) == 0x000008, "Member 'EndUserWidget_PlayAnimationToByName::StartAtTime' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToByName, EndAtTime) == 0x00000C, "Member 'EndUserWidget_PlayAnimationToByName::EndAtTime' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToByName, NumLoopsToPlay) == 0x000010, "Member 'EndUserWidget_PlayAnimationToByName::NumLoopsToPlay' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToByName, PlayMode) == 0x000014, "Member 'EndUserWidget_PlayAnimationToByName::PlayMode' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToByName, PlaybackSpeed) == 0x000018, "Member 'EndUserWidget_PlayAnimationToByName::PlaybackSpeed' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToByName, ReturnValue) == 0x00001C, "Member 'EndUserWidget_PlayAnimationToByName::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.PlayAnimationToEx
// 0x0020 (0x0020 - 0x0000)
struct EndUserWidget_PlayAnimationToEx final
{
public:
	class UWidgetAnimation*                       InAnimation;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EndAtTime;                                         // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_PlayAnimationToEx) == 0x000008, "Wrong alignment on EndUserWidget_PlayAnimationToEx");
static_assert(sizeof(EndUserWidget_PlayAnimationToEx) == 0x000020, "Wrong size on EndUserWidget_PlayAnimationToEx");
static_assert(offsetof(EndUserWidget_PlayAnimationToEx, InAnimation) == 0x000000, "Member 'EndUserWidget_PlayAnimationToEx::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToEx, StartAtTime) == 0x000008, "Member 'EndUserWidget_PlayAnimationToEx::StartAtTime' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToEx, EndAtTime) == 0x00000C, "Member 'EndUserWidget_PlayAnimationToEx::EndAtTime' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToEx, NumLoopsToPlay) == 0x000010, "Member 'EndUserWidget_PlayAnimationToEx::NumLoopsToPlay' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToEx, PlayMode) == 0x000014, "Member 'EndUserWidget_PlayAnimationToEx::PlayMode' has a wrong offset!");
static_assert(offsetof(EndUserWidget_PlayAnimationToEx, PlaybackSpeed) == 0x000018, "Member 'EndUserWidget_PlayAnimationToEx::PlaybackSpeed' has a wrong offset!");

// Function EndGame.EndUserWidget.ReverseAnimationByName
// 0x0008 (0x0008 - 0x0000)
struct EndUserWidget_ReverseAnimationByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_ReverseAnimationByName) == 0x000004, "Wrong alignment on EndUserWidget_ReverseAnimationByName");
static_assert(sizeof(EndUserWidget_ReverseAnimationByName) == 0x000008, "Wrong size on EndUserWidget_ReverseAnimationByName");
static_assert(offsetof(EndUserWidget_ReverseAnimationByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_ReverseAnimationByName::InAnimationName' has a wrong offset!");

// Function EndGame.EndUserWidget.ReverseAnimationEx
// 0x0008 (0x0008 - 0x0000)
struct EndUserWidget_ReverseAnimationEx final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_ReverseAnimationEx) == 0x000008, "Wrong alignment on EndUserWidget_ReverseAnimationEx");
static_assert(sizeof(EndUserWidget_ReverseAnimationEx) == 0x000008, "Wrong size on EndUserWidget_ReverseAnimationEx");
static_assert(offsetof(EndUserWidget_ReverseAnimationEx, InAnimation) == 0x000000, "Member 'EndUserWidget_ReverseAnimationEx::InAnimation' has a wrong offset!");

// Function EndGame.EndUserWidget.SetFocusToChild
// 0x0010 (0x0010 - 0x0000)
struct EndUserWidget_SetFocusToChild final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFocusCause                                   InFocusCause;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_SetFocusToChild) == 0x000008, "Wrong alignment on EndUserWidget_SetFocusToChild");
static_assert(sizeof(EndUserWidget_SetFocusToChild) == 0x000010, "Wrong size on EndUserWidget_SetFocusToChild");
static_assert(offsetof(EndUserWidget_SetFocusToChild, InWidget) == 0x000000, "Member 'EndUserWidget_SetFocusToChild::InWidget' has a wrong offset!");
static_assert(offsetof(EndUserWidget_SetFocusToChild, InFocusCause) == 0x000008, "Member 'EndUserWidget_SetFocusToChild::InFocusCause' has a wrong offset!");
static_assert(offsetof(EndUserWidget_SetFocusToChild, ReturnValue) == 0x000009, "Member 'EndUserWidget_SetFocusToChild::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.SetLocationInScene
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_SetLocationInScene final
{
public:
	struct FVector                                InLocation;                                        // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_SetLocationInScene) == 0x000004, "Wrong alignment on EndUserWidget_SetLocationInScene");
static_assert(sizeof(EndUserWidget_SetLocationInScene) == 0x00000C, "Wrong size on EndUserWidget_SetLocationInScene");
static_assert(offsetof(EndUserWidget_SetLocationInScene, InLocation) == 0x000000, "Member 'EndUserWidget_SetLocationInScene::InLocation' has a wrong offset!");

// Function EndGame.EndUserWidget.SetNumLoopsToPlayByName
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_SetNumLoopsToPlayByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_SetNumLoopsToPlayByName) == 0x000004, "Wrong alignment on EndUserWidget_SetNumLoopsToPlayByName");
static_assert(sizeof(EndUserWidget_SetNumLoopsToPlayByName) == 0x00000C, "Wrong size on EndUserWidget_SetNumLoopsToPlayByName");
static_assert(offsetof(EndUserWidget_SetNumLoopsToPlayByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_SetNumLoopsToPlayByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_SetNumLoopsToPlayByName, NumLoopsToPlay) == 0x000008, "Member 'EndUserWidget_SetNumLoopsToPlayByName::NumLoopsToPlay' has a wrong offset!");

// Function EndGame.EndUserWidget.SetNumLoopsToPlayEx
// 0x0010 (0x0010 - 0x0000)
struct EndUserWidget_SetNumLoopsToPlayEx final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_SetNumLoopsToPlayEx) == 0x000008, "Wrong alignment on EndUserWidget_SetNumLoopsToPlayEx");
static_assert(sizeof(EndUserWidget_SetNumLoopsToPlayEx) == 0x000010, "Wrong size on EndUserWidget_SetNumLoopsToPlayEx");
static_assert(offsetof(EndUserWidget_SetNumLoopsToPlayEx, InAnimation) == 0x000000, "Member 'EndUserWidget_SetNumLoopsToPlayEx::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_SetNumLoopsToPlayEx, NumLoopsToPlay) == 0x000008, "Member 'EndUserWidget_SetNumLoopsToPlayEx::NumLoopsToPlay' has a wrong offset!");

// Function EndGame.EndUserWidget.SetPlaybackSpeedByName
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_SetPlaybackSpeedByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackSpeed;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_SetPlaybackSpeedByName) == 0x000004, "Wrong alignment on EndUserWidget_SetPlaybackSpeedByName");
static_assert(sizeof(EndUserWidget_SetPlaybackSpeedByName) == 0x00000C, "Wrong size on EndUserWidget_SetPlaybackSpeedByName");
static_assert(offsetof(EndUserWidget_SetPlaybackSpeedByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_SetPlaybackSpeedByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_SetPlaybackSpeedByName, PlaybackSpeed) == 0x000008, "Member 'EndUserWidget_SetPlaybackSpeedByName::PlaybackSpeed' has a wrong offset!");

// Function EndGame.EndUserWidget.SetPlaybackSpeedEx
// 0x0010 (0x0010 - 0x0000)
struct EndUserWidget_SetPlaybackSpeedEx final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlaybackSpeed;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_SetPlaybackSpeedEx) == 0x000008, "Wrong alignment on EndUserWidget_SetPlaybackSpeedEx");
static_assert(sizeof(EndUserWidget_SetPlaybackSpeedEx) == 0x000010, "Wrong size on EndUserWidget_SetPlaybackSpeedEx");
static_assert(offsetof(EndUserWidget_SetPlaybackSpeedEx, InAnimation) == 0x000000, "Member 'EndUserWidget_SetPlaybackSpeedEx::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_SetPlaybackSpeedEx, PlaybackSpeed) == 0x000008, "Member 'EndUserWidget_SetPlaybackSpeedEx::PlaybackSpeed' has a wrong offset!");

// Function EndGame.EndUserWidget.SetRotationInScene
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_SetRotationInScene final
{
public:
	struct FRotator                               InRotation;                                        // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_SetRotationInScene) == 0x000004, "Wrong alignment on EndUserWidget_SetRotationInScene");
static_assert(sizeof(EndUserWidget_SetRotationInScene) == 0x00000C, "Wrong size on EndUserWidget_SetRotationInScene");
static_assert(offsetof(EndUserWidget_SetRotationInScene, InRotation) == 0x000000, "Member 'EndUserWidget_SetRotationInScene::InRotation' has a wrong offset!");

// Function EndGame.EndUserWidget.StopAnimationByName
// 0x0008 (0x0008 - 0x0000)
struct EndUserWidget_StopAnimationByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_StopAnimationByName) == 0x000004, "Wrong alignment on EndUserWidget_StopAnimationByName");
static_assert(sizeof(EndUserWidget_StopAnimationByName) == 0x000008, "Wrong size on EndUserWidget_StopAnimationByName");
static_assert(offsetof(EndUserWidget_StopAnimationByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_StopAnimationByName::InAnimationName' has a wrong offset!");

// Function EndGame.EndUserWidget.StopAnimationEx
// 0x0008 (0x0008 - 0x0000)
struct EndUserWidget_StopAnimationEx final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_StopAnimationEx) == 0x000008, "Wrong alignment on EndUserWidget_StopAnimationEx");
static_assert(sizeof(EndUserWidget_StopAnimationEx) == 0x000008, "Wrong size on EndUserWidget_StopAnimationEx");
static_assert(offsetof(EndUserWidget_StopAnimationEx, InAnimation) == 0x000000, "Member 'EndUserWidget_StopAnimationEx::InAnimation' has a wrong offset!");

// Function EndGame.EndUserWidget.GetAnimationCurrentTimeByName
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_GetAnimationCurrentTimeByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_GetAnimationCurrentTimeByName) == 0x000004, "Wrong alignment on EndUserWidget_GetAnimationCurrentTimeByName");
static_assert(sizeof(EndUserWidget_GetAnimationCurrentTimeByName) == 0x00000C, "Wrong size on EndUserWidget_GetAnimationCurrentTimeByName");
static_assert(offsetof(EndUserWidget_GetAnimationCurrentTimeByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_GetAnimationCurrentTimeByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_GetAnimationCurrentTimeByName, ReturnValue) == 0x000008, "Member 'EndUserWidget_GetAnimationCurrentTimeByName::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.GetAnimationCurrentTimeEx
// 0x0010 (0x0010 - 0x0000)
struct EndUserWidget_GetAnimationCurrentTimeEx final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_GetAnimationCurrentTimeEx) == 0x000008, "Wrong alignment on EndUserWidget_GetAnimationCurrentTimeEx");
static_assert(sizeof(EndUserWidget_GetAnimationCurrentTimeEx) == 0x000010, "Wrong size on EndUserWidget_GetAnimationCurrentTimeEx");
static_assert(offsetof(EndUserWidget_GetAnimationCurrentTimeEx, InAnimation) == 0x000000, "Member 'EndUserWidget_GetAnimationCurrentTimeEx::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_GetAnimationCurrentTimeEx, ReturnValue) == 0x000008, "Member 'EndUserWidget_GetAnimationCurrentTimeEx::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.GetAnimationEndTimeByName
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_GetAnimationEndTimeByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_GetAnimationEndTimeByName) == 0x000004, "Wrong alignment on EndUserWidget_GetAnimationEndTimeByName");
static_assert(sizeof(EndUserWidget_GetAnimationEndTimeByName) == 0x00000C, "Wrong size on EndUserWidget_GetAnimationEndTimeByName");
static_assert(offsetof(EndUserWidget_GetAnimationEndTimeByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_GetAnimationEndTimeByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_GetAnimationEndTimeByName, ReturnValue) == 0x000008, "Member 'EndUserWidget_GetAnimationEndTimeByName::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.GetAnimationStartTimeByName
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_GetAnimationStartTimeByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_GetAnimationStartTimeByName) == 0x000004, "Wrong alignment on EndUserWidget_GetAnimationStartTimeByName");
static_assert(sizeof(EndUserWidget_GetAnimationStartTimeByName) == 0x00000C, "Wrong size on EndUserWidget_GetAnimationStartTimeByName");
static_assert(offsetof(EndUserWidget_GetAnimationStartTimeByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_GetAnimationStartTimeByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_GetAnimationStartTimeByName, ReturnValue) == 0x000008, "Member 'EndUserWidget_GetAnimationStartTimeByName::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.GetFocusedChildWidget
// 0x0008 (0x0008 - 0x0000)
struct EndUserWidget_GetFocusedChildWidget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_GetFocusedChildWidget) == 0x000008, "Wrong alignment on EndUserWidget_GetFocusedChildWidget");
static_assert(sizeof(EndUserWidget_GetFocusedChildWidget) == 0x000008, "Wrong size on EndUserWidget_GetFocusedChildWidget");
static_assert(offsetof(EndUserWidget_GetFocusedChildWidget, ReturnValue) == 0x000000, "Member 'EndUserWidget_GetFocusedChildWidget::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.GetLocationInScene
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_GetLocationInScene final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_GetLocationInScene) == 0x000004, "Wrong alignment on EndUserWidget_GetLocationInScene");
static_assert(sizeof(EndUserWidget_GetLocationInScene) == 0x00000C, "Wrong size on EndUserWidget_GetLocationInScene");
static_assert(offsetof(EndUserWidget_GetLocationInScene, ReturnValue) == 0x000000, "Member 'EndUserWidget_GetLocationInScene::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.GetRotationInScene
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_GetRotationInScene final
{
public:
	struct FRotator                               ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_GetRotationInScene) == 0x000004, "Wrong alignment on EndUserWidget_GetRotationInScene");
static_assert(sizeof(EndUserWidget_GetRotationInScene) == 0x00000C, "Wrong size on EndUserWidget_GetRotationInScene");
static_assert(offsetof(EndUserWidget_GetRotationInScene, ReturnValue) == 0x000000, "Member 'EndUserWidget_GetRotationInScene::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.GetZOrderInViewport
// 0x0004 (0x0004 - 0x0000)
struct EndUserWidget_GetZOrderInViewport final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_GetZOrderInViewport) == 0x000004, "Wrong alignment on EndUserWidget_GetZOrderInViewport");
static_assert(sizeof(EndUserWidget_GetZOrderInViewport) == 0x000004, "Wrong size on EndUserWidget_GetZOrderInViewport");
static_assert(offsetof(EndUserWidget_GetZOrderInViewport, ReturnValue) == 0x000000, "Member 'EndUserWidget_GetZOrderInViewport::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.IsAnimationPlayingByName
// 0x000C (0x000C - 0x0000)
struct EndUserWidget_IsAnimationPlayingByName final
{
public:
	class FName                                   InAnimationName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_IsAnimationPlayingByName) == 0x000004, "Wrong alignment on EndUserWidget_IsAnimationPlayingByName");
static_assert(sizeof(EndUserWidget_IsAnimationPlayingByName) == 0x00000C, "Wrong size on EndUserWidget_IsAnimationPlayingByName");
static_assert(offsetof(EndUserWidget_IsAnimationPlayingByName, InAnimationName) == 0x000000, "Member 'EndUserWidget_IsAnimationPlayingByName::InAnimationName' has a wrong offset!");
static_assert(offsetof(EndUserWidget_IsAnimationPlayingByName, ReturnValue) == 0x000008, "Member 'EndUserWidget_IsAnimationPlayingByName::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.IsAnimationPlayingEx
// 0x0010 (0x0010 - 0x0000)
struct EndUserWidget_IsAnimationPlayingEx final
{
public:
	const class UWidgetAnimation*                 InAnimation;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndUserWidget_IsAnimationPlayingEx) == 0x000008, "Wrong alignment on EndUserWidget_IsAnimationPlayingEx");
static_assert(sizeof(EndUserWidget_IsAnimationPlayingEx) == 0x000010, "Wrong size on EndUserWidget_IsAnimationPlayingEx");
static_assert(offsetof(EndUserWidget_IsAnimationPlayingEx, InAnimation) == 0x000000, "Member 'EndUserWidget_IsAnimationPlayingEx::InAnimation' has a wrong offset!");
static_assert(offsetof(EndUserWidget_IsAnimationPlayingEx, ReturnValue) == 0x000008, "Member 'EndUserWidget_IsAnimationPlayingEx::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.IsAnyAnimationPlayingEx
// 0x0001 (0x0001 - 0x0000)
struct EndUserWidget_IsAnyAnimationPlayingEx final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_IsAnyAnimationPlayingEx) == 0x000001, "Wrong alignment on EndUserWidget_IsAnyAnimationPlayingEx");
static_assert(sizeof(EndUserWidget_IsAnyAnimationPlayingEx) == 0x000001, "Wrong size on EndUserWidget_IsAnyAnimationPlayingEx");
static_assert(offsetof(EndUserWidget_IsAnyAnimationPlayingEx, ReturnValue) == 0x000000, "Member 'EndUserWidget_IsAnyAnimationPlayingEx::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.IsInViewportEx
// 0x0001 (0x0001 - 0x0000)
struct EndUserWidget_IsInViewportEx final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_IsInViewportEx) == 0x000001, "Wrong alignment on EndUserWidget_IsInViewportEx");
static_assert(sizeof(EndUserWidget_IsInViewportEx) == 0x000001, "Wrong size on EndUserWidget_IsInViewportEx");
static_assert(offsetof(EndUserWidget_IsInViewportEx, ReturnValue) == 0x000000, "Member 'EndUserWidget_IsInViewportEx::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.IsPlayingAnimationEx
// 0x0001 (0x0001 - 0x0000)
struct EndUserWidget_IsPlayingAnimationEx final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_IsPlayingAnimationEx) == 0x000001, "Wrong alignment on EndUserWidget_IsPlayingAnimationEx");
static_assert(sizeof(EndUserWidget_IsPlayingAnimationEx) == 0x000001, "Wrong size on EndUserWidget_IsPlayingAnimationEx");
static_assert(offsetof(EndUserWidget_IsPlayingAnimationEx, ReturnValue) == 0x000000, "Member 'EndUserWidget_IsPlayingAnimationEx::ReturnValue' has a wrong offset!");

// Function EndGame.EndUserWidget.IsPlayingAnimationIgnoreStopped
// 0x0001 (0x0001 - 0x0000)
struct EndUserWidget_IsPlayingAnimationIgnoreStopped final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndUserWidget_IsPlayingAnimationIgnoreStopped) == 0x000001, "Wrong alignment on EndUserWidget_IsPlayingAnimationIgnoreStopped");
static_assert(sizeof(EndUserWidget_IsPlayingAnimationIgnoreStopped) == 0x000001, "Wrong size on EndUserWidget_IsPlayingAnimationIgnoreStopped");
static_assert(offsetof(EndUserWidget_IsPlayingAnimationIgnoreStopped, ReturnValue) == 0x000000, "Member 'EndUserWidget_IsPlayingAnimationIgnoreStopped::ReturnValue' has a wrong offset!");

// Function EndGame.EndBattleDamageSourceComponent.GetDir
// 0x000C (0x000C - 0x0000)
struct EndBattleDamageSourceComponent_GetDir final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndBattleDamageSourceComponent_GetDir) == 0x000004, "Wrong alignment on EndBattleDamageSourceComponent_GetDir");
static_assert(sizeof(EndBattleDamageSourceComponent_GetDir) == 0x00000C, "Wrong size on EndBattleDamageSourceComponent_GetDir");
static_assert(offsetof(EndBattleDamageSourceComponent_GetDir, ReturnValue) == 0x000000, "Member 'EndBattleDamageSourceComponent_GetDir::ReturnValue' has a wrong offset!");

// Function EndGame.EndMainSaveLoadMenu.OnSaveDataPressedItem
// 0x0004 (0x0004 - 0x0000)
struct EndMainSaveLoadMenu_OnSaveDataPressedItem final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndMainSaveLoadMenu_OnSaveDataPressedItem) == 0x000004, "Wrong alignment on EndMainSaveLoadMenu_OnSaveDataPressedItem");
static_assert(sizeof(EndMainSaveLoadMenu_OnSaveDataPressedItem) == 0x000004, "Wrong size on EndMainSaveLoadMenu_OnSaveDataPressedItem");
static_assert(offsetof(EndMainSaveLoadMenu_OnSaveDataPressedItem, ItemIndex) == 0x000000, "Member 'EndMainSaveLoadMenu_OnSaveDataPressedItem::ItemIndex' has a wrong offset!");

// Function EndGame.EndMainSaveLoadMenu.OnSaveDataSelectedIndexChanged
// 0x0004 (0x0004 - 0x0000)
struct EndMainSaveLoadMenu_OnSaveDataSelectedIndexChanged final
{
public:
	int32                                         ItemIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndMainSaveLoadMenu_OnSaveDataSelectedIndexChanged) == 0x000004, "Wrong alignment on EndMainSaveLoadMenu_OnSaveDataSelectedIndexChanged");
static_assert(sizeof(EndMainSaveLoadMenu_OnSaveDataSelectedIndexChanged) == 0x000004, "Wrong size on EndMainSaveLoadMenu_OnSaveDataSelectedIndexChanged");
static_assert(offsetof(EndMainSaveLoadMenu_OnSaveDataSelectedIndexChanged, ItemIndex) == 0x000000, "Member 'EndMainSaveLoadMenu_OnSaveDataSelectedIndexChanged::ItemIndex' has a wrong offset!");

// Function EndGame.EndMainSaveLoadMenu.OnSaveDataSetupItem
// 0x0010 (0x0010 - 0x0000)
struct EndMainSaveLoadMenu_OnSaveDataSetupItem final
{
public:
	class UWidget*                                ItemWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ItemIndex;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndMainSaveLoadMenu_OnSaveDataSetupItem) == 0x000008, "Wrong alignment on EndMainSaveLoadMenu_OnSaveDataSetupItem");
static_assert(sizeof(EndMainSaveLoadMenu_OnSaveDataSetupItem) == 0x000010, "Wrong size on EndMainSaveLoadMenu_OnSaveDataSetupItem");
static_assert(offsetof(EndMainSaveLoadMenu_OnSaveDataSetupItem, ItemWidget) == 0x000000, "Member 'EndMainSaveLoadMenu_OnSaveDataSetupItem::ItemWidget' has a wrong offset!");
static_assert(offsetof(EndMainSaveLoadMenu_OnSaveDataSetupItem, ItemIndex) == 0x000008, "Member 'EndMainSaveLoadMenu_OnSaveDataSetupItem::ItemIndex' has a wrong offset!");

// Function EndGame.EndBikeTriggerBoxResetPhysActor.BeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct EndBikeTriggerBoxResetPhysActor_BeginOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndBikeTriggerBoxResetPhysActor_BeginOverlap) == 0x000008, "Wrong alignment on EndBikeTriggerBoxResetPhysActor_BeginOverlap");
static_assert(sizeof(EndBikeTriggerBoxResetPhysActor_BeginOverlap) == 0x000010, "Wrong size on EndBikeTriggerBoxResetPhysActor_BeginOverlap");
static_assert(offsetof(EndBikeTriggerBoxResetPhysActor_BeginOverlap, OverlappedActor) == 0x000000, "Member 'EndBikeTriggerBoxResetPhysActor_BeginOverlap::OverlappedActor' has a wrong offset!");
static_assert(offsetof(EndBikeTriggerBoxResetPhysActor_BeginOverlap, OtherActor) == 0x000008, "Member 'EndBikeTriggerBoxResetPhysActor_BeginOverlap::OtherActor' has a wrong offset!");

// Function EndGame.EndBizarreBugWallActor.Play
// 0x0004 (0x0004 - 0x0000)
struct EndBizarreBugWallActor_Play final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndBizarreBugWallActor_Play) == 0x000004, "Wrong alignment on EndBizarreBugWallActor_Play");
static_assert(sizeof(EndBizarreBugWallActor_Play) == 0x000004, "Wrong size on EndBizarreBugWallActor_Play");
static_assert(offsetof(EndBizarreBugWallActor_Play, BlendTime) == 0x000000, "Member 'EndBizarreBugWallActor_Play::BlendTime' has a wrong offset!");

// Function EndGame.EndBizarreBugWallActor.Stop
// 0x0004 (0x0004 - 0x0000)
struct EndBizarreBugWallActor_Stop final
{
public:
	float                                         BlendTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndBizarreBugWallActor_Stop) == 0x000004, "Wrong alignment on EndBizarreBugWallActor_Stop");
static_assert(sizeof(EndBizarreBugWallActor_Stop) == 0x000004, "Wrong size on EndBizarreBugWallActor_Stop");
static_assert(offsetof(EndBizarreBugWallActor_Stop, BlendTime) == 0x000000, "Member 'EndBizarreBugWallActor_Stop::BlendTime' has a wrong offset!");

// Function EndGame.EndBattleReportMenu.OnReportMenuSelectedIndexChanged
// 0x0004 (0x0004 - 0x0000)
struct EndBattleReportMenu_OnReportMenuSelectedIndexChanged final
{
public:
	int32                                         CellIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(EndBattleReportMenu_OnReportMenuSelectedIndexChanged) == 0x000004, "Wrong alignment on EndBattleReportMenu_OnReportMenuSelectedIndexChanged");
static_assert(sizeof(EndBattleReportMenu_OnReportMenuSelectedIndexChanged) == 0x000004, "Wrong size on EndBattleReportMenu_OnReportMenuSelectedIndexChanged");
static_assert(offsetof(EndBattleReportMenu_OnReportMenuSelectedIndexChanged, CellIndex) == 0x000000, "Member 'EndBattleReportMenu_OnReportMenuSelectedIndexChanged::CellIndex' has a wrong offset!");

// Function EndGame.EndBattleReportMenu.OnReportMenuSetupItem
// 0x0010 (0x0010 - 0x0000)
struct EndBattleReportMenu_OnReportMenuSetupItem final
{
public:
	class UWidget*                                ItemWidget;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CellIndex;                                         // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(EndBattleReportMenu_OnReportMenuSetupItem) == 0x000008, "Wrong alignment on EndBattleReportMenu_OnReportMenuSetupItem");
static_assert(sizeof(EndBattleReportMenu_OnReportMenuSetupItem) == 0x000010, "Wrong size on EndBattleReportMenu_OnReportMenuSetupItem");
static_assert(offsetof(EndBattleReportMenu_OnReportMenuSetupItem, ItemWidget) == 0x000000, "Member 'EndBattleReportMenu_OnReportMenuSetupItem::ItemWidget' has a wrong offset!");
static_assert(offsetof(EndBattleReportMenu_OnReportMenuSetupItem, CellIndex) == 0x000008, "Member 'EndBattleReportMenu_OnReportMenuSetupItem::CellIndex' has a wrong offset!");

// Function EndGame.EndBattleReportMenu.OnSortListPressedItem
// 0x0004 (0x0004 - 0x0000)
struct EndBattleReportMenu_OnSortListPressedItem final
{
public:
