#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Escape

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Escape.Escape_C
// 0x0090 (0x03F0 - 0x0360)
class UEscape_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Escaped_Out;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_Escape;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             All_Nut_Escape;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_03;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_04;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_05;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_06;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_BaseSequence;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Txt;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_BaseSequence;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Escape;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Escaping;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Escape_C">();
	}
	static class UEscape_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEscape_C>();
	}
};
static_assert(alignof(UEscape_C) == 0x000008, "Wrong alignment on UEscape_C");
static_assert(sizeof(UEscape_C) == 0x0003F0, "Wrong size on UEscape_C");
static_assert(offsetof(UEscape_C, Escaped_Out) == 0x000360, "Member 'UEscape_C::Escaped_Out' has a wrong offset!");
static_assert(offsetof(UEscape_C, Out) == 0x000368, "Member 'UEscape_C::Out' has a wrong offset!");
static_assert(offsetof(UEscape_C, Loop) == 0x000370, "Member 'UEscape_C::Loop' has a wrong offset!");
static_assert(offsetof(UEscape_C, In) == 0x000378, "Member 'UEscape_C::In' has a wrong offset!");
static_assert(offsetof(UEscape_C, All_Escape) == 0x000380, "Member 'UEscape_C::All_Escape' has a wrong offset!");
static_assert(offsetof(UEscape_C, All_Nut_Escape) == 0x000388, "Member 'UEscape_C::All_Nut_Escape' has a wrong offset!");
static_assert(offsetof(UEscape_C, Img_Effect_00) == 0x000390, "Member 'UEscape_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UEscape_C, Img_Effect_01) == 0x000398, "Member 'UEscape_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UEscape_C, Img_Effect_02) == 0x0003A0, "Member 'UEscape_C::Img_Effect_02' has a wrong offset!");
static_assert(offsetof(UEscape_C, Img_Effect_03) == 0x0003A8, "Member 'UEscape_C::Img_Effect_03' has a wrong offset!");
static_assert(offsetof(UEscape_C, Img_Effect_04) == 0x0003B0, "Member 'UEscape_C::Img_Effect_04' has a wrong offset!");
static_assert(offsetof(UEscape_C, Img_Effect_05) == 0x0003B8, "Member 'UEscape_C::Img_Effect_05' has a wrong offset!");
static_assert(offsetof(UEscape_C, Img_Effect_06) == 0x0003C0, "Member 'UEscape_C::Img_Effect_06' has a wrong offset!");
static_assert(offsetof(UEscape_C, Nut_BaseSequence) == 0x0003C8, "Member 'UEscape_C::Nut_BaseSequence' has a wrong offset!");
static_assert(offsetof(UEscape_C, Nut_Txt) == 0x0003D0, "Member 'UEscape_C::Nut_Txt' has a wrong offset!");
static_assert(offsetof(UEscape_C, Pnl_BaseSequence) == 0x0003D8, "Member 'UEscape_C::Pnl_BaseSequence' has a wrong offset!");
static_assert(offsetof(UEscape_C, Pnl_Escape) == 0x0003E0, "Member 'UEscape_C::Pnl_Escape' has a wrong offset!");
static_assert(offsetof(UEscape_C, Txt_Escaping) == 0x0003E8, "Member 'UEscape_C::Txt_Escaping' has a wrong offset!");

}

