#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EventProgress_01

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass EventProgress_01.EventProgress_01_C
// 0x0048 (0x03A8 - 0x0360)
class UEventProgress_01_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       TargetDiscovered_Color;                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BattleReport_Color;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SubQuest_Color;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SideStory_Color;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Effect_00;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"EventProgress_01_C">();
	}
	static class UEventProgress_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEventProgress_01_C>();
	}
};
static_assert(alignof(UEventProgress_01_C) == 0x000008, "Wrong alignment on UEventProgress_01_C");
static_assert(sizeof(UEventProgress_01_C) == 0x0003A8, "Wrong size on UEventProgress_01_C");
static_assert(offsetof(UEventProgress_01_C, TargetDiscovered_Color) == 0x000360, "Member 'UEventProgress_01_C::TargetDiscovered_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, BattleReport_Color) == 0x000368, "Member 'UEventProgress_01_C::BattleReport_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, SubQuest_Color) == 0x000370, "Member 'UEventProgress_01_C::SubQuest_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, SideStory_Color) == 0x000378, "Member 'UEventProgress_01_C::SideStory_Color' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Out) == 0x000380, "Member 'UEventProgress_01_C::Out' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, In) == 0x000388, "Member 'UEventProgress_01_C::In' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Img_BG) == 0x000390, "Member 'UEventProgress_01_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Img_Line) == 0x000398, "Member 'UEventProgress_01_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UEventProgress_01_C, Ims_Effect_00) == 0x0003A0, "Member 'UEventProgress_01_C::Ims_Effect_00' has a wrong offset!");

}

