#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FA0052_00_Dummy_Standard_Animation

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FA0052_00_Dummy_Standard_Animation.FA0052_00_Dummy_Standard_Animation_C
// 0x0130 (0x18B0 - 0x1780)
class UFA0052_00_Dummy_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_8777BF8546E3B6BDCBA30EB2478C21F2; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_EE2345A9410F94C8934464A2670A8708; // 0x17D0(0x0068)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_6BCEA5564243FCDB91EDBBBC6DD72F63; // 0x1838(0x0030)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_A65399B34E0E5970527C67A335A49889; // 0x1868(0x0048)()

public:
	void ExecuteUbergraph_FA0052_00_Dummy_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FA0052_00_Dummy_Standard_Animation_C">();
	}
	static class UFA0052_00_Dummy_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFA0052_00_Dummy_Standard_Animation_C>();
	}
};
static_assert(alignof(UFA0052_00_Dummy_Standard_Animation_C) == 0x000008, "Wrong alignment on UFA0052_00_Dummy_Standard_Animation_C");
static_assert(sizeof(UFA0052_00_Dummy_Standard_Animation_C) == 0x0018B0, "Wrong size on UFA0052_00_Dummy_Standard_Animation_C");
static_assert(offsetof(UFA0052_00_Dummy_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UFA0052_00_Dummy_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFA0052_00_Dummy_Standard_Animation_C, AnimGraphNode_Root_8777BF8546E3B6BDCBA30EB2478C21F2) == 0x001788, "Member 'UFA0052_00_Dummy_Standard_Animation_C::AnimGraphNode_Root_8777BF8546E3B6BDCBA30EB2478C21F2' has a wrong offset!");
static_assert(offsetof(UFA0052_00_Dummy_Standard_Animation_C, AnimGraphNode_Slot_EE2345A9410F94C8934464A2670A8708) == 0x0017D0, "Member 'UFA0052_00_Dummy_Standard_Animation_C::AnimGraphNode_Slot_EE2345A9410F94C8934464A2670A8708' has a wrong offset!");
static_assert(offsetof(UFA0052_00_Dummy_Standard_Animation_C, AnimGraphNode_EndBehavior_6BCEA5564243FCDB91EDBBBC6DD72F63) == 0x001838, "Member 'UFA0052_00_Dummy_Standard_Animation_C::AnimGraphNode_EndBehavior_6BCEA5564243FCDB91EDBBBC6DD72F63' has a wrong offset!");
static_assert(offsetof(UFA0052_00_Dummy_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_A65399B34E0E5970527C67A335A49889) == 0x001868, "Member 'UFA0052_00_Dummy_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_A65399B34E0E5970527C67A335A49889' has a wrong offset!");

}

