#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FA0021_00_Jenovabody_Standard_Animation

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass FA0021_00_Jenovabody_Standard_Animation.FA0021_00_Jenovabody_Standard_Animation_C
// 0x0130 (0x18B0 - 0x1780)
class UFA0021_00_Jenovabody_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_290146B843E273A5E1047E8BEC65A7D1; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DD7CA5D84EC95145465847B17A7E2C45; // 0x17D0(0x0068)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_7FE509064AAF0585631365BAADF49373; // 0x1838(0x0030)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_C8D5A5C74EEEEF92D9AD38954B504B83; // 0x1868(0x0048)()

public:
	void ExecuteUbergraph_FA0021_00_Jenovabody_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FA0021_00_Jenovabody_Standard_Animation_C">();
	}
	static class UFA0021_00_Jenovabody_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFA0021_00_Jenovabody_Standard_Animation_C>();
	}
};
static_assert(alignof(UFA0021_00_Jenovabody_Standard_Animation_C) == 0x000008, "Wrong alignment on UFA0021_00_Jenovabody_Standard_Animation_C");
static_assert(sizeof(UFA0021_00_Jenovabody_Standard_Animation_C) == 0x0018B0, "Wrong size on UFA0021_00_Jenovabody_Standard_Animation_C");
static_assert(offsetof(UFA0021_00_Jenovabody_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UFA0021_00_Jenovabody_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFA0021_00_Jenovabody_Standard_Animation_C, AnimGraphNode_Root_290146B843E273A5E1047E8BEC65A7D1) == 0x001788, "Member 'UFA0021_00_Jenovabody_Standard_Animation_C::AnimGraphNode_Root_290146B843E273A5E1047E8BEC65A7D1' has a wrong offset!");
static_assert(offsetof(UFA0021_00_Jenovabody_Standard_Animation_C, AnimGraphNode_Slot_DD7CA5D84EC95145465847B17A7E2C45) == 0x0017D0, "Member 'UFA0021_00_Jenovabody_Standard_Animation_C::AnimGraphNode_Slot_DD7CA5D84EC95145465847B17A7E2C45' has a wrong offset!");
static_assert(offsetof(UFA0021_00_Jenovabody_Standard_Animation_C, AnimGraphNode_EndBehavior_7FE509064AAF0585631365BAADF49373) == 0x001838, "Member 'UFA0021_00_Jenovabody_Standard_Animation_C::AnimGraphNode_EndBehavior_7FE509064AAF0585631365BAADF49373' has a wrong offset!");
static_assert(offsetof(UFA0021_00_Jenovabody_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_C8D5A5C74EEEEF92D9AD38954B504B83) == 0x001868, "Member 'UFA0021_00_Jenovabody_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_C8D5A5C74EEEEF92D9AD38954B504B83' has a wrong offset!");

}

