#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldTargetSearch_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldTargetSearch_02.FieldTargetSearch_02_C
// 0x0028 (0x0388 - 0x0360)
class UFieldTargetSearch_02_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_InLine;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_OutLine;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_FieldTargetSearch_02(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldTargetSearch_02_C">();
	}
	static class UFieldTargetSearch_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldTargetSearch_02_C>();
	}
};
static_assert(alignof(UFieldTargetSearch_02_C) == 0x000008, "Wrong alignment on UFieldTargetSearch_02_C");
static_assert(sizeof(UFieldTargetSearch_02_C) == 0x000388, "Wrong size on UFieldTargetSearch_02_C");
static_assert(offsetof(UFieldTargetSearch_02_C, UberGraphFrame) == 0x000360, "Member 'UFieldTargetSearch_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_C, In) == 0x000368, "Member 'UFieldTargetSearch_02_C::In' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_C, Loop) == 0x000370, "Member 'UFieldTargetSearch_02_C::Loop' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_C, Ims_InLine) == 0x000378, "Member 'UFieldTargetSearch_02_C::Ims_InLine' has a wrong offset!");
static_assert(offsetof(UFieldTargetSearch_02_C, Ims_OutLine) == 0x000380, "Member 'UFieldTargetSearch_02_C::Ims_OutLine' has a wrong offset!");

}

