#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldTarget_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldTarget_01.FieldTarget_01_C
// 0x01B0 (0x0520 - 0x0370)
class UFieldTarget_01_C final : public UEndFieldTargetIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Color_Shift;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hold_Effect_Triangle;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Effect_Triangle;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Effect_Square;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hold_In;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       On2_In;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_In;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Off_In;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NG_In;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hold_Loop;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       On2_Loop;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       On_Loop;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Off_Loop;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NG_Loop;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Gauge_Hold;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gauge_Hold_01;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gauge_On2_01;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Gauge_On_01;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Btn_Hold;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Btn_On;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Btn_On2;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hold_00;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hold_01;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hold_02;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Hold_03;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hold_Effect_00;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hold_Effect_01;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hold_Effect_02;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hold_Effect_03;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_NG_00;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_NG_01;                                         // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_NG_02;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On2_00;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On2_01;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On2_02;                                        // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On2_03;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On2_04;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_On2_05;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_00;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_01;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_02;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_S00;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_S01;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_S02;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_S03;                                 // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_S04;                                 // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_T00;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_T01;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_T02;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_On_Effect_T03;                                 // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Off_00;                                        // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_On_03;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_FieldTarget_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldTarget_01_C">();
	}
	static class UFieldTarget_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldTarget_01_C>();
	}
};
static_assert(alignof(UFieldTarget_01_C) == 0x000008, "Wrong alignment on UFieldTarget_01_C");
static_assert(sizeof(UFieldTarget_01_C) == 0x000520, "Wrong size on UFieldTarget_01_C");
static_assert(offsetof(UFieldTarget_01_C, UberGraphFrame) == 0x000370, "Member 'UFieldTarget_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Color_Shift) == 0x000378, "Member 'UFieldTarget_01_C::Color_Shift' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Hold_Effect_Triangle) == 0x000380, "Member 'UFieldTarget_01_C::Hold_Effect_Triangle' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, On_Effect_Triangle) == 0x000388, "Member 'UFieldTarget_01_C::On_Effect_Triangle' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, On_Effect_Square) == 0x000390, "Member 'UFieldTarget_01_C::On_Effect_Square' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Hold_In) == 0x000398, "Member 'UFieldTarget_01_C::Hold_In' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, On2_In) == 0x0003A0, "Member 'UFieldTarget_01_C::On2_In' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, On_In) == 0x0003A8, "Member 'UFieldTarget_01_C::On_In' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Off_In) == 0x0003B0, "Member 'UFieldTarget_01_C::Off_In' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, NG_In) == 0x0003B8, "Member 'UFieldTarget_01_C::NG_In' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Hold_Loop) == 0x0003C0, "Member 'UFieldTarget_01_C::Hold_Loop' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, On2_Loop) == 0x0003C8, "Member 'UFieldTarget_01_C::On2_Loop' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, On_Loop) == 0x0003D0, "Member 'UFieldTarget_01_C::On_Loop' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Off_Loop) == 0x0003D8, "Member 'UFieldTarget_01_C::Off_Loop' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, NG_Loop) == 0x0003E0, "Member 'UFieldTarget_01_C::NG_Loop' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, EndImage_0) == 0x0003E8, "Member 'UFieldTarget_01_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Gauge_Hold) == 0x0003F0, "Member 'UFieldTarget_01_C::Gauge_Hold' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Gauge_Hold_01) == 0x0003F8, "Member 'UFieldTarget_01_C::Gauge_Hold_01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Gauge_On2_01) == 0x000400, "Member 'UFieldTarget_01_C::Gauge_On2_01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Gauge_On_01) == 0x000408, "Member 'UFieldTarget_01_C::Gauge_On_01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Icon_Btn_Hold) == 0x000410, "Member 'UFieldTarget_01_C::Icon_Btn_Hold' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Icon_Btn_On) == 0x000418, "Member 'UFieldTarget_01_C::Icon_Btn_On' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Icon_Btn_On2) == 0x000420, "Member 'UFieldTarget_01_C::Icon_Btn_On2' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_Hold_00) == 0x000428, "Member 'UFieldTarget_01_C::Img_Hold_00' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_Hold_01) == 0x000430, "Member 'UFieldTarget_01_C::Img_Hold_01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_Hold_02) == 0x000438, "Member 'UFieldTarget_01_C::Img_Hold_02' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_Hold_03) == 0x000440, "Member 'UFieldTarget_01_C::Img_Hold_03' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_Hold_Effect_00) == 0x000448, "Member 'UFieldTarget_01_C::Img_Hold_Effect_00' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_Hold_Effect_01) == 0x000450, "Member 'UFieldTarget_01_C::Img_Hold_Effect_01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_Hold_Effect_02) == 0x000458, "Member 'UFieldTarget_01_C::Img_Hold_Effect_02' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_Hold_Effect_03) == 0x000460, "Member 'UFieldTarget_01_C::Img_Hold_Effect_03' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_NG_00) == 0x000468, "Member 'UFieldTarget_01_C::Img_NG_00' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_NG_01) == 0x000470, "Member 'UFieldTarget_01_C::Img_NG_01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_NG_02) == 0x000478, "Member 'UFieldTarget_01_C::Img_NG_02' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On2_00) == 0x000480, "Member 'UFieldTarget_01_C::Img_On2_00' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On2_01) == 0x000488, "Member 'UFieldTarget_01_C::Img_On2_01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On2_02) == 0x000490, "Member 'UFieldTarget_01_C::Img_On2_02' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On2_03) == 0x000498, "Member 'UFieldTarget_01_C::Img_On2_03' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On2_04) == 0x0004A0, "Member 'UFieldTarget_01_C::Img_On2_04' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On2_05) == 0x0004A8, "Member 'UFieldTarget_01_C::Img_On2_05' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_00) == 0x0004B0, "Member 'UFieldTarget_01_C::Img_On_00' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_01) == 0x0004B8, "Member 'UFieldTarget_01_C::Img_On_01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_02) == 0x0004C0, "Member 'UFieldTarget_01_C::Img_On_02' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_S00) == 0x0004C8, "Member 'UFieldTarget_01_C::Img_On_Effect_S00' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_S01) == 0x0004D0, "Member 'UFieldTarget_01_C::Img_On_Effect_S01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_S02) == 0x0004D8, "Member 'UFieldTarget_01_C::Img_On_Effect_S02' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_S03) == 0x0004E0, "Member 'UFieldTarget_01_C::Img_On_Effect_S03' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_S04) == 0x0004E8, "Member 'UFieldTarget_01_C::Img_On_Effect_S04' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_T00) == 0x0004F0, "Member 'UFieldTarget_01_C::Img_On_Effect_T00' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_T01) == 0x0004F8, "Member 'UFieldTarget_01_C::Img_On_Effect_T01' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_T02) == 0x000500, "Member 'UFieldTarget_01_C::Img_On_Effect_T02' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Img_On_Effect_T03) == 0x000508, "Member 'UFieldTarget_01_C::Img_On_Effect_T03' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Ims_Off_00) == 0x000510, "Member 'UFieldTarget_01_C::Ims_Off_00' has a wrong offset!");
static_assert(offsetof(UFieldTarget_01_C, Ims_On_03) == 0x000518, "Member 'UFieldTarget_01_C::Ims_On_03' has a wrong offset!");

}

