#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FieldAction_Command

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FieldAction_Command.FieldAction_Command_C
// 0x0058 (0x03B8 - 0x0360)
class UFieldAction_Command_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       CommandOpen;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Running;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shift;                                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Pressed;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Search;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_00;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FieldAction_Command_C">();
	}
	static class UFieldAction_Command_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFieldAction_Command_C>();
	}
};
static_assert(alignof(UFieldAction_Command_C) == 0x000008, "Wrong alignment on UFieldAction_Command_C");
static_assert(sizeof(UFieldAction_Command_C) == 0x0003B8, "Wrong size on UFieldAction_Command_C");
static_assert(offsetof(UFieldAction_Command_C, CommandOpen) == 0x000360, "Member 'UFieldAction_Command_C::CommandOpen' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, In) == 0x000368, "Member 'UFieldAction_Command_C::In' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Running) == 0x000370, "Member 'UFieldAction_Command_C::Running' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Shift) == 0x000378, "Member 'UFieldAction_Command_C::Shift' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Pressed) == 0x000380, "Member 'UFieldAction_Command_C::Pressed' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Icon_Search) == 0x000388, "Member 'UFieldAction_Command_C::Icon_Search' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Base_00) == 0x000390, "Member 'UFieldAction_Command_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Base_01) == 0x000398, "Member 'UFieldAction_Command_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Effect_00) == 0x0003A0, "Member 'UFieldAction_Command_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Effect_01) == 0x0003A8, "Member 'UFieldAction_Command_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UFieldAction_Command_C, Img_Effect_02) == 0x0003B0, "Member 'UFieldAction_Command_C::Img_Effect_02' has a wrong offset!");

}

