#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gauge_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Gauge_Cell.Gauge_Cell_C
// 0x0138 (0x0920 - 0x07E8)
class UGauge_Cell_C final : public UEndMenuStatusPaneCell
{
public:
	class UWidgetAnimation*                       Slow_Loop;                                         // 0x07E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Haste_Loop;                                        // 0x07F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BattleField_Shift2;                                // 0x07F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CommandOpen;                                       // 0x0800(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BattleField_Shift;                                 // 0x0808(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MemberLeft;                                        // 0x0810(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MemberJoin;                                        // 0x0818(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_Nut_Gauge_List;                                // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UATBGauge_C*                            ATBGauge;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ATBGauge_Effect_00;                                // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCooperation_Effect_C*                  Cooperation_Effect;                                // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_HP;                                          // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_Limit;                                       // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_MP;                                          // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_BattleLeader;                                 // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_00;                                    // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_01;                                    // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_02;                                    // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_03;                                    // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_04;                                    // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Status_C*                         Icon_Status_05;                                    // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_StatusSimple_C*                   Icon_StatusSimple_00;                              // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_StatusSimple_C*                   Icon_StatusSimple_01;                              // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_HP_Gauge_BG;                                   // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Limit_Gauge_BG;                                // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_MP_Gauge_BG;                                   // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatus_LimitEffect_00_C*               LimitEffect_00;                                    // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatus_LimitEffect_01_C*               LimitEffect_01;                                    // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStatus_JoinEffect_C*                   Status_JoinEffect;                                 // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ATB;                                           // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          txt_hp;                                            // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HP_MaxNum;                                     // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HP_Num;                                        // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Limit;                                         // 0x0900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MP;                                            // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MP_Num;                                        // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name;                                          // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Gauge_Cell_C">();
	}
	static class UGauge_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGauge_Cell_C>();
	}
};
static_assert(alignof(UGauge_Cell_C) == 0x000008, "Wrong alignment on UGauge_Cell_C");
static_assert(sizeof(UGauge_Cell_C) == 0x000920, "Wrong size on UGauge_Cell_C");
static_assert(offsetof(UGauge_Cell_C, Slow_Loop) == 0x0007E8, "Member 'UGauge_Cell_C::Slow_Loop' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Haste_Loop) == 0x0007F0, "Member 'UGauge_Cell_C::Haste_Loop' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, BattleField_Shift2) == 0x0007F8, "Member 'UGauge_Cell_C::BattleField_Shift2' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, CommandOpen) == 0x000800, "Member 'UGauge_Cell_C::CommandOpen' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, BattleField_Shift) == 0x000808, "Member 'UGauge_Cell_C::BattleField_Shift' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, MemberLeft) == 0x000810, "Member 'UGauge_Cell_C::MemberLeft' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, MemberJoin) == 0x000818, "Member 'UGauge_Cell_C::MemberJoin' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, All_Nut_Gauge_List) == 0x000820, "Member 'UGauge_Cell_C::All_Nut_Gauge_List' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, ATBGauge) == 0x000828, "Member 'UGauge_Cell_C::ATBGauge' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, ATBGauge_Effect_00) == 0x000830, "Member 'UGauge_Cell_C::ATBGauge_Effect_00' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Cooperation_Effect) == 0x000838, "Member 'UGauge_Cell_C::Cooperation_Effect' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Gauge_HP) == 0x000840, "Member 'UGauge_Cell_C::Gauge_HP' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Gauge_Limit) == 0x000848, "Member 'UGauge_Cell_C::Gauge_Limit' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Gauge_MP) == 0x000850, "Member 'UGauge_Cell_C::Gauge_MP' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_BattleLeader) == 0x000858, "Member 'UGauge_Cell_C::Icon_BattleLeader' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_Status_00) == 0x000860, "Member 'UGauge_Cell_C::Icon_Status_00' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_Status_01) == 0x000868, "Member 'UGauge_Cell_C::Icon_Status_01' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_Status_02) == 0x000870, "Member 'UGauge_Cell_C::Icon_Status_02' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_Status_03) == 0x000878, "Member 'UGauge_Cell_C::Icon_Status_03' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_Status_04) == 0x000880, "Member 'UGauge_Cell_C::Icon_Status_04' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_Status_05) == 0x000888, "Member 'UGauge_Cell_C::Icon_Status_05' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_StatusSimple_00) == 0x000890, "Member 'UGauge_Cell_C::Icon_StatusSimple_00' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Icon_StatusSimple_01) == 0x000898, "Member 'UGauge_Cell_C::Icon_StatusSimple_01' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Img_Base_00) == 0x0008A0, "Member 'UGauge_Cell_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Img_Base_01) == 0x0008A8, "Member 'UGauge_Cell_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Img_HP_Gauge_BG) == 0x0008B0, "Member 'UGauge_Cell_C::Img_HP_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Img_Limit_Gauge_BG) == 0x0008B8, "Member 'UGauge_Cell_C::Img_Limit_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Img_MP_Gauge_BG) == 0x0008C0, "Member 'UGauge_Cell_C::Img_MP_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, LimitEffect_00) == 0x0008C8, "Member 'UGauge_Cell_C::LimitEffect_00' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, LimitEffect_01) == 0x0008D0, "Member 'UGauge_Cell_C::LimitEffect_01' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Status_JoinEffect) == 0x0008D8, "Member 'UGauge_Cell_C::Status_JoinEffect' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Txt_ATB) == 0x0008E0, "Member 'UGauge_Cell_C::Txt_ATB' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, txt_hp) == 0x0008E8, "Member 'UGauge_Cell_C::txt_hp' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Txt_HP_MaxNum) == 0x0008F0, "Member 'UGauge_Cell_C::Txt_HP_MaxNum' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Txt_HP_Num) == 0x0008F8, "Member 'UGauge_Cell_C::Txt_HP_Num' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Txt_Limit) == 0x000900, "Member 'UGauge_Cell_C::Txt_Limit' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Txt_MP) == 0x000908, "Member 'UGauge_Cell_C::Txt_MP' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Txt_MP_Num) == 0x000910, "Member 'UGauge_Cell_C::Txt_MP_Num' has a wrong offset!");
static_assert(offsetof(UGauge_Cell_C, Txt_Name) == 0x000918, "Member 'UGauge_Cell_C::Txt_Name' has a wrong offset!");

}

