#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Icon_NaviMap

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Icon_NaviMap.Icon_NaviMap_C
// 0x0028 (0x0440 - 0x0418)
class UIcon_NaviMap_C final : public UEndNaviMapIcon
{
public:
	class UWidgetAnimation*                       EnemyIcon_Out;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       EnemyIcon_In;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayerIcon_Out;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PlayerIcon_In;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           All_Nut_Icon_NaviMap;                              // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Icon_NaviMap_C">();
	}
	static class UIcon_NaviMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIcon_NaviMap_C>();
	}
};
static_assert(alignof(UIcon_NaviMap_C) == 0x000008, "Wrong alignment on UIcon_NaviMap_C");
static_assert(sizeof(UIcon_NaviMap_C) == 0x000440, "Wrong size on UIcon_NaviMap_C");
static_assert(offsetof(UIcon_NaviMap_C, EnemyIcon_Out) == 0x000418, "Member 'UIcon_NaviMap_C::EnemyIcon_Out' has a wrong offset!");
static_assert(offsetof(UIcon_NaviMap_C, EnemyIcon_In) == 0x000420, "Member 'UIcon_NaviMap_C::EnemyIcon_In' has a wrong offset!");
static_assert(offsetof(UIcon_NaviMap_C, PlayerIcon_Out) == 0x000428, "Member 'UIcon_NaviMap_C::PlayerIcon_Out' has a wrong offset!");
static_assert(offsetof(UIcon_NaviMap_C, PlayerIcon_In) == 0x000430, "Member 'UIcon_NaviMap_C::PlayerIcon_In' has a wrong offset!");
static_assert(offsetof(UIcon_NaviMap_C, All_Nut_Icon_NaviMap) == 0x000438, "Member 'UIcon_NaviMap_C::All_Nut_Icon_NaviMap' has a wrong offset!");

}

