#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Icon_Status

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Icon_Status.Icon_Status_C
// 0x0018 (0x0378 - 0x0360)
class UIcon_Status_C final : public UEndUserWidget
{
public:
	class UEndImageSet*                           All_Nut_Icon_Status;                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Gauge_Time;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Resistances;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Icon_Status_C">();
	}
	static class UIcon_Status_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIcon_Status_C>();
	}
};
static_assert(alignof(UIcon_Status_C) == 0x000008, "Wrong alignment on UIcon_Status_C");
static_assert(sizeof(UIcon_Status_C) == 0x000378, "Wrong size on UIcon_Status_C");
static_assert(offsetof(UIcon_Status_C, All_Nut_Icon_Status) == 0x000360, "Member 'UIcon_Status_C::All_Nut_Icon_Status' has a wrong offset!");
static_assert(offsetof(UIcon_Status_C, Gauge_Time) == 0x000368, "Member 'UIcon_Status_C::Gauge_Time' has a wrong offset!");
static_assert(offsetof(UIcon_Status_C, Icon_Resistances) == 0x000370, "Member 'UIcon_Status_C::Icon_Resistances' has a wrong offset!");

}

