#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KBDRt

#include "Basic.hpp"


namespace SDK
{

// Enum KBDRt.ESQEX_Bonamik_AlterBodyParamTarget
// NumValues: 0x0006
enum class ESQEX_Bonamik_AlterBodyParamTarget : uint8
{
	ESQEX_Bonamik_AlterBodyParamTarget_Mass  = 0,
	ESQEX_Bonamik_AlterBodyParamTarget_Damping = 2,
	ESQEX_Bonamik_AlterBodyParamTarget_Friction = 1,
	ESQEX_Bonamik_AlterBodyParamTarget_Bounciness = 3,
	Num                                      = 4,
	ESQEX_Bonamik_MAX                        = 5,
};

// Enum KBDRt.ESQEX_Bonamik_AlterLinkParamTarget
// NumValues: 0x0008
enum class ESQEX_Bonamik_AlterLinkParamTarget : uint8
{
	ESQEX_Bonamik_AlterLinkParamTarget_Strength = 13,
	ESQEX_Bonamik_AlterLinkParamTarget_ConeLimit = 14,
	ESQEX_Bonamik_AlterLinkParamTarget_ConeOffset = 15,
	ESQEX_Bonamik_AlterLinkParamTarget_ConeLimitOffset = 16,
	ESQEX_Bonamik_AlterLinkParamTarget_InnerConeStr = 11,
	ESQEX_Bonamik_AlterLinkParamTarget_OuterConeStr = 12,
	Num                                      = 13,
	ESQEX_Bonamik_MAX                        = 17,
};

// Enum KBDRt.ESQEX_Bonamik_ScaleBodyParamTarget
// NumValues: 0x0007
enum class ESQEX_Bonamik_ScaleBodyParamTarget : uint8
{
	ESQEX_Bonamik_ScaleBodyParamTarget_Mass  = 0,
	ESQEX_Bonamik_ScaleBodyParamTarget_Damping = 2,
	ESQEX_Bonamik_ScaleBodyParamTarget_Friction = 1,
	ESQEX_Bonamik_ScaleBodyParamTarget_Bounciness = 3,
	ESQEX_Bonamik_ScaleBodyParamTarget_ShapeSize = 17,
	Num                                      = 18,
	ESQEX_Bonamik_MAX                        = 19,
};

// Enum KBDRt.ESQEX_Bonamik_ScaleLinkParamTarget
// NumValues: 0x0008
enum class ESQEX_Bonamik_ScaleLinkParamTarget : uint8
{
	ESQEX_Bonamik_ScaleLinkParamTarget_Strength = 13,
	ESQEX_Bonamik_ScaleLinkParamTarget_ConeLimit = 14,
	ESQEX_Bonamik_ScaleLinkParamTarget_ConeOffset = 15,
	ESQEX_Bonamik_ScaleLinkParamTarget_ConeLimitOffset = 16,
	ESQEX_Bonamik_ScaleLinkParamTarget_InnerConeStr = 11,
	ESQEX_Bonamik_ScaleLinkParamTarget_OuterConeStr = 12,
	Num                                      = 13,
	ESQEX_Bonamik_MAX                        = 17,
};

// ScriptStruct KBDRt.SQEX_Bonamik_AlterBodyParameter
// 0x0008 (0x0008 - 0x0000)
struct FSQEX_Bonamik_AlterBodyParameter final
{
public:
	ESQEX_Bonamik_AlterBodyParamTarget            m_Target;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_Value;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_Bonamik_AlterBodyParameter) == 0x000004, "Wrong alignment on FSQEX_Bonamik_AlterBodyParameter");
static_assert(sizeof(FSQEX_Bonamik_AlterBodyParameter) == 0x000008, "Wrong size on FSQEX_Bonamik_AlterBodyParameter");
static_assert(offsetof(FSQEX_Bonamik_AlterBodyParameter, m_Target) == 0x000000, "Member 'FSQEX_Bonamik_AlterBodyParameter::m_Target' has a wrong offset!");
static_assert(offsetof(FSQEX_Bonamik_AlterBodyParameter, m_Value) == 0x000004, "Member 'FSQEX_Bonamik_AlterBodyParameter::m_Value' has a wrong offset!");

// ScriptStruct KBDRt.SQEX_Bonamik_AlterLinkParameter
// 0x000C (0x000C - 0x0000)
struct FSQEX_Bonamik_AlterLinkParameter final
{
public:
	ESQEX_Bonamik_AlterLinkParamTarget            m_Target;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_ValueA;                                          // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         m_ValueB;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_Bonamik_AlterLinkParameter) == 0x000004, "Wrong alignment on FSQEX_Bonamik_AlterLinkParameter");
static_assert(sizeof(FSQEX_Bonamik_AlterLinkParameter) == 0x00000C, "Wrong size on FSQEX_Bonamik_AlterLinkParameter");
static_assert(offsetof(FSQEX_Bonamik_AlterLinkParameter, m_Target) == 0x000000, "Member 'FSQEX_Bonamik_AlterLinkParameter::m_Target' has a wrong offset!");
static_assert(offsetof(FSQEX_Bonamik_AlterLinkParameter, m_ValueA) == 0x000004, "Member 'FSQEX_Bonamik_AlterLinkParameter::m_ValueA' has a wrong offset!");
static_assert(offsetof(FSQEX_Bonamik_AlterLinkParameter, m_ValueB) == 0x000008, "Member 'FSQEX_Bonamik_AlterLinkParameter::m_ValueB' has a wrong offset!");

// ScriptStruct KBDRt.SQEX_Bonamik_ScaleBodyParameter
// 0x0008 (0x0008 - 0x0000)
struct FSQEX_Bonamik_ScaleBodyParameter final
{
public:
	ESQEX_Bonamik_ScaleBodyParamTarget            m_Target;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_Magnification;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_Bonamik_ScaleBodyParameter) == 0x000004, "Wrong alignment on FSQEX_Bonamik_ScaleBodyParameter");
static_assert(sizeof(FSQEX_Bonamik_ScaleBodyParameter) == 0x000008, "Wrong size on FSQEX_Bonamik_ScaleBodyParameter");
static_assert(offsetof(FSQEX_Bonamik_ScaleBodyParameter, m_Target) == 0x000000, "Member 'FSQEX_Bonamik_ScaleBodyParameter::m_Target' has a wrong offset!");
static_assert(offsetof(FSQEX_Bonamik_ScaleBodyParameter, m_Magnification) == 0x000004, "Member 'FSQEX_Bonamik_ScaleBodyParameter::m_Magnification' has a wrong offset!");

// ScriptStruct KBDRt.SQEX_Bonamik_ScaleLinkParameter
// 0x0008 (0x0008 - 0x0000)
struct FSQEX_Bonamik_ScaleLinkParameter final
{
public:
	ESQEX_Bonamik_ScaleLinkParamTarget            m_Target;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_Magnification;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSQEX_Bonamik_ScaleLinkParameter) == 0x000004, "Wrong alignment on FSQEX_Bonamik_ScaleLinkParameter");
static_assert(sizeof(FSQEX_Bonamik_ScaleLinkParameter) == 0x000008, "Wrong size on FSQEX_Bonamik_ScaleLinkParameter");
static_assert(offsetof(FSQEX_Bonamik_ScaleLinkParameter, m_Target) == 0x000000, "Member 'FSQEX_Bonamik_ScaleLinkParameter::m_Target' has a wrong offset!");
static_assert(offsetof(FSQEX_Bonamik_ScaleLinkParameter, m_Magnification) == 0x000004, "Member 'FSQEX_Bonamik_ScaleLinkParameter::m_Magnification' has a wrong offset!");

}

