#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LocationName

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LocationName.LocationName_C
// 0x0058 (0x03B8 - 0x0360)
class ULocationName_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Main;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Sub;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Com_Effect;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLight;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Main;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Sub;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LocationName_C">();
	}
	static class ULocationName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULocationName_C>();
	}
};
static_assert(alignof(ULocationName_C) == 0x000008, "Wrong alignment on ULocationName_C");
static_assert(sizeof(ULocationName_C) == 0x0003B8, "Wrong size on ULocationName_C");
static_assert(offsetof(ULocationName_C, Out) == 0x000360, "Member 'ULocationName_C::Out' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Loop) == 0x000368, "Member 'ULocationName_C::Loop' has a wrong offset!");
static_assert(offsetof(ULocationName_C, In) == 0x000370, "Member 'ULocationName_C::In' has a wrong offset!");
static_assert(offsetof(ULocationName_C, EndImage_0) == 0x000378, "Member 'ULocationName_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Img_Base_Main) == 0x000380, "Member 'ULocationName_C::Img_Base_Main' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Img_Base_Sub) == 0x000388, "Member 'ULocationName_C::Img_Base_Sub' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Img_Com_Effect) == 0x000390, "Member 'ULocationName_C::Img_Com_Effect' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Img_Line) == 0x000398, "Member 'ULocationName_C::Img_Line' has a wrong offset!");
static_assert(offsetof(ULocationName_C, TitleLight) == 0x0003A0, "Member 'ULocationName_C::TitleLight' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Txt_Main) == 0x0003A8, "Member 'ULocationName_C::Txt_Main' has a wrong offset!");
static_assert(offsetof(ULocationName_C, Txt_Sub) == 0x0003B0, "Member 'ULocationName_C::Txt_Sub' has a wrong offset!");

}

