#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LockOnMarker

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LockOnMarker.LockOnMarker_C
// 0x00D0 (0x0440 - 0x0370)
class ULockOnMarker_C final : public UEndBattleLockonMarkerIcon
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_00;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_01;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_02;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_03;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_ArrowEffect_00;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_ArrowEffect_01;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_ArrowEffect_02;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_ArrowEffect_03;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Circle_00;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Circle_01;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Circle_02;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Circle_03;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Circle_04;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Circle_05;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Circle_06;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Circle_07;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Focus_00;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Focus_01;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Focus_02;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Focus_Square;                                  // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Line_00;                                       // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Line_01;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              U_SearchScope_Effect_00;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LockOnMarker_C">();
	}
	static class ULockOnMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULockOnMarker_C>();
	}
};
static_assert(alignof(ULockOnMarker_C) == 0x000008, "Wrong alignment on ULockOnMarker_C");
static_assert(sizeof(ULockOnMarker_C) == 0x000440, "Wrong size on ULockOnMarker_C");
static_assert(offsetof(ULockOnMarker_C, Out) == 0x000370, "Member 'ULockOnMarker_C::Out' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Loop) == 0x000378, "Member 'ULockOnMarker_C::Loop' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, In) == 0x000380, "Member 'ULockOnMarker_C::In' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Arrow_00) == 0x000388, "Member 'ULockOnMarker_C::Img_Arrow_00' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Arrow_01) == 0x000390, "Member 'ULockOnMarker_C::Img_Arrow_01' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Arrow_02) == 0x000398, "Member 'ULockOnMarker_C::Img_Arrow_02' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Arrow_03) == 0x0003A0, "Member 'ULockOnMarker_C::Img_Arrow_03' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_ArrowEffect_00) == 0x0003A8, "Member 'ULockOnMarker_C::Img_ArrowEffect_00' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_ArrowEffect_01) == 0x0003B0, "Member 'ULockOnMarker_C::Img_ArrowEffect_01' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_ArrowEffect_02) == 0x0003B8, "Member 'ULockOnMarker_C::Img_ArrowEffect_02' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_ArrowEffect_03) == 0x0003C0, "Member 'ULockOnMarker_C::Img_ArrowEffect_03' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Circle_00) == 0x0003C8, "Member 'ULockOnMarker_C::Img_Circle_00' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Circle_01) == 0x0003D0, "Member 'ULockOnMarker_C::Img_Circle_01' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Circle_02) == 0x0003D8, "Member 'ULockOnMarker_C::Img_Circle_02' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Circle_03) == 0x0003E0, "Member 'ULockOnMarker_C::Img_Circle_03' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Circle_04) == 0x0003E8, "Member 'ULockOnMarker_C::Img_Circle_04' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Circle_05) == 0x0003F0, "Member 'ULockOnMarker_C::Img_Circle_05' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Circle_06) == 0x0003F8, "Member 'ULockOnMarker_C::Img_Circle_06' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Circle_07) == 0x000400, "Member 'ULockOnMarker_C::Img_Circle_07' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Focus_00) == 0x000408, "Member 'ULockOnMarker_C::Img_Focus_00' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Focus_01) == 0x000410, "Member 'ULockOnMarker_C::Img_Focus_01' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Focus_02) == 0x000418, "Member 'ULockOnMarker_C::Img_Focus_02' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Focus_Square) == 0x000420, "Member 'ULockOnMarker_C::Img_Focus_Square' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Line_00) == 0x000428, "Member 'ULockOnMarker_C::Img_Line_00' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, Img_Line_01) == 0x000430, "Member 'ULockOnMarker_C::Img_Line_01' has a wrong offset!");
static_assert(offsetof(ULockOnMarker_C, U_SearchScope_Effect_00) == 0x000438, "Member 'ULockOnMarker_C::U_SearchScope_Effect_00' has a wrong offset!");

}

