#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EnemyReport_Detail

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EnemyReport_Detail.MainMenu_EnemyReport_Detail_C
// 0x0070 (0x03D0 - 0x0360)
class UMainMenu_EnemyReport_Detail_C final : public UEndUserWidget
{
public:
	class UEndImage*                              EndImage_0;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left_Line;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Right_Line;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Title_Icon;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AreaTitle;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LogTitle;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Number;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ReportTitle;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          txt_type;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EnemyReport_Detail_C">();
	}
	static class UMainMenu_EnemyReport_Detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EnemyReport_Detail_C>();
	}
};
static_assert(alignof(UMainMenu_EnemyReport_Detail_C) == 0x000008, "Wrong alignment on UMainMenu_EnemyReport_Detail_C");
static_assert(sizeof(UMainMenu_EnemyReport_Detail_C) == 0x0003D0, "Wrong size on UMainMenu_EnemyReport_Detail_C");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, EndImage_0) == 0x000360, "Member 'UMainMenu_EnemyReport_Detail_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, EndImage_4) == 0x000368, "Member 'UMainMenu_EnemyReport_Detail_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, IconLeft) == 0x000370, "Member 'UMainMenu_EnemyReport_Detail_C::IconLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, IconRight) == 0x000378, "Member 'UMainMenu_EnemyReport_Detail_C::IconRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Left_Line) == 0x000380, "Member 'UMainMenu_EnemyReport_Detail_C::Left_Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Line1) == 0x000388, "Member 'UMainMenu_EnemyReport_Detail_C::Line1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Line2) == 0x000390, "Member 'UMainMenu_EnemyReport_Detail_C::Line2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Right_Line) == 0x000398, "Member 'UMainMenu_EnemyReport_Detail_C::Right_Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Title_Icon) == 0x0003A0, "Member 'UMainMenu_EnemyReport_Detail_C::Title_Icon' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Txt_AreaTitle) == 0x0003A8, "Member 'UMainMenu_EnemyReport_Detail_C::Txt_AreaTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Txt_LogTitle) == 0x0003B0, "Member 'UMainMenu_EnemyReport_Detail_C::Txt_LogTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Txt_Number) == 0x0003B8, "Member 'UMainMenu_EnemyReport_Detail_C::Txt_Number' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, Txt_ReportTitle) == 0x0003C0, "Member 'UMainMenu_EnemyReport_Detail_C::Txt_ReportTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Detail_C, txt_type) == 0x0003C8, "Member 'UMainMenu_EnemyReport_Detail_C::txt_type' has a wrong offset!");

}

