#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_BattleReport_Window

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_BattleReport_Window.MainMenu_BattleReport_Window_C
// 0x0050 (0x03B0 - 0x0360)
class UMainMenu_BattleReport_Window_C final : public UEndUserWidget
{
public:
	class UEndImage*                              BgLine;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame4;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame5;                                            // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightBg01;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_BattleReport_Detail_C*        MainMenu_BattleReport_Detail;                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WindowBase;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_BattleReport_Window_C">();
	}
	static class UMainMenu_BattleReport_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_BattleReport_Window_C>();
	}
};
static_assert(alignof(UMainMenu_BattleReport_Window_C) == 0x000008, "Wrong alignment on UMainMenu_BattleReport_Window_C");
static_assert(sizeof(UMainMenu_BattleReport_Window_C) == 0x0003B0, "Wrong size on UMainMenu_BattleReport_Window_C");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, BgLine) == 0x000360, "Member 'UMainMenu_BattleReport_Window_C::BgLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, Billboard_Bg) == 0x000368, "Member 'UMainMenu_BattleReport_Window_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, EndImage_2) == 0x000370, "Member 'UMainMenu_BattleReport_Window_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, EndImage_3) == 0x000378, "Member 'UMainMenu_BattleReport_Window_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, Frame2) == 0x000380, "Member 'UMainMenu_BattleReport_Window_C::Frame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, Frame4) == 0x000388, "Member 'UMainMenu_BattleReport_Window_C::Frame4' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, Frame5) == 0x000390, "Member 'UMainMenu_BattleReport_Window_C::Frame5' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, LightBg01) == 0x000398, "Member 'UMainMenu_BattleReport_Window_C::LightBg01' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, MainMenu_BattleReport_Detail) == 0x0003A0, "Member 'UMainMenu_BattleReport_Window_C::MainMenu_BattleReport_Detail' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleReport_Window_C, WindowBase) == 0x0003A8, "Member 'UMainMenu_BattleReport_Window_C::WindowBase' has a wrong offset!");

}

