#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_Btn4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_Btn4.MainMenu_Options_Btn4_C
// 0x00C0 (0x0420 - 0x0360)
class UMainMenu_Options_Btn4_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLeft;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Key1;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Key2;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_Key3;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBaseRight;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterLight;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_Bottom;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_Top;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Bg;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Key1;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Key2;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Key3;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Category;                                // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MainMenu_Options_Btn4(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_Btn4_C">();
	}
	static class UMainMenu_Options_Btn4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_Btn4_C>();
	}
};
static_assert(alignof(UMainMenu_Options_Btn4_C) == 0x000008, "Wrong alignment on UMainMenu_Options_Btn4_C");
static_assert(sizeof(UMainMenu_Options_Btn4_C) == 0x000420, "Wrong size on UMainMenu_Options_Btn4_C");
static_assert(offsetof(UMainMenu_Options_Btn4_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_Options_Btn4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BtnHover) == 0x000368, "Member 'UMainMenu_Options_Btn4_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Selected) == 0x000370, "Member 'UMainMenu_Options_Btn4_C::Selected' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Loop) == 0x000378, "Member 'UMainMenu_Options_Btn4_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Menu_In) == 0x000380, "Member 'UMainMenu_Options_Btn4_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Base) == 0x000388, "Member 'UMainMenu_Options_Btn4_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Base2) == 0x000390, "Member 'UMainMenu_Options_Btn4_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BaseLeft) == 0x000398, "Member 'UMainMenu_Options_Btn4_C::BaseLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Btn_Key1) == 0x0003A0, "Member 'UMainMenu_Options_Btn4_C::Btn_Key1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Btn_Key2) == 0x0003A8, "Member 'UMainMenu_Options_Btn4_C::Btn_Key2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Btn_Key3) == 0x0003B0, "Member 'UMainMenu_Options_Btn4_C::Btn_Key3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BtnBaseRight) == 0x0003B8, "Member 'UMainMenu_Options_Btn4_C::BtnBaseRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, BtnHoverBase) == 0x0003C0, "Member 'UMainMenu_Options_Btn4_C::BtnHoverBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, CenterLight) == 0x0003C8, "Member 'UMainMenu_Options_Btn4_C::CenterLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Dot_Bottom) == 0x0003D0, "Member 'UMainMenu_Options_Btn4_C::Dot_Bottom' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Dot_Top) == 0x0003D8, "Member 'UMainMenu_Options_Btn4_C::Dot_Top' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, EndImage_0) == 0x0003E0, "Member 'UMainMenu_Options_Btn4_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Frame) == 0x0003E8, "Member 'UMainMenu_Options_Btn4_C::Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Title_Bg) == 0x0003F0, "Member 'UMainMenu_Options_Btn4_C::Title_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Key1) == 0x0003F8, "Member 'UMainMenu_Options_Btn4_C::Txt_Key1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Key2) == 0x000400, "Member 'UMainMenu_Options_Btn4_C::Txt_Key2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Key3) == 0x000408, "Member 'UMainMenu_Options_Btn4_C::Txt_Key3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Title) == 0x000410, "Member 'UMainMenu_Options_Btn4_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Btn4_C, Txt_Title_Category) == 0x000418, "Member 'UMainMenu_Options_Btn4_C::Txt_Title_Category' has a wrong offset!");

}

