#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaQuick

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainMenu_MateriaQuick.MainMenu_MateriaQuick_C.ExecuteUbergraph_MainMenu_MateriaQuick
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue2;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick) == 0x000004, "Wrong alignment on MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick");
static_assert(sizeof(MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick) == 0x000008, "Wrong size on MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick");
static_assert(offsetof(MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick, EntryPoint) == 0x000000, "Member 'MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick, CallFunc_PlayAnimationByName_ReturnValue2) == 0x000005, "Member 'MainMenu_MateriaQuick_C_ExecuteUbergraph_MainMenu_MateriaQuick::CallFunc_PlayAnimationByName_ReturnValue2' has a wrong offset!");

}

