#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Item_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Item_Cell.MainMenu_Item_Cell_C
// 0x0050 (0x03B0 - 0x0360)
class UMainMenu_Item_Cell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Cell_Light2_C*                Cell_Lighting;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Item;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Item_Cell(int32 EntryPoint);
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Item_Cell_C">();
	}
	static class UMainMenu_Item_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Item_Cell_C>();
	}
};
static_assert(alignof(UMainMenu_Item_Cell_C) == 0x000008, "Wrong alignment on UMainMenu_Item_Cell_C");
static_assert(sizeof(UMainMenu_Item_Cell_C) == 0x0003B0, "Wrong size on UMainMenu_Item_Cell_C");
static_assert(offsetof(UMainMenu_Item_Cell_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_Item_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, BtnHover) == 0x000368, "Member 'UMainMenu_Item_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, Menu_In) == 0x000370, "Member 'UMainMenu_Item_Cell_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, BtnHoverBase) == 0x000378, "Member 'UMainMenu_Item_Cell_C::BtnHoverBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, BtnLight) == 0x000380, "Member 'UMainMenu_Item_Cell_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, Cell_Lighting) == 0x000388, "Member 'UMainMenu_Item_Cell_C::Cell_Lighting' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, Icon_Item) == 0x000390, "Member 'UMainMenu_Item_Cell_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, MainMenu_Btn) == 0x000398, "Member 'UMainMenu_Item_Cell_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, Shadow) == 0x0003A0, "Member 'UMainMenu_Item_Cell_C::Shadow' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_Cell_C, Txt_Title) == 0x0003A8, "Member 'UMainMenu_Item_Cell_C::Txt_Title' has a wrong offset!");

}

