#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EnemyReport_ListItem

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EnemyReport_ListItem.MainMenu_EnemyReport_ListItem_C
// 0x0020 (0x03B0 - 0x0390)
class UMainMenu_EnemyReport_ListItem_C final : public UEndMainItemSelectBtnText
{
public:
	class UEndImage*                              Base;                                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Area;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Log;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LogCount;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EnemyReport_ListItem_C">();
	}
	static class UMainMenu_EnemyReport_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EnemyReport_ListItem_C>();
	}
};
static_assert(alignof(UMainMenu_EnemyReport_ListItem_C) == 0x000008, "Wrong alignment on UMainMenu_EnemyReport_ListItem_C");
static_assert(sizeof(UMainMenu_EnemyReport_ListItem_C) == 0x0003B0, "Wrong size on UMainMenu_EnemyReport_ListItem_C");
static_assert(offsetof(UMainMenu_EnemyReport_ListItem_C, Base) == 0x000390, "Member 'UMainMenu_EnemyReport_ListItem_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_ListItem_C, Txt_Area) == 0x000398, "Member 'UMainMenu_EnemyReport_ListItem_C::Txt_Area' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_ListItem_C, Txt_Log) == 0x0003A0, "Member 'UMainMenu_EnemyReport_ListItem_C::Txt_Log' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_ListItem_C, Txt_LogCount) == 0x0003A8, "Member 'UMainMenu_EnemyReport_ListItem_C::Txt_LogCount' has a wrong offset!");

}

