#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_Display2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_Display2.MainMenu_Options_Display2_C
// 0x0048 (0x03A8 - 0x0360)
class UMainMenu_Options_Display2_C final : public UEndUserWidget
{
public:
	class UEndPieImage*                           Arrow_Left;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           Arrow_Right;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Black;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Frame;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_White;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Black;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Gauge_Head;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_White;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Setting;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_Display2_C">();
	}
	static class UMainMenu_Options_Display2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_Display2_C>();
	}
};
static_assert(alignof(UMainMenu_Options_Display2_C) == 0x000008, "Wrong alignment on UMainMenu_Options_Display2_C");
static_assert(sizeof(UMainMenu_Options_Display2_C) == 0x0003A8, "Wrong size on UMainMenu_Options_Display2_C");
static_assert(offsetof(UMainMenu_Options_Display2_C, Arrow_Left) == 0x000360, "Member 'UMainMenu_Options_Display2_C::Arrow_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Arrow_Right) == 0x000368, "Member 'UMainMenu_Options_Display2_C::Arrow_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Base_Black) == 0x000370, "Member 'UMainMenu_Options_Display2_C::Base_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Base_Frame) == 0x000378, "Member 'UMainMenu_Options_Display2_C::Base_Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Base_White) == 0x000380, "Member 'UMainMenu_Options_Display2_C::Base_White' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Img_Black) == 0x000388, "Member 'UMainMenu_Options_Display2_C::Img_Black' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Img_Gauge_Head) == 0x000390, "Member 'UMainMenu_Options_Display2_C::Img_Gauge_Head' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Img_White) == 0x000398, "Member 'UMainMenu_Options_Display2_C::Img_White' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_Display2_C, Txt_Setting) == 0x0003A0, "Member 'UMainMenu_Options_Display2_C::Txt_Setting' has a wrong offset!");

}

