#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Item_SelectMember_List

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Item_SelectMember_List.MainMenu_Item_SelectMember_List_C
// 0x0020 (0x0380 - 0x0360)
class UMainMenu_Item_SelectMember_List_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Focus_In;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ScrollBarIcon1;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ScrollBarIcon2;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Item_SelectMember_List_C">();
	}
	static class UMainMenu_Item_SelectMember_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Item_SelectMember_List_C>();
	}
};
static_assert(alignof(UMainMenu_Item_SelectMember_List_C) == 0x000008, "Wrong alignment on UMainMenu_Item_SelectMember_List_C");
static_assert(sizeof(UMainMenu_Item_SelectMember_List_C) == 0x000380, "Wrong size on UMainMenu_Item_SelectMember_List_C");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Focus_In) == 0x000360, "Member 'UMainMenu_Item_SelectMember_List_C::Focus_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, ScrollBarIcon1) == 0x000368, "Member 'UMainMenu_Item_SelectMember_List_C::ScrollBarIcon1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, ScrollBarIcon2) == 0x000370, "Member 'UMainMenu_Item_SelectMember_List_C::ScrollBarIcon2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Item_SelectMember_List_C, Txt_Title) == 0x000378, "Member 'UMainMenu_Item_SelectMember_List_C::Txt_Title' has a wrong offset!");

}

