#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Equip_SkillList2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Equip_SkillList2.MainMenu_Equip_SkillList2_C
// 0x0070 (0x03D0 - 0x0360)
class UMainMenu_Equip_SkillList2_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          EndTextBlock_0;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          EndTextBlock_2;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_Exp;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GoalBase;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear2;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Exp_Gauge_BG;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Exp_Gauge_Waku;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AbilityTitle;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AccessoryInfo;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Equip_SkillList2_C">();
	}
	static class UMainMenu_Equip_SkillList2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Equip_SkillList2_C>();
	}
};
static_assert(alignof(UMainMenu_Equip_SkillList2_C) == 0x000008, "Wrong alignment on UMainMenu_Equip_SkillList2_C");
static_assert(sizeof(UMainMenu_Equip_SkillList2_C) == 0x0003D0, "Wrong size on UMainMenu_Equip_SkillList2_C");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Base) == 0x000360, "Member 'UMainMenu_Equip_SkillList2_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, EndTextBlock_0) == 0x000368, "Member 'UMainMenu_Equip_SkillList2_C::EndTextBlock_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, EndTextBlock_2) == 0x000370, "Member 'UMainMenu_Equip_SkillList2_C::EndTextBlock_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Gauge_Exp) == 0x000378, "Member 'UMainMenu_Equip_SkillList2_C::Gauge_Exp' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, GoalBase) == 0x000380, "Member 'UMainMenu_Equip_SkillList2_C::GoalBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Icon_Clear) == 0x000388, "Member 'UMainMenu_Equip_SkillList2_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Icon_Clear2) == 0x000390, "Member 'UMainMenu_Equip_SkillList2_C::Icon_Clear2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Img_Exp_Gauge_BG) == 0x000398, "Member 'UMainMenu_Equip_SkillList2_C::Img_Exp_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Img_Exp_Gauge_Waku) == 0x0003A0, "Member 'UMainMenu_Equip_SkillList2_C::Img_Exp_Gauge_Waku' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Line) == 0x0003A8, "Member 'UMainMenu_Equip_SkillList2_C::Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Txt_AbilityTitle) == 0x0003B0, "Member 'UMainMenu_Equip_SkillList2_C::Txt_AbilityTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Txt_AccessoryInfo) == 0x0003B8, "Member 'UMainMenu_Equip_SkillList2_C::Txt_AccessoryInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Txt_Info) == 0x0003C0, "Member 'UMainMenu_Equip_SkillList2_C::Txt_Info' has a wrong offset!");
static_assert(offsetof(UMainMenu_Equip_SkillList2_C, Txt_Title) == 0x0003C8, "Member 'UMainMenu_Equip_SkillList2_C::Txt_Title' has a wrong offset!");

}

