#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Top_Test

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Top_Test.MainMenu_Top_Test_C
// 0x0138 (0x0738 - 0x0600)
class UMainMenu_Top_Test_C final : public UEndMainTopMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       BlackBg_In;                                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       End0;                                              // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       End2;                                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       End1;                                              // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Character_In2;                                     // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Character_In1;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLight3;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLight4;                                        // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLight5;                                        // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BgLine1;                                           // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BlackBg;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_8;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_9;                                        // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GrayBg;                                            // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_LeftMenu_C*                   MainMenu_LeftMenu;                                 // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_TopStatus_C*                  MainMenu_TopStatus_00;                             // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_TopStatus_C*                  MainMenu_TopStatus_01;                             // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_TopStatus_C*                  MainMenu_TopStatus_02;                             // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBattleText_03_C*                       SkillUp_00;                                        // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBattleText_03_C*                       SkillUp_01;                                        // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBattleText_03_C*                       SkillUp_02;                                        // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_SkillUpPop_C*                 SkillUp_n00;                                       // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_SkillUpPop_C*                 SkillUp_n01;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_SkillUpPop_C*                 SkillUp_n02;                                       // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              StatusLine;                                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Win_01;                                            // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Win_02;                                            // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Win_03;                                            // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MainMenu_Top_Test(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Top_Test_C">();
	}
	static class UMainMenu_Top_Test_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Top_Test_C>();
	}
};
static_assert(alignof(UMainMenu_Top_Test_C) == 0x000008, "Wrong alignment on UMainMenu_Top_Test_C");
static_assert(sizeof(UMainMenu_Top_Test_C) == 0x000738, "Wrong size on UMainMenu_Top_Test_C");
static_assert(offsetof(UMainMenu_Top_Test_C, UberGraphFrame) == 0x000600, "Member 'UMainMenu_Top_Test_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, BlackBg_In) == 0x000608, "Member 'UMainMenu_Top_Test_C::BlackBg_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, Loop) == 0x000610, "Member 'UMainMenu_Top_Test_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, End0) == 0x000618, "Member 'UMainMenu_Top_Test_C::End0' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, End2) == 0x000620, "Member 'UMainMenu_Top_Test_C::End2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, End1) == 0x000628, "Member 'UMainMenu_Top_Test_C::End1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, Character_In2) == 0x000630, "Member 'UMainMenu_Top_Test_C::Character_In2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, Character_In1) == 0x000638, "Member 'UMainMenu_Top_Test_C::Character_In1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, Menu_In) == 0x000640, "Member 'UMainMenu_Top_Test_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, BaseLight3) == 0x000648, "Member 'UMainMenu_Top_Test_C::BaseLight3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, BaseLight4) == 0x000650, "Member 'UMainMenu_Top_Test_C::BaseLight4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, BaseLight5) == 0x000658, "Member 'UMainMenu_Top_Test_C::BaseLight5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, BgLine1) == 0x000660, "Member 'UMainMenu_Top_Test_C::BgLine1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, BlackBg) == 0x000668, "Member 'UMainMenu_Top_Test_C::BlackBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_0) == 0x000670, "Member 'UMainMenu_Top_Test_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_1) == 0x000678, "Member 'UMainMenu_Top_Test_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_2) == 0x000680, "Member 'UMainMenu_Top_Test_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_3) == 0x000688, "Member 'UMainMenu_Top_Test_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_4) == 0x000690, "Member 'UMainMenu_Top_Test_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_5) == 0x000698, "Member 'UMainMenu_Top_Test_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_6) == 0x0006A0, "Member 'UMainMenu_Top_Test_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_7) == 0x0006A8, "Member 'UMainMenu_Top_Test_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_8) == 0x0006B0, "Member 'UMainMenu_Top_Test_C::EndImage_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, EndImage_9) == 0x0006B8, "Member 'UMainMenu_Top_Test_C::EndImage_9' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, GrayBg) == 0x0006C0, "Member 'UMainMenu_Top_Test_C::GrayBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, MainMenu_LeftMenu) == 0x0006C8, "Member 'UMainMenu_Top_Test_C::MainMenu_LeftMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, MainMenu_TopStatus_00) == 0x0006D0, "Member 'UMainMenu_Top_Test_C::MainMenu_TopStatus_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, MainMenu_TopStatus_01) == 0x0006D8, "Member 'UMainMenu_Top_Test_C::MainMenu_TopStatus_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, MainMenu_TopStatus_02) == 0x0006E0, "Member 'UMainMenu_Top_Test_C::MainMenu_TopStatus_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, SkillUp_00) == 0x0006E8, "Member 'UMainMenu_Top_Test_C::SkillUp_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, SkillUp_01) == 0x0006F0, "Member 'UMainMenu_Top_Test_C::SkillUp_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, SkillUp_02) == 0x0006F8, "Member 'UMainMenu_Top_Test_C::SkillUp_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, SkillUp_n00) == 0x000700, "Member 'UMainMenu_Top_Test_C::SkillUp_n00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, SkillUp_n01) == 0x000708, "Member 'UMainMenu_Top_Test_C::SkillUp_n01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, SkillUp_n02) == 0x000710, "Member 'UMainMenu_Top_Test_C::SkillUp_n02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, StatusLine) == 0x000718, "Member 'UMainMenu_Top_Test_C::StatusLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, Win_01) == 0x000720, "Member 'UMainMenu_Top_Test_C::Win_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, Win_02) == 0x000728, "Member 'UMainMenu_Top_Test_C::Win_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Top_Test_C, Win_03) == 0x000730, "Member 'UMainMenu_Top_Test_C::Win_03' has a wrong offset!");

}

