#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_SpAutoList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_SpAutoList.MainMenu_SpAutoList_C
// 0x0028 (0x0388 - 0x0360)
class UMainMenu_SpAutoList_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_WindowTitle;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_SpAutoList_C">();
	}
	static class UMainMenu_SpAutoList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_SpAutoList_C>();
	}
};
static_assert(alignof(UMainMenu_SpAutoList_C) == 0x000008, "Wrong alignment on UMainMenu_SpAutoList_C");
static_assert(sizeof(UMainMenu_SpAutoList_C) == 0x000388, "Wrong size on UMainMenu_SpAutoList_C");
static_assert(offsetof(UMainMenu_SpAutoList_C, Base) == 0x000360, "Member 'UMainMenu_SpAutoList_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_SpAutoList_C, Base1) == 0x000368, "Member 'UMainMenu_SpAutoList_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_SpAutoList_C, LeftLine) == 0x000370, "Member 'UMainMenu_SpAutoList_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_SpAutoList_C, Title_Line) == 0x000378, "Member 'UMainMenu_SpAutoList_C::Title_Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_SpAutoList_C, Txt_WindowTitle) == 0x000380, "Member 'UMainMenu_SpAutoList_C::Txt_WindowTitle' has a wrong offset!");

}

