#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_CategoryChangeBtn

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_CategoryChangeBtn.MainMenu_CategoryChangeBtn_C
// 0x0030 (0x0390 - 0x0360)
class UMainMenu_CategoryChangeBtn_C final : public UEndMenuCategoryChangeBtn
{
public:
	class UWidgetAnimation*                       OnPressR2;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnPressL2;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoActive;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Left;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Right;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_CategoryChangeBtn_C">();
	}
	static class UMainMenu_CategoryChangeBtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_CategoryChangeBtn_C>();
	}
};
static_assert(alignof(UMainMenu_CategoryChangeBtn_C) == 0x000008, "Wrong alignment on UMainMenu_CategoryChangeBtn_C");
static_assert(sizeof(UMainMenu_CategoryChangeBtn_C) == 0x000390, "Wrong size on UMainMenu_CategoryChangeBtn_C");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, OnPressR2) == 0x000360, "Member 'UMainMenu_CategoryChangeBtn_C::OnPressR2' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, OnPressL2) == 0x000368, "Member 'UMainMenu_CategoryChangeBtn_C::OnPressL2' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, Normal) == 0x000370, "Member 'UMainMenu_CategoryChangeBtn_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, NoActive) == 0x000378, "Member 'UMainMenu_CategoryChangeBtn_C::NoActive' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, Icon_Left) == 0x000380, "Member 'UMainMenu_CategoryChangeBtn_C::Icon_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_CategoryChangeBtn_C, Icon_Right) == 0x000388, "Member 'UMainMenu_CategoryChangeBtn_C::Icon_Right' has a wrong offset!");

}

