#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Manual_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Manual_Top.MainMenu_Manual_Top_C
// 0x0068 (0x0598 - 0x0530)
class UMainMenu_Manual_Top_C final : public UEndMainManualMenu
{
public:
	class UWidgetAnimation*                       Detail_In;                                         // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Cover_In;                                          // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CoverBg;                                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CoverBg2;                                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DetailBase;                                        // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DetailBase2;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight;                                         // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              UnderLine;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Manual_Top_C">();
	}
	static class UMainMenu_Manual_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Manual_Top_C>();
	}
};
static_assert(alignof(UMainMenu_Manual_Top_C) == 0x000008, "Wrong alignment on UMainMenu_Manual_Top_C");
static_assert(sizeof(UMainMenu_Manual_Top_C) == 0x000598, "Wrong size on UMainMenu_Manual_Top_C");
static_assert(offsetof(UMainMenu_Manual_Top_C, Detail_In) == 0x000530, "Member 'UMainMenu_Manual_Top_C::Detail_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Cover_In) == 0x000538, "Member 'UMainMenu_Manual_Top_C::Cover_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Menu_In) == 0x000540, "Member 'UMainMenu_Manual_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, CoverBg) == 0x000548, "Member 'UMainMenu_Manual_Top_C::CoverBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, CoverBg2) == 0x000550, "Member 'UMainMenu_Manual_Top_C::CoverBg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, DetailBase) == 0x000558, "Member 'UMainMenu_Manual_Top_C::DetailBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, DetailBase2) == 0x000560, "Member 'UMainMenu_Manual_Top_C::DetailBase2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, IconLeft) == 0x000568, "Member 'UMainMenu_Manual_Top_C::IconLeft' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, IconRight) == 0x000570, "Member 'UMainMenu_Manual_Top_C::IconRight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, LeftLine) == 0x000578, "Member 'UMainMenu_Manual_Top_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Light) == 0x000580, "Member 'UMainMenu_Manual_Top_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, Title_Line) == 0x000588, "Member 'UMainMenu_Manual_Top_C::Title_Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Top_C, UnderLine) == 0x000590, "Member 'UMainMenu_Manual_Top_C::UnderLine' has a wrong offset!");

}

