#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaInfo_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_MateriaInfo_Cell.MainMenu_MateriaInfo_Cell_C
// 0x0020 (0x0380 - 0x0360)
class UMainMenu_MateriaInfo_Cell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Normal;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Invalid;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ActiveBase;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_MateriaInfo_Cell_C">();
	}
	static class UMainMenu_MateriaInfo_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_MateriaInfo_Cell_C>();
	}
};
static_assert(alignof(UMainMenu_MateriaInfo_Cell_C) == 0x000008, "Wrong alignment on UMainMenu_MateriaInfo_Cell_C");
static_assert(sizeof(UMainMenu_MateriaInfo_Cell_C) == 0x000380, "Wrong size on UMainMenu_MateriaInfo_Cell_C");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, Normal) == 0x000360, "Member 'UMainMenu_MateriaInfo_Cell_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, Invalid) == 0x000368, "Member 'UMainMenu_MateriaInfo_Cell_C::Invalid' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, ActiveBase) == 0x000370, "Member 'UMainMenu_MateriaInfo_Cell_C::ActiveBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaInfo_Cell_C, Icon_Status) == 0x000378, "Member 'UMainMenu_MateriaInfo_Cell_C::Icon_Status' has a wrong offset!");

}

