#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_SelectList4

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_SelectList4.MainMenu_Options_SelectList4_C
// 0x0048 (0x03A8 - 0x0360)
class UMainMenu_Options_SelectList4_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Dot_Bottom;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_Top;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Bottom;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Top;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   SettingList;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ControllerName;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title1;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title2;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title3;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_SelectList4_C">();
	}
	static class UMainMenu_Options_SelectList4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_SelectList4_C>();
	}
};
static_assert(alignof(UMainMenu_Options_SelectList4_C) == 0x000008, "Wrong alignment on UMainMenu_Options_SelectList4_C");
static_assert(sizeof(UMainMenu_Options_SelectList4_C) == 0x0003A8, "Wrong size on UMainMenu_Options_SelectList4_C");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, Dot_Bottom) == 0x000360, "Member 'UMainMenu_Options_SelectList4_C::Dot_Bottom' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, Dot_Top) == 0x000368, "Member 'UMainMenu_Options_SelectList4_C::Dot_Top' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, Line_Bottom) == 0x000370, "Member 'UMainMenu_Options_SelectList4_C::Line_Bottom' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, Line_Top) == 0x000378, "Member 'UMainMenu_Options_SelectList4_C::Line_Top' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, SettingList) == 0x000380, "Member 'UMainMenu_Options_SelectList4_C::SettingList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, Txt_ControllerName) == 0x000388, "Member 'UMainMenu_Options_SelectList4_C::Txt_ControllerName' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, Txt_Title1) == 0x000390, "Member 'UMainMenu_Options_SelectList4_C::Txt_Title1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, Txt_Title2) == 0x000398, "Member 'UMainMenu_Options_SelectList4_C::Txt_Title2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList4_C, Txt_Title3) == 0x0003A0, "Member 'UMainMenu_Options_SelectList4_C::Txt_Title3' has a wrong offset!");

}

