#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_SkillUpPop

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_SkillUpPop.MainMenu_SkillUpPop_C
// 0x00B0 (0x0410 - 0x0360)
class UMainMenu_SkillUpPop_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       MateriaSlotUp_In;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkillUp_In;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Learning_In;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Materia_In;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Weapon_In;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_BattleText_01;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              AutoIconFrame;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BlackBg;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Base;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Bg;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Learning;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Level;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Materia;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Effect_Particle;                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Weapon;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_SkillUpBase;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             Nut_Txt;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_LevelUp;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_SkillUpPop_C">();
	}
	static class UMainMenu_SkillUpPop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_SkillUpPop_C>();
	}
};
static_assert(alignof(UMainMenu_SkillUpPop_C) == 0x000008, "Wrong alignment on UMainMenu_SkillUpPop_C");
static_assert(sizeof(UMainMenu_SkillUpPop_C) == 0x000410, "Wrong size on UMainMenu_SkillUpPop_C");
static_assert(offsetof(UMainMenu_SkillUpPop_C, MateriaSlotUp_In) == 0x000360, "Member 'UMainMenu_SkillUpPop_C::MateriaSlotUp_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, SkillUp_In) == 0x000368, "Member 'UMainMenu_SkillUpPop_C::SkillUp_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Learning_In) == 0x000370, "Member 'UMainMenu_SkillUpPop_C::Learning_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Materia_In) == 0x000378, "Member 'UMainMenu_SkillUpPop_C::Materia_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Weapon_In) == 0x000380, "Member 'UMainMenu_SkillUpPop_C::Weapon_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, In) == 0x000388, "Member 'UMainMenu_SkillUpPop_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, All_BattleText_01) == 0x000390, "Member 'UMainMenu_SkillUpPop_C::All_BattleText_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, AutoIconFrame) == 0x000398, "Member 'UMainMenu_SkillUpPop_C::AutoIconFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, BlackBg) == 0x0003A0, "Member 'UMainMenu_SkillUpPop_C::BlackBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, EndImage_0) == 0x0003A8, "Member 'UMainMenu_SkillUpPop_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Base) == 0x0003B0, "Member 'UMainMenu_SkillUpPop_C::Img_Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Base_Bg) == 0x0003B8, "Member 'UMainMenu_SkillUpPop_C::Img_Base_Bg' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Effect_00) == 0x0003C0, "Member 'UMainMenu_SkillUpPop_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Effect_01) == 0x0003C8, "Member 'UMainMenu_SkillUpPop_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Effect_Learning) == 0x0003D0, "Member 'UMainMenu_SkillUpPop_C::Img_Effect_Learning' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Effect_Level) == 0x0003D8, "Member 'UMainMenu_SkillUpPop_C::Img_Effect_Level' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Effect_Materia) == 0x0003E0, "Member 'UMainMenu_SkillUpPop_C::Img_Effect_Materia' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Effect_Particle) == 0x0003E8, "Member 'UMainMenu_SkillUpPop_C::Img_Effect_Particle' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_Effect_Weapon) == 0x0003F0, "Member 'UMainMenu_SkillUpPop_C::Img_Effect_Weapon' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Img_SkillUpBase) == 0x0003F8, "Member 'UMainMenu_SkillUpPop_C::Img_SkillUpBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Nut_Txt) == 0x000400, "Member 'UMainMenu_SkillUpPop_C::Nut_Txt' has a wrong offset!");
static_assert(offsetof(UMainMenu_SkillUpPop_C, Txt_LevelUp) == 0x000408, "Member 'UMainMenu_SkillUpPop_C::Txt_LevelUp' has a wrong offset!");

}

