#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_StatusTop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_StatusTop.MainMenu_StatusTop_C
// 0x0188 (0x06C8 - 0x0540)
class UMainMenu_StatusTop_C final : public UEndMainStatusMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       IconList_In;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_Out_InDetail;                                 // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Character_In;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status01_Out;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Status01_In;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_01_C*              AttributionCell_00;                                // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_01_C*              AttributionCell_01;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_01_C*              AttributionCell_02;                                // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_01_C*              AttributionCell_03;                                // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_01_C*              AttributionCell_04;                                // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_CategoryChangeBtn_C*          CategoryChangeBtn;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_List_C*            Cell0;                                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_List_C*            Cell1;                                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_List_C*            Cell2;                                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             DescriptionCellList;                               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_8;                                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_9;                                        // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_02_C*              EquipCell_00;                                      // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_02_C*              EquipCell_01;                                      // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_02_C*              EquipCell_02;                                      // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Arrow;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Arrow_Up;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_IconList_C*                   IconList;                                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_LeftMenu_C*                   LeftMenu;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line00;                                            // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_TopStatus_C*                  Member_TopStatus;                                  // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Status_01;                                     // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_00;                                     // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_01;                                     // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_02;                                     // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_03;                                     // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_04;                                     // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_05;                                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_06;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_07;                                     // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_08;                                     // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_00_C*              StatusCell_09;                                     // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title_C*           Title_Accessory;                                   // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title_C*           Title_Atk_Attribution;                             // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title_C*           Title_Def_Attribution;                             // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title_C*           Title_Proterctor;                                  // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title2_C*          Title_Status;                                      // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_Title_C*           Title_Weapon;                                      // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MainMenu_StatusTop(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_StatusTop_C">();
	}
	static class UMainMenu_StatusTop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_StatusTop_C>();
	}
};
static_assert(alignof(UMainMenu_StatusTop_C) == 0x000008, "Wrong alignment on UMainMenu_StatusTop_C");
static_assert(sizeof(UMainMenu_StatusTop_C) == 0x0006C8, "Wrong size on UMainMenu_StatusTop_C");
static_assert(offsetof(UMainMenu_StatusTop_C, UberGraphFrame) == 0x000540, "Member 'UMainMenu_StatusTop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, IconList_In) == 0x000548, "Member 'UMainMenu_StatusTop_C::IconList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Menu_Out_InDetail) == 0x000550, "Member 'UMainMenu_StatusTop_C::Menu_Out_InDetail' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Character_In) == 0x000558, "Member 'UMainMenu_StatusTop_C::Character_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Status01_Out) == 0x000560, "Member 'UMainMenu_StatusTop_C::Status01_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Status01_In) == 0x000568, "Member 'UMainMenu_StatusTop_C::Status01_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Menu_In) == 0x000570, "Member 'UMainMenu_StatusTop_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, AttributionCell_00) == 0x000578, "Member 'UMainMenu_StatusTop_C::AttributionCell_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, AttributionCell_01) == 0x000580, "Member 'UMainMenu_StatusTop_C::AttributionCell_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, AttributionCell_02) == 0x000588, "Member 'UMainMenu_StatusTop_C::AttributionCell_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, AttributionCell_03) == 0x000590, "Member 'UMainMenu_StatusTop_C::AttributionCell_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, AttributionCell_04) == 0x000598, "Member 'UMainMenu_StatusTop_C::AttributionCell_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, CategoryChangeBtn) == 0x0005A0, "Member 'UMainMenu_StatusTop_C::CategoryChangeBtn' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Cell0) == 0x0005A8, "Member 'UMainMenu_StatusTop_C::Cell0' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Cell1) == 0x0005B0, "Member 'UMainMenu_StatusTop_C::Cell1' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Cell2) == 0x0005B8, "Member 'UMainMenu_StatusTop_C::Cell2' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, DescriptionCellList) == 0x0005C0, "Member 'UMainMenu_StatusTop_C::DescriptionCellList' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EndImage_0) == 0x0005C8, "Member 'UMainMenu_StatusTop_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EndImage_1) == 0x0005D0, "Member 'UMainMenu_StatusTop_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EndImage_6) == 0x0005D8, "Member 'UMainMenu_StatusTop_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EndImage_7) == 0x0005E0, "Member 'UMainMenu_StatusTop_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EndImage_8) == 0x0005E8, "Member 'UMainMenu_StatusTop_C::EndImage_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EndImage_9) == 0x0005F0, "Member 'UMainMenu_StatusTop_C::EndImage_9' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EquipCell_00) == 0x0005F8, "Member 'UMainMenu_StatusTop_C::EquipCell_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EquipCell_01) == 0x000600, "Member 'UMainMenu_StatusTop_C::EquipCell_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, EquipCell_02) == 0x000608, "Member 'UMainMenu_StatusTop_C::EquipCell_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Icon_Arrow) == 0x000610, "Member 'UMainMenu_StatusTop_C::Icon_Arrow' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Icon_Arrow_Up) == 0x000618, "Member 'UMainMenu_StatusTop_C::Icon_Arrow_Up' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, IconList) == 0x000620, "Member 'UMainMenu_StatusTop_C::IconList' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, LeftMenu) == 0x000628, "Member 'UMainMenu_StatusTop_C::LeftMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Line00) == 0x000630, "Member 'UMainMenu_StatusTop_C::Line00' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Member_TopStatus) == 0x000638, "Member 'UMainMenu_StatusTop_C::Member_TopStatus' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Pnl_Status_01) == 0x000640, "Member 'UMainMenu_StatusTop_C::Pnl_Status_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_00) == 0x000648, "Member 'UMainMenu_StatusTop_C::StatusCell_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_01) == 0x000650, "Member 'UMainMenu_StatusTop_C::StatusCell_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_02) == 0x000658, "Member 'UMainMenu_StatusTop_C::StatusCell_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_03) == 0x000660, "Member 'UMainMenu_StatusTop_C::StatusCell_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_04) == 0x000668, "Member 'UMainMenu_StatusTop_C::StatusCell_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_05) == 0x000670, "Member 'UMainMenu_StatusTop_C::StatusCell_05' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_06) == 0x000678, "Member 'UMainMenu_StatusTop_C::StatusCell_06' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_07) == 0x000680, "Member 'UMainMenu_StatusTop_C::StatusCell_07' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_08) == 0x000688, "Member 'UMainMenu_StatusTop_C::StatusCell_08' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, StatusCell_09) == 0x000690, "Member 'UMainMenu_StatusTop_C::StatusCell_09' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Title_Accessory) == 0x000698, "Member 'UMainMenu_StatusTop_C::Title_Accessory' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Title_Atk_Attribution) == 0x0006A0, "Member 'UMainMenu_StatusTop_C::Title_Atk_Attribution' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Title_Def_Attribution) == 0x0006A8, "Member 'UMainMenu_StatusTop_C::Title_Def_Attribution' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Title_Proterctor) == 0x0006B0, "Member 'UMainMenu_StatusTop_C::Title_Proterctor' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Title_Status) == 0x0006B8, "Member 'UMainMenu_StatusTop_C::Title_Status' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusTop_C, Title_Weapon) == 0x0006C0, "Member 'UMainMenu_StatusTop_C::Title_Weapon' has a wrong offset!");

}

