#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaQuick_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_MateriaQuick_List.MainMenu_MateriaQuick_List_C
// 0x0070 (0x06B0 - 0x0640)
class UMainMenu_MateriaQuick_List_C final : public UEndQuickMateriaList
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       List_In;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              AwayIcon;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Summon;                                       // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft1;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft2;                                         // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft3;                                         // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight1;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight2;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight3;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              NameBase;                                          // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SummonLine;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MainMenu_MateriaQuick_List(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_MateriaQuick_List_C">();
	}
	static class UMainMenu_MateriaQuick_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_MateriaQuick_List_C>();
	}
};
static_assert(alignof(UMainMenu_MateriaQuick_List_C) == 0x000008, "Wrong alignment on UMainMenu_MateriaQuick_List_C");
static_assert(sizeof(UMainMenu_MateriaQuick_List_C) == 0x0006B0, "Wrong size on UMainMenu_MateriaQuick_List_C");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, UberGraphFrame) == 0x000640, "Member 'UMainMenu_MateriaQuick_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, List_In) == 0x000648, "Member 'UMainMenu_MateriaQuick_List_C::List_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, AwayIcon) == 0x000650, "Member 'UMainMenu_MateriaQuick_List_C::AwayIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, Icon_Summon) == 0x000658, "Member 'UMainMenu_MateriaQuick_List_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, IconLeft1) == 0x000660, "Member 'UMainMenu_MateriaQuick_List_C::IconLeft1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, IconLeft2) == 0x000668, "Member 'UMainMenu_MateriaQuick_List_C::IconLeft2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, IconLeft3) == 0x000670, "Member 'UMainMenu_MateriaQuick_List_C::IconLeft3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, IconRight1) == 0x000678, "Member 'UMainMenu_MateriaQuick_List_C::IconRight1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, IconRight2) == 0x000680, "Member 'UMainMenu_MateriaQuick_List_C::IconRight2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, IconRight3) == 0x000688, "Member 'UMainMenu_MateriaQuick_List_C::IconRight3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, Line1) == 0x000690, "Member 'UMainMenu_MateriaQuick_List_C::Line1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, Line2) == 0x000698, "Member 'UMainMenu_MateriaQuick_List_C::Line2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, NameBase) == 0x0006A0, "Member 'UMainMenu_MateriaQuick_List_C::NameBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaQuick_List_C, SummonLine) == 0x0006A8, "Member 'UMainMenu_MateriaQuick_List_C::SummonLine' has a wrong offset!");

}

