#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_StatusCell_03

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_StatusCell_03.MainMenu_StatusCell_03_C
// 0x0018 (0x0378 - 0x0360)
class UMainMenu_StatusCell_03_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Base;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base0;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_StatusCell_03_C">();
	}
	static class UMainMenu_StatusCell_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_StatusCell_03_C>();
	}
};
static_assert(alignof(UMainMenu_StatusCell_03_C) == 0x000008, "Wrong alignment on UMainMenu_StatusCell_03_C");
static_assert(sizeof(UMainMenu_StatusCell_03_C) == 0x000378, "Wrong size on UMainMenu_StatusCell_03_C");
static_assert(offsetof(UMainMenu_StatusCell_03_C, Base) == 0x000360, "Member 'UMainMenu_StatusCell_03_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_03_C, Base0) == 0x000368, "Member 'UMainMenu_StatusCell_03_C::Base0' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_03_C, Line) == 0x000370, "Member 'UMainMenu_StatusCell_03_C::Line' has a wrong offset!");

}

