#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_ChapterSelect_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_ChapterSelect_Btn.MainMenu_ChapterSelect_Btn_C
// 0x00A8 (0x0408 - 0x0360)
class UMainMenu_ChapterSelect_Btn_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Easy;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hard;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          ChapterBillboard;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        ClearModeBox;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Board;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Record;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_SkillPointAdd;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Medal;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             SelectBtn;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Board;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ChapterNumber;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ChapterTitle;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ClearMode;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Record;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SkillPointAdd;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_ChapterSelect_Btn(int32 EntryPoint);
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_40_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_53_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_ChapterSelect_Btn_C">();
	}
	static class UMainMenu_ChapterSelect_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_ChapterSelect_Btn_C>();
	}
};
static_assert(alignof(UMainMenu_ChapterSelect_Btn_C) == 0x000008, "Wrong alignment on UMainMenu_ChapterSelect_Btn_C");
static_assert(sizeof(UMainMenu_ChapterSelect_Btn_C) == 0x000408, "Wrong size on UMainMenu_ChapterSelect_Btn_C");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_ChapterSelect_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Easy) == 0x000368, "Member 'UMainMenu_ChapterSelect_Btn_C::Easy' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Normal) == 0x000370, "Member 'UMainMenu_ChapterSelect_Btn_C::Normal' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Hard) == 0x000378, "Member 'UMainMenu_ChapterSelect_Btn_C::Hard' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, BtnHover) == 0x000380, "Member 'UMainMenu_ChapterSelect_Btn_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, ChapterBillboard) == 0x000388, "Member 'UMainMenu_ChapterSelect_Btn_C::ChapterBillboard' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, ClearModeBox) == 0x000390, "Member 'UMainMenu_ChapterSelect_Btn_C::ClearModeBox' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, HoverBase) == 0x000398, "Member 'UMainMenu_ChapterSelect_Btn_C::HoverBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Icon_Board) == 0x0003A0, "Member 'UMainMenu_ChapterSelect_Btn_C::Icon_Board' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Icon_Clear) == 0x0003A8, "Member 'UMainMenu_ChapterSelect_Btn_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Icon_Record) == 0x0003B0, "Member 'UMainMenu_ChapterSelect_Btn_C::Icon_Record' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Icon_SkillPointAdd) == 0x0003B8, "Member 'UMainMenu_ChapterSelect_Btn_C::Icon_SkillPointAdd' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Medal) == 0x0003C0, "Member 'UMainMenu_ChapterSelect_Btn_C::Medal' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, SelectBtn) == 0x0003C8, "Member 'UMainMenu_ChapterSelect_Btn_C::SelectBtn' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Title_Line) == 0x0003D0, "Member 'UMainMenu_ChapterSelect_Btn_C::Title_Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Txt_Board) == 0x0003D8, "Member 'UMainMenu_ChapterSelect_Btn_C::Txt_Board' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Txt_ChapterNumber) == 0x0003E0, "Member 'UMainMenu_ChapterSelect_Btn_C::Txt_ChapterNumber' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Txt_ChapterTitle) == 0x0003E8, "Member 'UMainMenu_ChapterSelect_Btn_C::Txt_ChapterTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Txt_ClearMode) == 0x0003F0, "Member 'UMainMenu_ChapterSelect_Btn_C::Txt_ClearMode' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Txt_Record) == 0x0003F8, "Member 'UMainMenu_ChapterSelect_Btn_C::Txt_Record' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Btn_C, Txt_SkillPointAdd) == 0x000400, "Member 'UMainMenu_ChapterSelect_Btn_C::Txt_SkillPointAdd' has a wrong offset!");

}

