#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_Target

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_Target.MainMenu_WeaponUpgrade_Target_C
// 0x0030 (0x0390 - 0x0360)
class UMainMenu_WeaponUpgrade_Target_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Target_In;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_00;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_01;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Circle_01;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_WeaponUpgrade_Target(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_Target_C">();
	}
	static class UMainMenu_WeaponUpgrade_Target_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_Target_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_Target_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_Target_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_Target_C) == 0x000390, "Wrong size on UMainMenu_WeaponUpgrade_Target_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Target_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_WeaponUpgrade_Target_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Target_C, Loop) == 0x000368, "Member 'UMainMenu_WeaponUpgrade_Target_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Target_C, Target_In) == 0x000370, "Member 'UMainMenu_WeaponUpgrade_Target_C::Target_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Target_C, Cursor_00) == 0x000378, "Member 'UMainMenu_WeaponUpgrade_Target_C::Cursor_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Target_C, Cursor_01) == 0x000380, "Member 'UMainMenu_WeaponUpgrade_Target_C::Cursor_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_Target_C, Img_Circle_01) == 0x000388, "Member 'UMainMenu_WeaponUpgrade_Target_C::Img_Circle_01' has a wrong offset!");

}

