#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_AbilityList

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_AbilityList.MainMenu_AbilityList_C
// 0x0050 (0x0250 - 0x0200)
class UMainMenu_AbilityList_C final : public UUserWidget
{
public:
	class UEndVirtualScrollBox*                   AbilityList;                                       // 0x0200(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   AbilityList_Equip;                                 // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow2;                                           // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Equip;                                   // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleValue;                                    // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_AbilityList_C">();
	}
	static class UMainMenu_AbilityList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_AbilityList_C>();
	}
};
static_assert(alignof(UMainMenu_AbilityList_C) == 0x000008, "Wrong alignment on UMainMenu_AbilityList_C");
static_assert(sizeof(UMainMenu_AbilityList_C) == 0x000250, "Wrong size on UMainMenu_AbilityList_C");
static_assert(offsetof(UMainMenu_AbilityList_C, AbilityList) == 0x000200, "Member 'UMainMenu_AbilityList_C::AbilityList' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, AbilityList_Equip) == 0x000208, "Member 'UMainMenu_AbilityList_C::AbilityList_Equip' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, Base) == 0x000210, "Member 'UMainMenu_AbilityList_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, LeftLine) == 0x000218, "Member 'UMainMenu_AbilityList_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, ListBg2) == 0x000220, "Member 'UMainMenu_AbilityList_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, Shadow) == 0x000228, "Member 'UMainMenu_AbilityList_C::Shadow' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, Shadow2) == 0x000230, "Member 'UMainMenu_AbilityList_C::Shadow2' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, Txt_Title) == 0x000238, "Member 'UMainMenu_AbilityList_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, Txt_Title_Equip) == 0x000240, "Member 'UMainMenu_AbilityList_C::Txt_Title_Equip' has a wrong offset!");
static_assert(offsetof(UMainMenu_AbilityList_C, Txt_TitleValue) == 0x000248, "Member 'UMainMenu_AbilityList_C::Txt_TitleValue' has a wrong offset!");

}

