#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_BattleReport_Btn

#include "Basic.hpp"


namespace SDK::Params
{

// Function MainMenu_BattleReport_Btn.MainMenu_BattleReport_Btn_C.ExecuteUbergraph_MainMenu_BattleReport_Btn
// 0x0008 (0x0008 - 0x0000)
struct MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue2;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn) == 0x000004, "Wrong alignment on MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn");
static_assert(sizeof(MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn) == 0x000008, "Wrong size on MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn");
static_assert(offsetof(MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn, EntryPoint) == 0x000000, "Member 'MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn, CallFunc_PlayAnimationByName_ReturnValue2) == 0x000005, "Member 'MainMenu_BattleReport_Btn_C_ExecuteUbergraph_MainMenu_BattleReport_Btn::CallFunc_PlayAnimationByName_ReturnValue2' has a wrong offset!");

}

