#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_BattleSetting_List2

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_BattleSetting_List2.MainMenu_BattleSetting_List2_C.ExecuteUbergraph_MainMenu_BattleSetting_List2
// 0x00A8 (0x00A8 - 0x0000)
struct MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_BattleSetting_Btn3_C*         K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_3; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue2;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_BattleSetting_Btn3_C*         K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_32; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue3;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_BattleSetting_Btn3_C*         K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_33; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue4;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_BattleSetting_Btn3_C*         K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_34; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue5;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMainMenu_BattleSetting_Btn3_C*         K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_35; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2) == 0x000008, "Wrong alignment on MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2");
static_assert(sizeof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2) == 0x0000A8, "Wrong size on MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, EntryPoint) == 0x000000, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_3) == 0x000010, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_3' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, CallFunc_GetChildAt_ReturnValue2) == 0x000048, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::CallFunc_GetChildAt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_32) == 0x000050, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_32' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_bSuccess2) == 0x000058, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, CallFunc_GetChildAt_ReturnValue3) == 0x000060, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::CallFunc_GetChildAt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_33) == 0x000068, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_33' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_bSuccess3) == 0x000070, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, CallFunc_GetChildAt_ReturnValue4) == 0x000078, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::CallFunc_GetChildAt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_34) == 0x000080, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_34' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_bSuccess4) == 0x000088, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, CallFunc_GetChildAt_ReturnValue5) == 0x000090, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::CallFunc_GetChildAt_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_35) == 0x000098, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_AsMain_Menu_Battle_Setting_Btn_35' has a wrong offset!");
static_assert(offsetof(MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2, K2Node_DynamicCast_bSuccess5) == 0x0000A0, "Member 'MainMenu_BattleSetting_List2_C_ExecuteUbergraph_MainMenu_BattleSetting_List2::K2Node_DynamicCast_bSuccess5' has a wrong offset!");

}

