#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_BattleSettingTop2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_BattleSettingTop2.MainMenu_BattleSettingTop2_C
// 0x0140 (0x06E0 - 0x05A0)
class UMainMenu_BattleSettingTop2_C final : public UEndMainBattleSettingMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x05A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CategoryList_In;                                   // 0x05B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_Change;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Limit_SelectList_In;                               // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Command_SelectList_In;                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_AbilityList_C*                Ability_SelectList;                                // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_BattleSetting_List2_C*        BattleSetting_List;                                // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BgEffect1;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BgEffect2;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Billboard_CharaImg;                                // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Circle;                                  // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Cross;                                   // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_L1;                                      // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Square;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light_Triangle;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_BattleSetting_CategoryList_C* Category_SelectList;                               // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_CategoryChangeBtn_C*          CategoryChangeBtn;                                 // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Controller_bg1;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Controller_bg2;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Controller_bg3;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Controller;                                    // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Controller_2;                                  // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_BattleSetting_Limit2_C*       Limit_SelectList;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListLine_Bottom;                                   // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListLine_Top;                                      // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_LeftMenu_C*                   MainMenu_LeftMenu;                                 // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_TopStatus_C*                  Member_TopStatus;                                  // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PC_Btn_Light_Circle;                               // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PC_Btn_Light_Cross;                                // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PC_Btn_Light_L1;                                   // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PC_Btn_Light_Square;                               // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PC_Btn_Light_Triangle;                             // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PS5_Btn_Light_Circle;                              // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PS5_Btn_Light_Cross;                               // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PS5_Btn_Light_L1;                                  // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PS5_Btn_Light_R1;                                  // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PS5_Btn_Light_Square;                              // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PS5_Btn_Light_Triangle;                            // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_BattleSettingTop2(int32 EntryPoint);
	void Command_Select();
	void Construct();
	void Limit_Select();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_BattleSettingTop2_C">();
	}
	static class UMainMenu_BattleSettingTop2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_BattleSettingTop2_C>();
	}
};
static_assert(alignof(UMainMenu_BattleSettingTop2_C) == 0x000008, "Wrong alignment on UMainMenu_BattleSettingTop2_C");
static_assert(sizeof(UMainMenu_BattleSettingTop2_C) == 0x0006E0, "Wrong size on UMainMenu_BattleSettingTop2_C");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, UberGraphFrame) == 0x0005A0, "Member 'UMainMenu_BattleSettingTop2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Loop) == 0x0005A8, "Member 'UMainMenu_BattleSettingTop2_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, CategoryList_In) == 0x0005B0, "Member 'UMainMenu_BattleSettingTop2_C::CategoryList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Focus_Change) == 0x0005B8, "Member 'UMainMenu_BattleSettingTop2_C::Focus_Change' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Limit_SelectList_In) == 0x0005C0, "Member 'UMainMenu_BattleSettingTop2_C::Limit_SelectList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Command_SelectList_In) == 0x0005C8, "Member 'UMainMenu_BattleSettingTop2_C::Command_SelectList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Menu_In) == 0x0005D0, "Member 'UMainMenu_BattleSettingTop2_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Ability_SelectList) == 0x0005D8, "Member 'UMainMenu_BattleSettingTop2_C::Ability_SelectList' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, BattleSetting_List) == 0x0005E0, "Member 'UMainMenu_BattleSettingTop2_C::BattleSetting_List' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, BgEffect1) == 0x0005E8, "Member 'UMainMenu_BattleSettingTop2_C::BgEffect1' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, BgEffect2) == 0x0005F0, "Member 'UMainMenu_BattleSettingTop2_C::BgEffect2' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Billboard_CharaImg) == 0x0005F8, "Member 'UMainMenu_BattleSettingTop2_C::Billboard_CharaImg' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Btn_Light_Circle) == 0x000600, "Member 'UMainMenu_BattleSettingTop2_C::Btn_Light_Circle' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Btn_Light_Cross) == 0x000608, "Member 'UMainMenu_BattleSettingTop2_C::Btn_Light_Cross' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Btn_Light_L1) == 0x000610, "Member 'UMainMenu_BattleSettingTop2_C::Btn_Light_L1' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Btn_Light_Square) == 0x000618, "Member 'UMainMenu_BattleSettingTop2_C::Btn_Light_Square' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Btn_Light_Triangle) == 0x000620, "Member 'UMainMenu_BattleSettingTop2_C::Btn_Light_Triangle' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Category_SelectList) == 0x000628, "Member 'UMainMenu_BattleSettingTop2_C::Category_SelectList' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, CategoryChangeBtn) == 0x000630, "Member 'UMainMenu_BattleSettingTop2_C::CategoryChangeBtn' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Controller_bg1) == 0x000638, "Member 'UMainMenu_BattleSettingTop2_C::Controller_bg1' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Controller_bg2) == 0x000640, "Member 'UMainMenu_BattleSettingTop2_C::Controller_bg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Controller_bg3) == 0x000648, "Member 'UMainMenu_BattleSettingTop2_C::Controller_bg3' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Img_Controller) == 0x000650, "Member 'UMainMenu_BattleSettingTop2_C::Img_Controller' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Img_Controller_2) == 0x000658, "Member 'UMainMenu_BattleSettingTop2_C::Img_Controller_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Limit_SelectList) == 0x000660, "Member 'UMainMenu_BattleSettingTop2_C::Limit_SelectList' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, ListLine_Bottom) == 0x000668, "Member 'UMainMenu_BattleSettingTop2_C::ListLine_Bottom' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, ListLine_Top) == 0x000670, "Member 'UMainMenu_BattleSettingTop2_C::ListLine_Top' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, MainMenu_LeftMenu) == 0x000678, "Member 'UMainMenu_BattleSettingTop2_C::MainMenu_LeftMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, Member_TopStatus) == 0x000680, "Member 'UMainMenu_BattleSettingTop2_C::Member_TopStatus' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PC_Btn_Light_Circle) == 0x000688, "Member 'UMainMenu_BattleSettingTop2_C::PC_Btn_Light_Circle' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PC_Btn_Light_Cross) == 0x000690, "Member 'UMainMenu_BattleSettingTop2_C::PC_Btn_Light_Cross' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PC_Btn_Light_L1) == 0x000698, "Member 'UMainMenu_BattleSettingTop2_C::PC_Btn_Light_L1' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PC_Btn_Light_Square) == 0x0006A0, "Member 'UMainMenu_BattleSettingTop2_C::PC_Btn_Light_Square' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PC_Btn_Light_Triangle) == 0x0006A8, "Member 'UMainMenu_BattleSettingTop2_C::PC_Btn_Light_Triangle' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PS5_Btn_Light_Circle) == 0x0006B0, "Member 'UMainMenu_BattleSettingTop2_C::PS5_Btn_Light_Circle' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PS5_Btn_Light_Cross) == 0x0006B8, "Member 'UMainMenu_BattleSettingTop2_C::PS5_Btn_Light_Cross' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PS5_Btn_Light_L1) == 0x0006C0, "Member 'UMainMenu_BattleSettingTop2_C::PS5_Btn_Light_L1' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PS5_Btn_Light_R1) == 0x0006C8, "Member 'UMainMenu_BattleSettingTop2_C::PS5_Btn_Light_R1' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PS5_Btn_Light_Square) == 0x0006D0, "Member 'UMainMenu_BattleSettingTop2_C::PS5_Btn_Light_Square' has a wrong offset!");
static_assert(offsetof(UMainMenu_BattleSettingTop2_C, PS5_Btn_Light_Triangle) == 0x0006D8, "Member 'UMainMenu_BattleSettingTop2_C::PS5_Btn_Light_Triangle' has a wrong offset!");

}

