#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_ChapterSelect_Top

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_ChapterSelect_Top.MainMenu_ChapterSelect_Top_C
// 0x0030 (0x04C0 - 0x0490)
class UMainMenu_ChapterSelect_Top_C final : public UEndChapterSelectMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Change_In;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_Out;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Img;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_ChapterSelect_Top(int32 EntryPoint);
	void SetCellImage(class UEndImage* Widget, class UPaperSprite* Sprite);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_ChapterSelect_Top_C">();
	}
	static class UMainMenu_ChapterSelect_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_ChapterSelect_Top_C>();
	}
};
static_assert(alignof(UMainMenu_ChapterSelect_Top_C) == 0x000008, "Wrong alignment on UMainMenu_ChapterSelect_Top_C");
static_assert(sizeof(UMainMenu_ChapterSelect_Top_C) == 0x0004C0, "Wrong size on UMainMenu_ChapterSelect_Top_C");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, UberGraphFrame) == 0x000490, "Member 'UMainMenu_ChapterSelect_Top_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Change_In) == 0x000498, "Member 'UMainMenu_ChapterSelect_Top_C::Change_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Change_Out) == 0x0004A0, "Member 'UMainMenu_ChapterSelect_Top_C::Change_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Menu_In) == 0x0004A8, "Member 'UMainMenu_ChapterSelect_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, Billboard_Img) == 0x0004B0, "Member 'UMainMenu_ChapterSelect_Top_C::Billboard_Img' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_Top_C, LeftLine) == 0x0004B8, "Member 'UMainMenu_ChapterSelect_Top_C::LeftLine' has a wrong offset!");

}

