#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaEquipTop

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_MateriaEquipTop.MainMenu_MateriaEquipTop_C.ExecuteUbergraph_MainMenu_MateriaEquipTop
// 0x0098 (0x0098 - 0x0000)
struct MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerType                                   K2Node_Event_PlayerType3;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   K2Node_Event_PlayerType2;                          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentCategoryMain                        K2Node_Event_EquipType2;                           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_EquipID;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_EquipIndex;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   K2Node_Event_PlayerType;                           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentCategoryMain                        K2Node_Event_EquipType;                            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_SlotIndex;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_OrigMateriaIndex;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TargetMateriaIndex;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEndPlayerStatus                       CallFunc_BPGetPlayerStatusWithEquipment_ReturnValue; // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	struct FEndPlayerStatus                       CallFunc_BPGetPlayerStatusWithMateria_ReturnValue; // 0x005C(0x0038)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue2;         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop) == 0x000004, "Wrong alignment on MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop");
static_assert(sizeof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop) == 0x000098, "Wrong size on MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, EntryPoint) == 0x000000, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_PlayerType3) == 0x000005, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_PlayerType3' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_PlayerType2) == 0x000006, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_PlayerType2' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_EquipType2) == 0x000007, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_EquipType2' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_EquipID) == 0x000008, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_EquipID' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_EquipIndex) == 0x000010, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_EquipIndex' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_PlayerType) == 0x000014, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_PlayerType' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_EquipType) == 0x000015, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_EquipType' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_SlotIndex) == 0x000018, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_SlotIndex' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_OrigMateriaIndex) == 0x00001C, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_OrigMateriaIndex' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, K2Node_Event_TargetMateriaIndex) == 0x000020, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::K2Node_Event_TargetMateriaIndex' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, CallFunc_BPGetPlayerStatusWithEquipment_ReturnValue) == 0x000024, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::CallFunc_BPGetPlayerStatusWithEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, CallFunc_BPGetPlayerStatusWithMateria_ReturnValue) == 0x00005C, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::CallFunc_BPGetPlayerStatusWithMateria_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop, CallFunc_PlayAnimationByName_ReturnValue2) == 0x000094, "Member 'MainMenu_MateriaEquipTop_C_ExecuteUbergraph_MainMenu_MateriaEquipTop::CallFunc_PlayAnimationByName_ReturnValue2' has a wrong offset!");

// Function MainMenu_MateriaEquipTop.MainMenu_MateriaEquipTop_C.UpdateStatusPanelWithMateria
// 0x0010 (0x0010 - 0x0000)
struct MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria final
{
public:
	EPlayerType                                   PlayerType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentCategoryMain                        EquipType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OrigMateriaIndex;                                  // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetMateriaIndex;                                // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria) == 0x000004, "Wrong alignment on MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria");
static_assert(sizeof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria) == 0x000010, "Wrong size on MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria, PlayerType) == 0x000000, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria::PlayerType' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria, EquipType) == 0x000001, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria::EquipType' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria, SlotIndex) == 0x000004, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria::SlotIndex' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria, OrigMateriaIndex) == 0x000008, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria::OrigMateriaIndex' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria, TargetMateriaIndex) == 0x00000C, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithMateria::TargetMateriaIndex' has a wrong offset!");

// Function MainMenu_MateriaEquipTop.MainMenu_MateriaEquipTop_C.UpdateStatusPanelWithEquipment
// 0x0010 (0x0010 - 0x0000)
struct MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment final
{
public:
	EPlayerType                                   PlayerType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentCategoryMain                        EquipType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EquipID;                                           // 0x0004(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EquipIndex;                                        // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment) == 0x000004, "Wrong alignment on MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment");
static_assert(sizeof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment) == 0x000010, "Wrong size on MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment, PlayerType) == 0x000000, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment::PlayerType' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment, EquipType) == 0x000001, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment::EquipType' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment, EquipID) == 0x000004, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment::EquipID' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment, EquipIndex) == 0x00000C, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanelWithEquipment::EquipIndex' has a wrong offset!");

// Function MainMenu_MateriaEquipTop.MainMenu_MateriaEquipTop_C.UpdateStatusPanel
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_MateriaEquipTop_C_UpdateStatusPanel final
{
public:
	EPlayerType                                   PlayerType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_MateriaEquipTop_C_UpdateStatusPanel) == 0x000001, "Wrong alignment on MainMenu_MateriaEquipTop_C_UpdateStatusPanel");
static_assert(sizeof(MainMenu_MateriaEquipTop_C_UpdateStatusPanel) == 0x000001, "Wrong size on MainMenu_MateriaEquipTop_C_UpdateStatusPanel");
static_assert(offsetof(MainMenu_MateriaEquipTop_C_UpdateStatusPanel, PlayerType) == 0x000000, "Member 'MainMenu_MateriaEquipTop_C_UpdateStatusPanel::PlayerType' has a wrong offset!");

}

