#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EnemyReport_Window

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EnemyReport_Window.MainMenu_EnemyReport_Window_C
// 0x0038 (0x0398 - 0x0360)
class UMainMenu_EnemyReport_Window_C final : public UEndUserWidget
{
public:
	class UEndImage*                              BgLine;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TargetMark;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WindowBase;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WindowBase2;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EnemyReport_Window_C">();
	}
	static class UMainMenu_EnemyReport_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EnemyReport_Window_C>();
	}
};
static_assert(alignof(UMainMenu_EnemyReport_Window_C) == 0x000008, "Wrong alignment on UMainMenu_EnemyReport_Window_C");
static_assert(sizeof(UMainMenu_EnemyReport_Window_C) == 0x000398, "Wrong size on UMainMenu_EnemyReport_Window_C");
static_assert(offsetof(UMainMenu_EnemyReport_Window_C, BgLine) == 0x000360, "Member 'UMainMenu_EnemyReport_Window_C::BgLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Window_C, EndImage_0) == 0x000368, "Member 'UMainMenu_EnemyReport_Window_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Window_C, EndImage_1) == 0x000370, "Member 'UMainMenu_EnemyReport_Window_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Window_C, EndImage_2) == 0x000378, "Member 'UMainMenu_EnemyReport_Window_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Window_C, TargetMark) == 0x000380, "Member 'UMainMenu_EnemyReport_Window_C::TargetMark' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Window_C, WindowBase) == 0x000388, "Member 'UMainMenu_EnemyReport_Window_C::WindowBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Window_C, WindowBase2) == 0x000390, "Member 'UMainMenu_EnemyReport_Window_C::WindowBase2' has a wrong offset!");

}

