#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_ItemTop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_ItemTop.MainMenu_ItemTop_C
// 0x00A0 (0x05D0 - 0x0530)
class UMainMenu_ItemTop_C final : public UEndMainItemMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0530(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Billboard_Materia_In;                              // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Billboard_Item_In;                                 // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SortList_In;                                       // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In_old;                                       // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectMember_In;                                   // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkillList_In;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Focus_Change;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLight3;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseLight4;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_CategoryImg;                             // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Controller_bg3;                                    // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CoverBg;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DetailBase;                                        // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light00;                                           // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_EquipInfo4_C*                 SkillList;                                         // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_SortList_C*                   SortList;                                          // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              UnderLine;                                         // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MainMenu_ItemTop(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_ItemTop_C">();
	}
	static class UMainMenu_ItemTop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_ItemTop_C>();
	}
};
static_assert(alignof(UMainMenu_ItemTop_C) == 0x000008, "Wrong alignment on UMainMenu_ItemTop_C");
static_assert(sizeof(UMainMenu_ItemTop_C) == 0x0005D0, "Wrong size on UMainMenu_ItemTop_C");
static_assert(offsetof(UMainMenu_ItemTop_C, UberGraphFrame) == 0x000530, "Member 'UMainMenu_ItemTop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Billboard_Materia_In) == 0x000538, "Member 'UMainMenu_ItemTop_C::Billboard_Materia_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Billboard_Item_In) == 0x000540, "Member 'UMainMenu_ItemTop_C::Billboard_Item_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SortList_In) == 0x000548, "Member 'UMainMenu_ItemTop_C::SortList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Menu_In_old) == 0x000550, "Member 'UMainMenu_ItemTop_C::Menu_In_old' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SelectMember_In) == 0x000558, "Member 'UMainMenu_ItemTop_C::SelectMember_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SkillList_In) == 0x000560, "Member 'UMainMenu_ItemTop_C::SkillList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Focus_Change) == 0x000568, "Member 'UMainMenu_ItemTop_C::Focus_Change' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Menu_In) == 0x000570, "Member 'UMainMenu_ItemTop_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, BaseLight3) == 0x000578, "Member 'UMainMenu_ItemTop_C::BaseLight3' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, BaseLight4) == 0x000580, "Member 'UMainMenu_ItemTop_C::BaseLight4' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Billboard_CategoryImg) == 0x000588, "Member 'UMainMenu_ItemTop_C::Billboard_CategoryImg' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Controller_bg3) == 0x000590, "Member 'UMainMenu_ItemTop_C::Controller_bg3' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, CoverBg) == 0x000598, "Member 'UMainMenu_ItemTop_C::CoverBg' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, DetailBase) == 0x0005A0, "Member 'UMainMenu_ItemTop_C::DetailBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Light) == 0x0005A8, "Member 'UMainMenu_ItemTop_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, Light00) == 0x0005B0, "Member 'UMainMenu_ItemTop_C::Light00' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SkillList) == 0x0005B8, "Member 'UMainMenu_ItemTop_C::SkillList' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, SortList) == 0x0005C0, "Member 'UMainMenu_ItemTop_C::SortList' has a wrong offset!");
static_assert(offsetof(UMainMenu_ItemTop_C, UnderLine) == 0x0005C8, "Member 'UMainMenu_ItemTop_C::UnderLine' has a wrong offset!");

}

