#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaEquipStatusCell

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C.ExecuteUbergraph_MainMenu_MateriaEquipStatusCell
// 0x0400 (0x0400 - 0x0000)
struct MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_ApStr;                                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Percent;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	struct FEndDataTableEquipment                 K2Node_Event_equipment;                            // 0x0038(0x0278)()
	int32                                         K2Node_Event_Attack;                               // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Defense;                              // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagicAttack;                          // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagicDefense;                         // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AttackAdd;                            // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_DefenseAdd;                           // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagicAttackAdd;                       // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MagicDefenseAdd;                      // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x02D8(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue2;              // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x02F8(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue3;              // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue3;              // 0x0318(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue4;              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue4;              // 0x0338(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0350(0x0028)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue5;              // 0x0378(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue6;              // 0x0390(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue7;              // 0x03A8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue8;              // 0x03C0(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor2;                     // 0x03D8(0x0028)()
};
static_assert(alignof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell) == 0x000008, "Wrong alignment on MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell");
static_assert(sizeof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell) == 0x000400, "Wrong size on MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, EntryPoint) == 0x000000, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_ApStr) == 0x000008, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_ApStr' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_Percent) == 0x000018, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_Percent' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_equipment) == 0x000038, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_equipment' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_Attack) == 0x0002B0, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_Attack' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_Defense) == 0x0002B4, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_Defense' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_MagicAttack) == 0x0002B8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_MagicAttack' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_MagicDefense) == 0x0002BC, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_MagicDefense' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_AttackAdd) == 0x0002C0, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_AttackAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_DefenseAdd) == 0x0002C4, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_DefenseAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_MagicAttackAdd) == 0x0002C8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_MagicAttackAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_Event_MagicDefenseAdd) == 0x0002CC, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_Event_MagicDefenseAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Greater_IntInt_ReturnValue) == 0x0002D0, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Add_IntInt_ReturnValue) == 0x0002D4, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue) == 0x0002D8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Greater_IntInt_ReturnValue2) == 0x0002F0, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Greater_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Add_IntInt_ReturnValue2) == 0x0002F4, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue2) == 0x0002F8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Greater_IntInt_ReturnValue3) == 0x000310, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Greater_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Add_IntInt_ReturnValue3) == 0x000314, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue3) == 0x000318, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Greater_IntInt_ReturnValue4) == 0x000330, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Greater_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Add_IntInt_ReturnValue4) == 0x000334, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue4) == 0x000338, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_MakeStruct_SlateColor) == 0x000350, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue5) == 0x000378, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue6) == 0x000390, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue7) == 0x0003A8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue7' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, CallFunc_Conv_IntToText_ReturnValue8) == 0x0003C0, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::CallFunc_Conv_IntToText_ReturnValue8' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell, K2Node_MakeStruct_SlateColor2) == 0x0003D8, "Member 'MainMenu_MateriaEquipStatusCell_C_ExecuteUbergraph_MainMenu_MateriaEquipStatusCell::K2Node_MakeStruct_SlateColor2' has a wrong offset!");

// Function MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C.OnUpdateMaterialStatus
// 0x0018 (0x0018 - 0x0000)
struct MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus final
{
public:
	class FString                                 ApStr;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Percent;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus) == 0x000008, "Wrong alignment on MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus");
static_assert(sizeof(MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus) == 0x000018, "Wrong size on MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus, ApStr) == 0x000000, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus::ApStr' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus, Percent) == 0x000010, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateMaterialStatus::Percent' has a wrong offset!");

// Function MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C.OnUpdateEquipStatus
// 0x0278 (0x0278 - 0x0000)
struct MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus final
{
public:
	struct FEndDataTableEquipment                 equipment;                                         // 0x0000(0x0278)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus) == 0x000008, "Wrong alignment on MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus");
static_assert(sizeof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus) == 0x000278, "Wrong size on MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus, equipment) == 0x000000, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipStatus::equipment' has a wrong offset!");

// Function MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C.OnUpdateEquipUpgradedStatus
// 0x0020 (0x0020 - 0x0000)
struct MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus final
{
public:
	int32                                         Attack;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Defense;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagicAttack;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagicDefense;                                      // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackAdd;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefenseAdd;                                        // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagicAttackAdd;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MagicDefenseAdd;                                   // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus) == 0x000004, "Wrong alignment on MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus");
static_assert(sizeof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus) == 0x000020, "Wrong size on MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, Attack) == 0x000000, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::Attack' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, Defense) == 0x000004, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::Defense' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, MagicAttack) == 0x000008, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::MagicAttack' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, MagicDefense) == 0x00000C, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::MagicDefense' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, AttackAdd) == 0x000010, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::AttackAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, DefenseAdd) == 0x000014, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::DefenseAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, MagicAttackAdd) == 0x000018, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::MagicAttackAdd' has a wrong offset!");
static_assert(offsetof(MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus, MagicDefenseAdd) == 0x00001C, "Member 'MainMenu_MateriaEquipStatusCell_C_OnUpdateEquipUpgradedStatus::MagicDefenseAdd' has a wrong offset!");

}

