#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Cell_Light2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Cell_Light2.MainMenu_Cell_Light2_C
// 0x0030 (0x0390 - 0x0360)
class UMainMenu_Cell_Light2_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Light;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase2;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_Cell_Light2(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Cell_Light2_C">();
	}
	static class UMainMenu_Cell_Light2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Cell_Light2_C>();
	}
};
static_assert(alignof(UMainMenu_Cell_Light2_C) == 0x000008, "Wrong alignment on UMainMenu_Cell_Light2_C");
static_assert(sizeof(UMainMenu_Cell_Light2_C) == 0x000390, "Wrong size on UMainMenu_Cell_Light2_C");
static_assert(offsetof(UMainMenu_Cell_Light2_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_Cell_Light2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light2_C, Light) == 0x000368, "Member 'UMainMenu_Cell_Light2_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light2_C, BtnHoverBase) == 0x000370, "Member 'UMainMenu_Cell_Light2_C::BtnHoverBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light2_C, BtnHoverBase2) == 0x000378, "Member 'UMainMenu_Cell_Light2_C::BtnHoverBase2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light2_C, BtnLight) == 0x000380, "Member 'UMainMenu_Cell_Light2_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_Cell_Light2_C, BtnLight2) == 0x000388, "Member 'UMainMenu_Cell_Light2_C::BtnLight2' has a wrong offset!");

}

