#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_LeftMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_LeftMenu.MainMenu_LeftMenu_C
// 0x0038 (0x0398 - 0x0360)
class UMainMenu_LeftMenu_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UEndImage*                              BtnBase1;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame1;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   LeftMenu_ScrollBox;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListEndIcon;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_BattleLeaderBtn;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MainMenu_LeftMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_LeftMenu_C">();
	}
	static class UMainMenu_LeftMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_LeftMenu_C>();
	}
};
static_assert(alignof(UMainMenu_LeftMenu_C) == 0x000008, "Wrong alignment on UMainMenu_LeftMenu_C");
static_assert(sizeof(UMainMenu_LeftMenu_C) == 0x000398, "Wrong size on UMainMenu_LeftMenu_C");
static_assert(offsetof(UMainMenu_LeftMenu_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_LeftMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, BtnBase1) == 0x000368, "Member 'UMainMenu_LeftMenu_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, BtnFrame1) == 0x000370, "Member 'UMainMenu_LeftMenu_C::BtnFrame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, LeftLine) == 0x000378, "Member 'UMainMenu_LeftMenu_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, LeftMenu_ScrollBox) == 0x000380, "Member 'UMainMenu_LeftMenu_C::LeftMenu_ScrollBox' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, ListEndIcon) == 0x000388, "Member 'UMainMenu_LeftMenu_C::ListEndIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_LeftMenu_C, Txt_BattleLeaderBtn) == 0x000390, "Member 'UMainMenu_LeftMenu_C::Txt_BattleLeaderBtn' has a wrong offset!");

}

