#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EnemyReport_BtnLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EnemyReport_BtnLight.MainMenu_EnemyReport_BtnLight_C
// 0x0028 (0x03B8 - 0x0390)
class UMainMenu_EnemyReport_BtnLight_C final : public UEndMainItemSelectBtnText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_EnemyReport_BtnLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EnemyReport_BtnLight_C">();
	}
	static class UMainMenu_EnemyReport_BtnLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EnemyReport_BtnLight_C>();
	}
};
static_assert(alignof(UMainMenu_EnemyReport_BtnLight_C) == 0x000008, "Wrong alignment on UMainMenu_EnemyReport_BtnLight_C");
static_assert(sizeof(UMainMenu_EnemyReport_BtnLight_C) == 0x0003B8, "Wrong size on UMainMenu_EnemyReport_BtnLight_C");
static_assert(offsetof(UMainMenu_EnemyReport_BtnLight_C, UberGraphFrame) == 0x000390, "Member 'UMainMenu_EnemyReport_BtnLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_BtnLight_C, Loop) == 0x000398, "Member 'UMainMenu_EnemyReport_BtnLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_BtnLight_C, BtnLight) == 0x0003A0, "Member 'UMainMenu_EnemyReport_BtnLight_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_BtnLight_C, BtnLight2) == 0x0003A8, "Member 'UMainMenu_EnemyReport_BtnLight_C::BtnLight2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_BtnLight_C, HoverBase) == 0x0003B0, "Member 'UMainMenu_EnemyReport_BtnLight_C::HoverBase' has a wrong offset!");

}

