#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_TopStatus

#include "Basic.hpp"

#include "EndGame_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_TopStatus.MainMenu_TopStatus_C.ExecuteUbergraph_MainMenu_TopStatus
// 0x0128 (0x0128 - 0x0000)
struct MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue2;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPGetPlayerHP_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	int32                                         CallFunc_BPGetPlayerHPMax_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0038(0x0018)()
	int32                                         CallFunc_BPGetPlayerMP_ReturnValue;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue3;              // 0x0058(0x0018)()
	int32                                         CallFunc_BPGetPlayerMaxMP_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue4;              // 0x0078(0x0018)()
	int32                                         CallFunc_BPGetPlayerLevel_ReturnValue;             // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue5;              // 0x0098(0x0018)()
	int32                                         CallFunc_BPGetPlayerExperience_ReturnValue;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue6;              // 0x00B8(0x0018)()
	int32                                         CallFunc_BPGetPlayerExperienceBase_ReturnValue;    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPGetPlayerExperienceNext_ReturnValue;    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue2;             // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPGetPlayerExperience_ReturnValue2;       // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue3;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPGetPlayerLimit_ReturnValue;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue4;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   K2Node_Event_PlayerType;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_BPGetPlayerLimitMax_ReturnValue;          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue5;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue2;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue3;              // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BPGetPlayerExperienceNext_ReturnValue2;   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue7;              // 0x0110(0x0018)()
};
static_assert(alignof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus) == 0x000008, "Wrong alignment on MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus");
static_assert(sizeof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus) == 0x000128, "Wrong size on MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, EntryPoint) == 0x000000, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Subtract_FloatFloat_ReturnValue2) == 0x000008, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Subtract_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000010, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerHP_ReturnValue) == 0x000014, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerHPMax_ReturnValue) == 0x000030, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerHPMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToText_ReturnValue2) == 0x000038, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToText_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerMP_ReturnValue) == 0x000050, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerMP_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToText_ReturnValue3) == 0x000058, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToText_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerMaxMP_ReturnValue) == 0x000070, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerMaxMP_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToText_ReturnValue4) == 0x000078, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToText_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerLevel_ReturnValue) == 0x000090, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToText_ReturnValue5) == 0x000098, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToText_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerExperience_ReturnValue) == 0x0000B0, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerExperience_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToText_ReturnValue6) == 0x0000B8, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToText_ReturnValue6' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerExperienceBase_ReturnValue) == 0x0000D0, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerExperienceBase_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000D4, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerExperienceNext_ReturnValue) == 0x0000D8, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerExperienceNext_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToFloat_ReturnValue2) == 0x0000DC, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerExperience_ReturnValue2) == 0x0000E0, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerExperience_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToFloat_ReturnValue3) == 0x0000E4, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerLimit_ReturnValue) == 0x0000E8, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToFloat_ReturnValue4) == 0x0000EC, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, K2Node_Event_PlayerType) == 0x0000F0, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::K2Node_Event_PlayerType' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerLimitMax_ReturnValue) == 0x0000F4, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerLimitMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToFloat_ReturnValue5) == 0x0000F8, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000FC, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_ByteToInt_ReturnValue2) == 0x000100, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_ByteToInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_ByteToInt_ReturnValue3) == 0x000104, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_ByteToInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_BPGetPlayerExperienceNext_ReturnValue2) == 0x000108, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_BPGetPlayerExperienceNext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus, CallFunc_Conv_IntToText_ReturnValue7) == 0x000110, "Member 'MainMenu_TopStatus_C_ExecuteUbergraph_MainMenu_TopStatus::CallFunc_Conv_IntToText_ReturnValue7' has a wrong offset!");

// Function MainMenu_TopStatus.MainMenu_TopStatus_C.OnSetupStatusPanel
// 0x0001 (0x0001 - 0x0000)
struct MainMenu_TopStatus_C_OnSetupStatusPanel final
{
public:
	EPlayerType                                   PlayerType_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_TopStatus_C_OnSetupStatusPanel) == 0x000001, "Wrong alignment on MainMenu_TopStatus_C_OnSetupStatusPanel");
static_assert(sizeof(MainMenu_TopStatus_C_OnSetupStatusPanel) == 0x000001, "Wrong size on MainMenu_TopStatus_C_OnSetupStatusPanel");
static_assert(offsetof(MainMenu_TopStatus_C_OnSetupStatusPanel, PlayerType_0) == 0x000000, "Member 'MainMenu_TopStatus_C_OnSetupStatusPanel::PlayerType_0' has a wrong offset!");

}

