#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_SortList

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_SortList.MainMenu_SortList_C
// 0x0038 (0x0418 - 0x03E0)
class UMainMenu_SortList_C final : public UEndSortWindow
{
public:
	class UEndImage*                              Base;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Mark;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_WindowTitle;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_SortList_C">();
	}
	static class UMainMenu_SortList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_SortList_C>();
	}
};
static_assert(alignof(UMainMenu_SortList_C) == 0x000008, "Wrong alignment on UMainMenu_SortList_C");
static_assert(sizeof(UMainMenu_SortList_C) == 0x000418, "Wrong size on UMainMenu_SortList_C");
static_assert(offsetof(UMainMenu_SortList_C, Base) == 0x0003E0, "Member 'UMainMenu_SortList_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_SortList_C, EndImage_6) == 0x0003E8, "Member 'UMainMenu_SortList_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_SortList_C, LeftLine) == 0x0003F0, "Member 'UMainMenu_SortList_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_SortList_C, Title_Line) == 0x0003F8, "Member 'UMainMenu_SortList_C::Title_Line' has a wrong offset!");
static_assert(offsetof(UMainMenu_SortList_C, Txt_Mark) == 0x000400, "Member 'UMainMenu_SortList_C::Txt_Mark' has a wrong offset!");
static_assert(offsetof(UMainMenu_SortList_C, Txt_Title) == 0x000408, "Member 'UMainMenu_SortList_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UMainMenu_SortList_C, Txt_WindowTitle) == 0x000410, "Member 'UMainMenu_SortList_C::Txt_WindowTitle' has a wrong offset!");

}

