#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Base_Test

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Base_Test.MainMenu_Base_Test_C
// 0x0018 (0x03F8 - 0x03E0)
class UMainMenu_Base_Test_C final : public UEndMainMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Menu_In;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Window_00_C*                  MainMenu_Window_00;                                // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_MainMenu_Base_Test(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Base_Test_C">();
	}
	static class UMainMenu_Base_Test_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Base_Test_C>();
	}
};
static_assert(alignof(UMainMenu_Base_Test_C) == 0x000008, "Wrong alignment on UMainMenu_Base_Test_C");
static_assert(sizeof(UMainMenu_Base_Test_C) == 0x0003F8, "Wrong size on UMainMenu_Base_Test_C");
static_assert(offsetof(UMainMenu_Base_Test_C, UberGraphFrame) == 0x0003E0, "Member 'UMainMenu_Base_Test_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Base_Test_C, Menu_In) == 0x0003E8, "Member 'UMainMenu_Base_Test_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Base_Test_C, MainMenu_Window_00) == 0x0003F0, "Member 'UMainMenu_Base_Test_C::MainMenu_Window_00' has a wrong offset!");

}

