#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EquipSelect_Cell_04

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EquipSelect_Cell_04.MainMenu_EquipSelect_Cell_04_C
// 0x0068 (0x03C8 - 0x0360)
class UMainMenu_EquipSelect_Cell_04_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       CategoryBtnHover;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EquipBtnHoverBase;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             EquipMenu_Btn;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_AbilityExp;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Item_C*                  Icon_Item;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_AbilityExp_Waku;                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_EquipCategory;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_EquipSelect_Cell_04(int32 EntryPoint);
	void BndEvt__EquipMenu_Btn_K2Node_ComponentBoundEvent_30_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__EquipMenu_Btn_K2Node_ComponentBoundEvent_45_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EquipSelect_Cell_04_C">();
	}
	static class UMainMenu_EquipSelect_Cell_04_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EquipSelect_Cell_04_C>();
	}
};
static_assert(alignof(UMainMenu_EquipSelect_Cell_04_C) == 0x000008, "Wrong alignment on UMainMenu_EquipSelect_Cell_04_C");
static_assert(sizeof(UMainMenu_EquipSelect_Cell_04_C) == 0x0003C8, "Wrong size on UMainMenu_EquipSelect_Cell_04_C");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_EquipSelect_Cell_04_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, CategoryBtnHover) == 0x000368, "Member 'UMainMenu_EquipSelect_Cell_04_C::CategoryBtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, Menu_In) == 0x000370, "Member 'UMainMenu_EquipSelect_Cell_04_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, BtnLight) == 0x000378, "Member 'UMainMenu_EquipSelect_Cell_04_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, EquipBtnHoverBase) == 0x000380, "Member 'UMainMenu_EquipSelect_Cell_04_C::EquipBtnHoverBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, EquipMenu_Btn) == 0x000388, "Member 'UMainMenu_EquipSelect_Cell_04_C::EquipMenu_Btn' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, Gauge_AbilityExp) == 0x000390, "Member 'UMainMenu_EquipSelect_Cell_04_C::Gauge_AbilityExp' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, Icon_Item) == 0x000398, "Member 'UMainMenu_EquipSelect_Cell_04_C::Icon_Item' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, Icon_New) == 0x0003A0, "Member 'UMainMenu_EquipSelect_Cell_04_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, Img_AbilityExp_Waku) == 0x0003A8, "Member 'UMainMenu_EquipSelect_Cell_04_C::Img_AbilityExp_Waku' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, Shadow) == 0x0003B0, "Member 'UMainMenu_EquipSelect_Cell_04_C::Shadow' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, Txt_EquipCategory) == 0x0003B8, "Member 'UMainMenu_EquipSelect_Cell_04_C::Txt_EquipCategory' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_04_C, Txt_Num) == 0x0003C0, "Member 'UMainMenu_EquipSelect_Cell_04_C::Txt_Num' has a wrong offset!");

}

