#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaEquipTop

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_MateriaEquipTop.MainMenu_MateriaEquipTop_C
// 0x01A0 (0x07E0 - 0x0640)
class UMainMenu_MateriaEquipTop_C final : public UEndMainEquipmentMateriaMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       EquipCharaMenu_Out;                                // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       EquipCategoryMenu_Out;                             // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Billboard_Materia_In;                              // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Billboard_Weapon_In;                               // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LightDotLoop;                                      // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LightRingLoop;                                     // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaSelectTopEmpty_In;                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaSelectTop_In;                               // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconList_In;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MenuAll_Out;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaSelect_In;                                  // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CommandList_In;                                    // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SortList_In;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaListMenu_In;                                // 0x06B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponSelect_In;                                   // 0x06B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CategoryMenu_In;                                   // 0x06C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot1;                                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot2;                                          // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot3;                                          // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot4;                                          // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot5;                                          // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase1;                                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame1;                                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_CategoryChangeBtn_C*          CategoryChangeBtn;                                 // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_EquipCommandList2_C*          CommandList;                                       // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Controller_bg3;                                    // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DetailBase;                                        // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot1;                                              // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot2;                                              // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Equip_Block_C*                EquipCell_01;                                      // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Equip_Block_C*                EquipCell_02;                                      // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Equip_Block_C*                EquipCell_03;                                      // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_05_C*              EquipCell_Top;                                     // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_EquipCategoryMenu_C*          EquipCharaMenu;                                    // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_EquipListMenu_C*              EquipListMenu;                                     // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_IconList_C*                   IconList;                                          // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightBg00;                                         // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListEndIcon;                                       // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List3_C*                       MateriaList;                                       // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_MateriaListMenu_C*            MateriaListMenu;                                   // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring1;                                             // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring2;                                             // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring3;                                             // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Ring4;                                             // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_EquipStatusList_02_C*         StatusList;                                        // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SpTitle;                                       // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Win_01;                                            // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Win_02;                                            // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Win_03;                                            // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_MateriaEquipTop(int32 EntryPoint);
	void UpdateStatusPanelWithMateria(EPlayerType PlayerType, EEquipmentCategoryMain EquipType, int32 SlotIndex, int32 OrigMateriaIndex, int32 TargetMateriaIndex);
	void UpdateStatusPanelWithEquipment(EPlayerType PlayerType, EEquipmentCategoryMain EquipType, const class FName& EquipID, int32 EquipIndex);
	void UpdateStatusPanel(EPlayerType PlayerType);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_MateriaEquipTop_C">();
	}
	static class UMainMenu_MateriaEquipTop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_MateriaEquipTop_C>();
	}
};
static_assert(alignof(UMainMenu_MateriaEquipTop_C) == 0x000008, "Wrong alignment on UMainMenu_MateriaEquipTop_C");
static_assert(sizeof(UMainMenu_MateriaEquipTop_C) == 0x0007E0, "Wrong size on UMainMenu_MateriaEquipTop_C");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, UberGraphFrame) == 0x000640, "Member 'UMainMenu_MateriaEquipTop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, EquipCharaMenu_Out) == 0x000648, "Member 'UMainMenu_MateriaEquipTop_C::EquipCharaMenu_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, EquipCategoryMenu_Out) == 0x000650, "Member 'UMainMenu_MateriaEquipTop_C::EquipCategoryMenu_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Billboard_Materia_In) == 0x000658, "Member 'UMainMenu_MateriaEquipTop_C::Billboard_Materia_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Billboard_Weapon_In) == 0x000660, "Member 'UMainMenu_MateriaEquipTop_C::Billboard_Weapon_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, LightDotLoop) == 0x000668, "Member 'UMainMenu_MateriaEquipTop_C::LightDotLoop' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, LightRingLoop) == 0x000670, "Member 'UMainMenu_MateriaEquipTop_C::LightRingLoop' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, MateriaSelectTopEmpty_In) == 0x000678, "Member 'UMainMenu_MateriaEquipTop_C::MateriaSelectTopEmpty_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, MateriaSelectTop_In) == 0x000680, "Member 'UMainMenu_MateriaEquipTop_C::MateriaSelectTop_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, IconList_In) == 0x000688, "Member 'UMainMenu_MateriaEquipTop_C::IconList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, MenuAll_Out) == 0x000690, "Member 'UMainMenu_MateriaEquipTop_C::MenuAll_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, MateriaSelect_In) == 0x000698, "Member 'UMainMenu_MateriaEquipTop_C::MateriaSelect_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, CommandList_In) == 0x0006A0, "Member 'UMainMenu_MateriaEquipTop_C::CommandList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, SortList_In) == 0x0006A8, "Member 'UMainMenu_MateriaEquipTop_C::SortList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, MateriaListMenu_In) == 0x0006B0, "Member 'UMainMenu_MateriaEquipTop_C::MateriaListMenu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, WeaponSelect_In) == 0x0006B8, "Member 'UMainMenu_MateriaEquipTop_C::WeaponSelect_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, CategoryMenu_In) == 0x0006C0, "Member 'UMainMenu_MateriaEquipTop_C::CategoryMenu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Menu_In) == 0x0006C8, "Member 'UMainMenu_MateriaEquipTop_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, BaseDot1) == 0x0006D0, "Member 'UMainMenu_MateriaEquipTop_C::BaseDot1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, BaseDot2) == 0x0006D8, "Member 'UMainMenu_MateriaEquipTop_C::BaseDot2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, BaseDot3) == 0x0006E0, "Member 'UMainMenu_MateriaEquipTop_C::BaseDot3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, BaseDot4) == 0x0006E8, "Member 'UMainMenu_MateriaEquipTop_C::BaseDot4' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, BaseDot5) == 0x0006F0, "Member 'UMainMenu_MateriaEquipTop_C::BaseDot5' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, BtnBase1) == 0x0006F8, "Member 'UMainMenu_MateriaEquipTop_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, BtnFrame1) == 0x000700, "Member 'UMainMenu_MateriaEquipTop_C::BtnFrame1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, CategoryChangeBtn) == 0x000708, "Member 'UMainMenu_MateriaEquipTop_C::CategoryChangeBtn' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, CommandList) == 0x000710, "Member 'UMainMenu_MateriaEquipTop_C::CommandList' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Controller_bg3) == 0x000718, "Member 'UMainMenu_MateriaEquipTop_C::Controller_bg3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, DetailBase) == 0x000720, "Member 'UMainMenu_MateriaEquipTop_C::DetailBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Dot1) == 0x000728, "Member 'UMainMenu_MateriaEquipTop_C::Dot1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Dot2) == 0x000730, "Member 'UMainMenu_MateriaEquipTop_C::Dot2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, EquipCell_01) == 0x000738, "Member 'UMainMenu_MateriaEquipTop_C::EquipCell_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, EquipCell_02) == 0x000740, "Member 'UMainMenu_MateriaEquipTop_C::EquipCell_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, EquipCell_03) == 0x000748, "Member 'UMainMenu_MateriaEquipTop_C::EquipCell_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, EquipCell_Top) == 0x000750, "Member 'UMainMenu_MateriaEquipTop_C::EquipCell_Top' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, EquipCharaMenu) == 0x000758, "Member 'UMainMenu_MateriaEquipTop_C::EquipCharaMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, EquipListMenu) == 0x000760, "Member 'UMainMenu_MateriaEquipTop_C::EquipListMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, IconList) == 0x000768, "Member 'UMainMenu_MateriaEquipTop_C::IconList' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Light) == 0x000770, "Member 'UMainMenu_MateriaEquipTop_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, LightBg00) == 0x000778, "Member 'UMainMenu_MateriaEquipTop_C::LightBg00' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, ListEndIcon) == 0x000780, "Member 'UMainMenu_MateriaEquipTop_C::ListEndIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, MateriaList) == 0x000788, "Member 'UMainMenu_MateriaEquipTop_C::MateriaList' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, MateriaListMenu) == 0x000790, "Member 'UMainMenu_MateriaEquipTop_C::MateriaListMenu' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Ring1) == 0x000798, "Member 'UMainMenu_MateriaEquipTop_C::Ring1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Ring2) == 0x0007A0, "Member 'UMainMenu_MateriaEquipTop_C::Ring2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Ring3) == 0x0007A8, "Member 'UMainMenu_MateriaEquipTop_C::Ring3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Ring4) == 0x0007B0, "Member 'UMainMenu_MateriaEquipTop_C::Ring4' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, StatusList) == 0x0007B8, "Member 'UMainMenu_MateriaEquipTop_C::StatusList' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Txt_SpTitle) == 0x0007C0, "Member 'UMainMenu_MateriaEquipTop_C::Txt_SpTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Win_01) == 0x0007C8, "Member 'UMainMenu_MateriaEquipTop_C::Win_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Win_02) == 0x0007D0, "Member 'UMainMenu_MateriaEquipTop_C::Win_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipTop_C, Win_03) == 0x0007D8, "Member 'UMainMenu_MateriaEquipTop_C::Win_03' has a wrong offset!");

}

