#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_CircleGauge

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_WeaponUpgrade_CircleGauge.MainMenu_WeaponUpgrade_CircleGauge_C
// 0x0078 (0x03D8 - 0x0360)
class UMainMenu_WeaponUpgrade_CircleGauge_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Balloon_Left;                                      // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Balloon_Right;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base3;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base4;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base5;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CenterLine;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_Gauge_C*        CircleGauge;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Max;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Start;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Total;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Used;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ObliqueLine;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              UnderLine;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_WeaponUpgrade_CircleGauge_C">();
	}
	static class UMainMenu_WeaponUpgrade_CircleGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_WeaponUpgrade_CircleGauge_C>();
	}
};
static_assert(alignof(UMainMenu_WeaponUpgrade_CircleGauge_C) == 0x000008, "Wrong alignment on UMainMenu_WeaponUpgrade_CircleGauge_C");
static_assert(sizeof(UMainMenu_WeaponUpgrade_CircleGauge_C) == 0x0003D8, "Wrong size on UMainMenu_WeaponUpgrade_CircleGauge_C");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Balloon_Left) == 0x000360, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Balloon_Left' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Balloon_Right) == 0x000368, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Balloon_Right' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Base1) == 0x000370, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Base1' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Base2) == 0x000378, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Base2' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Base3) == 0x000380, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Base3' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Base4) == 0x000388, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Base4' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Base5) == 0x000390, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Base5' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, CenterLine) == 0x000398, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::CenterLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, CircleGauge) == 0x0003A0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::CircleGauge' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Icon_Max) == 0x0003A8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Icon_Max' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Icon_Start) == 0x0003B0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Icon_Start' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Icon_Total) == 0x0003B8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Icon_Total' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, Icon_Used) == 0x0003C0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::Icon_Used' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, ObliqueLine) == 0x0003C8, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::ObliqueLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_WeaponUpgrade_CircleGauge_C, UnderLine) == 0x0003D0, "Member 'UMainMenu_WeaponUpgrade_CircleGauge_C::UnderLine' has a wrong offset!");

}

