#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_MateriaEquipStatusCell

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_MateriaEquipStatusCell.MainMenu_MateriaEquipStatusCell_C
// 0x0458 (0x07B8 - 0x0360)
class UMainMenu_MateriaEquipStatusCell_C final : public UEndMenuMateriaEquipCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UEndProgressBar*                        Gauge_Ap;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_1;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_2;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_3;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Status_C*                Icon_Status_4;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Exp_Gauge_Waku;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_MateriaValue;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_StatusValue;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ApInfo;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ApTitle;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Lv;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Lv_Title;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusValue_1;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusValue_2;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusValue_3;                                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusValue_4;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPlayerType                                   PlayerType;                                        // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEndDataTableEquipment                 Equip;                                             // 0x03F0(0x0278)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FEndDataTableMateria                   Material;                                          // 0x0668(0x0150)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MainMenu_MateriaEquipStatusCell(int32 EntryPoint);
	void OnUpdateMaterialStatus(const class FString& ApStr, float Percent);
	void Construct();
	void OnUpdateEquipStatus(const struct FEndDataTableEquipment& equipment);
	void OnUpdateEquipUpgradedStatus(int32 Attack, int32 Defense, int32 MagicAttack, int32 MagicDefense, int32 AttackAdd, int32 DefenseAdd, int32 MagicAttackAdd, int32 MagicDefenseAdd);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_MateriaEquipStatusCell_C">();
	}
	static class UMainMenu_MateriaEquipStatusCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_MateriaEquipStatusCell_C>();
	}
};
static_assert(alignof(UMainMenu_MateriaEquipStatusCell_C) == 0x000008, "Wrong alignment on UMainMenu_MateriaEquipStatusCell_C");
static_assert(sizeof(UMainMenu_MateriaEquipStatusCell_C) == 0x0007B8, "Wrong size on UMainMenu_MateriaEquipStatusCell_C");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_MateriaEquipStatusCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Gauge_Ap) == 0x000368, "Member 'UMainMenu_MateriaEquipStatusCell_C::Gauge_Ap' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Icon_Status_1) == 0x000370, "Member 'UMainMenu_MateriaEquipStatusCell_C::Icon_Status_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Icon_Status_2) == 0x000378, "Member 'UMainMenu_MateriaEquipStatusCell_C::Icon_Status_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Icon_Status_3) == 0x000380, "Member 'UMainMenu_MateriaEquipStatusCell_C::Icon_Status_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Icon_Status_4) == 0x000388, "Member 'UMainMenu_MateriaEquipStatusCell_C::Icon_Status_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Img_Exp_Gauge_Waku) == 0x000390, "Member 'UMainMenu_MateriaEquipStatusCell_C::Img_Exp_Gauge_Waku' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Pnl_MateriaValue) == 0x000398, "Member 'UMainMenu_MateriaEquipStatusCell_C::Pnl_MateriaValue' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Pnl_StatusValue) == 0x0003A0, "Member 'UMainMenu_MateriaEquipStatusCell_C::Pnl_StatusValue' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_ApInfo) == 0x0003A8, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_ApInfo' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_ApTitle) == 0x0003B0, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_ApTitle' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_Lv) == 0x0003B8, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_Lv' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_Lv_Title) == 0x0003C0, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_Lv_Title' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_StatusValue_1) == 0x0003C8, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_StatusValue_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_StatusValue_2) == 0x0003D0, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_StatusValue_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_StatusValue_3) == 0x0003D8, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_StatusValue_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Txt_StatusValue_4) == 0x0003E0, "Member 'UMainMenu_MateriaEquipStatusCell_C::Txt_StatusValue_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, PlayerType) == 0x0003E8, "Member 'UMainMenu_MateriaEquipStatusCell_C::PlayerType' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Equip) == 0x0003F0, "Member 'UMainMenu_MateriaEquipStatusCell_C::Equip' has a wrong offset!");
static_assert(offsetof(UMainMenu_MateriaEquipStatusCell_C, Material) == 0x000668, "Member 'UMainMenu_MateriaEquipStatusCell_C::Material' has a wrong offset!");

}

