#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_WeaponUpgrade_EquipTop3

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_WeaponUpgrade_EquipTop3.MainMenu_WeaponUpgrade_EquipTop3_C.ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3
// 0x0098 (0x0098 - 0x0000)
struct MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerType                                   K2Node_Event_PlayerType;                           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UEndImage*                              K2Node_Event_widget;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_Event_Sprite;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAnimationByName_ReturnValue2;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromSprite_ReturnValue;          // 0x0020(0x0078)()
};
static_assert(alignof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3) == 0x000008, "Wrong alignment on MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3");
static_assert(sizeof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3) == 0x000098, "Wrong size on MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3, EntryPoint) == 0x000000, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3, CallFunc_PlayAnimationByName_ReturnValue) == 0x000004, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3::CallFunc_PlayAnimationByName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3, K2Node_Event_PlayerType) == 0x000005, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3::K2Node_Event_PlayerType' has a wrong offset!");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3, K2Node_Event_widget) == 0x000008, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3::K2Node_Event_widget' has a wrong offset!");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3, K2Node_Event_Sprite) == 0x000010, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3::K2Node_Event_Sprite' has a wrong offset!");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3, CallFunc_PlayAnimationByName_ReturnValue2) == 0x000018, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3::CallFunc_PlayAnimationByName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3, CallFunc_MakeBrushFromSprite_ReturnValue) == 0x000020, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_ExecuteUbergraph_MainMenu_WeaponUpgrade_EquipTop3::CallFunc_MakeBrushFromSprite_ReturnValue' has a wrong offset!");

// Function MainMenu_WeaponUpgrade_EquipTop3.MainMenu_WeaponUpgrade_EquipTop3_C.UpdateCharaImage
// 0x0018 (0x0018 - 0x0000)
struct MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage final
{
public:
	EPlayerType                                   PlayerType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEndImage*                              Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           Sprite;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage) == 0x000008, "Wrong alignment on MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage");
static_assert(sizeof(MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage) == 0x000018, "Wrong size on MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage, PlayerType) == 0x000000, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage::PlayerType' has a wrong offset!");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage, Widget) == 0x000008, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage::Widget' has a wrong offset!");
static_assert(offsetof(MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage, Sprite) == 0x000010, "Member 'MainMenu_WeaponUpgrade_EquipTop3_C_UpdateCharaImage::Sprite' has a wrong offset!");

}

