#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_TopStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_TopStatus.MainMenu_TopStatus_C
// 0x0228 (0x0598 - 0x0370)
class UMainMenu_TopStatus_C final : public UEndPlayerStatusPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       BattleLeaderMark;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       TopStatus_In;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_8;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_12;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_Exp;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_Limit;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverLight1;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverLight2;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverLight3;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_BattleLeader;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BgEffact1;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BgEffact2;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BgEffact3;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BgEffact5;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Exp_Gauge_BG;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Exp_Gauge_Waku;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Level_BG;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Limit_Gauge_BG;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Limit_Gauge_Waku;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Name_BG;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Name_BGLight;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Player;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_00;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_01;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Slash_03;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_00;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_01;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_02;                                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_03;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MarkBase;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MarkFrame;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Noise_01;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Noise_02;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Noise_03;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Noise_04;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              StatusBase2;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              StatusLine;                                        // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Exp;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Exp_Num;                                       // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Exp_Total;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HP_Num;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Hp_Total;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Level;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Level_Num;                                     // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_MP_Num;                                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Mp_Total;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name_00;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name_01;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Sp_Num;                                        // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_WeaponLv;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPlayerType                                   PlayerType;                                        // 0x0550(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_551[0x3];                                      // 0x0551(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExpBase;                                           // 0x0554(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExpNext;                                           // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExpNow;                                            // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LimitNow;                                          // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LimitMax;                                          // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSoftObjectPath>                BillBoardPath;                                     // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FText>                           FirstNames;                                        // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FText>                           LastNames;                                         // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MainMenu_TopStatus(int32 EntryPoint);
	void Construct();
	void OnSetupStatusPanel(EPlayerType PlayerType_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_TopStatus_C">();
	}
	static class UMainMenu_TopStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_TopStatus_C>();
	}
};
static_assert(alignof(UMainMenu_TopStatus_C) == 0x000008, "Wrong alignment on UMainMenu_TopStatus_C");
static_assert(sizeof(UMainMenu_TopStatus_C) == 0x000598, "Wrong size on UMainMenu_TopStatus_C");
static_assert(offsetof(UMainMenu_TopStatus_C, UberGraphFrame) == 0x000370, "Member 'UMainMenu_TopStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, BattleLeaderMark) == 0x000378, "Member 'UMainMenu_TopStatus_C::BattleLeaderMark' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, TopStatus_In) == 0x000380, "Member 'UMainMenu_TopStatus_C::TopStatus_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_0) == 0x000388, "Member 'UMainMenu_TopStatus_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_1) == 0x000390, "Member 'UMainMenu_TopStatus_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_2) == 0x000398, "Member 'UMainMenu_TopStatus_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_3) == 0x0003A0, "Member 'UMainMenu_TopStatus_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_4) == 0x0003A8, "Member 'UMainMenu_TopStatus_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_5) == 0x0003B0, "Member 'UMainMenu_TopStatus_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_6) == 0x0003B8, "Member 'UMainMenu_TopStatus_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_7) == 0x0003C0, "Member 'UMainMenu_TopStatus_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_8) == 0x0003C8, "Member 'UMainMenu_TopStatus_C::EndImage_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, EndImage_12) == 0x0003D0, "Member 'UMainMenu_TopStatus_C::EndImage_12' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Gauge_Exp) == 0x0003D8, "Member 'UMainMenu_TopStatus_C::Gauge_Exp' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Gauge_Limit) == 0x0003E0, "Member 'UMainMenu_TopStatus_C::Gauge_Limit' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, HoverLight1) == 0x0003E8, "Member 'UMainMenu_TopStatus_C::HoverLight1' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, HoverLight2) == 0x0003F0, "Member 'UMainMenu_TopStatus_C::HoverLight2' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, HoverLight3) == 0x0003F8, "Member 'UMainMenu_TopStatus_C::HoverLight3' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Icon_BattleLeader) == 0x000400, "Member 'UMainMenu_TopStatus_C::Icon_BattleLeader' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_BgEffact1) == 0x000408, "Member 'UMainMenu_TopStatus_C::Img_BgEffact1' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_BgEffact2) == 0x000410, "Member 'UMainMenu_TopStatus_C::Img_BgEffact2' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_BgEffact3) == 0x000418, "Member 'UMainMenu_TopStatus_C::Img_BgEffact3' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_BgEffact5) == 0x000420, "Member 'UMainMenu_TopStatus_C::Img_BgEffact5' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Exp_Gauge_BG) == 0x000428, "Member 'UMainMenu_TopStatus_C::Img_Exp_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Exp_Gauge_Waku) == 0x000430, "Member 'UMainMenu_TopStatus_C::Img_Exp_Gauge_Waku' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Level_BG) == 0x000438, "Member 'UMainMenu_TopStatus_C::Img_Level_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Limit_Gauge_BG) == 0x000440, "Member 'UMainMenu_TopStatus_C::Img_Limit_Gauge_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Limit_Gauge_Waku) == 0x000448, "Member 'UMainMenu_TopStatus_C::Img_Limit_Gauge_Waku' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Name_BG) == 0x000450, "Member 'UMainMenu_TopStatus_C::Img_Name_BG' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Name_BGLight) == 0x000458, "Member 'UMainMenu_TopStatus_C::Img_Name_BGLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Player) == 0x000460, "Member 'UMainMenu_TopStatus_C::Img_Player' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Slash_00) == 0x000468, "Member 'UMainMenu_TopStatus_C::Img_Slash_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Slash_01) == 0x000470, "Member 'UMainMenu_TopStatus_C::Img_Slash_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Img_Slash_03) == 0x000478, "Member 'UMainMenu_TopStatus_C::Img_Slash_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Light) == 0x000480, "Member 'UMainMenu_TopStatus_C::Light' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Line_00) == 0x000488, "Member 'UMainMenu_TopStatus_C::Line_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Line_01) == 0x000490, "Member 'UMainMenu_TopStatus_C::Line_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Line_02) == 0x000498, "Member 'UMainMenu_TopStatus_C::Line_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Line_03) == 0x0004A0, "Member 'UMainMenu_TopStatus_C::Line_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, MarkBase) == 0x0004A8, "Member 'UMainMenu_TopStatus_C::MarkBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, MarkFrame) == 0x0004B0, "Member 'UMainMenu_TopStatus_C::MarkFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Noise_01) == 0x0004B8, "Member 'UMainMenu_TopStatus_C::Noise_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Noise_02) == 0x0004C0, "Member 'UMainMenu_TopStatus_C::Noise_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Noise_03) == 0x0004C8, "Member 'UMainMenu_TopStatus_C::Noise_03' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Noise_04) == 0x0004D0, "Member 'UMainMenu_TopStatus_C::Noise_04' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, StatusBase2) == 0x0004D8, "Member 'UMainMenu_TopStatus_C::StatusBase2' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, StatusLine) == 0x0004E0, "Member 'UMainMenu_TopStatus_C::StatusLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Exp) == 0x0004E8, "Member 'UMainMenu_TopStatus_C::Txt_Exp' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Exp_Num) == 0x0004F0, "Member 'UMainMenu_TopStatus_C::Txt_Exp_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Exp_Total) == 0x0004F8, "Member 'UMainMenu_TopStatus_C::Txt_Exp_Total' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_HP_Num) == 0x000500, "Member 'UMainMenu_TopStatus_C::Txt_HP_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Hp_Total) == 0x000508, "Member 'UMainMenu_TopStatus_C::Txt_Hp_Total' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Level) == 0x000510, "Member 'UMainMenu_TopStatus_C::Txt_Level' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Level_Num) == 0x000518, "Member 'UMainMenu_TopStatus_C::Txt_Level_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_MP_Num) == 0x000520, "Member 'UMainMenu_TopStatus_C::Txt_MP_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Mp_Total) == 0x000528, "Member 'UMainMenu_TopStatus_C::Txt_Mp_Total' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Name_00) == 0x000530, "Member 'UMainMenu_TopStatus_C::Txt_Name_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Name_01) == 0x000538, "Member 'UMainMenu_TopStatus_C::Txt_Name_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_Sp_Num) == 0x000540, "Member 'UMainMenu_TopStatus_C::Txt_Sp_Num' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, Txt_WeaponLv) == 0x000548, "Member 'UMainMenu_TopStatus_C::Txt_WeaponLv' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, PlayerType) == 0x000550, "Member 'UMainMenu_TopStatus_C::PlayerType' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, ExpBase) == 0x000554, "Member 'UMainMenu_TopStatus_C::ExpBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, ExpNext) == 0x000558, "Member 'UMainMenu_TopStatus_C::ExpNext' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, ExpNow) == 0x00055C, "Member 'UMainMenu_TopStatus_C::ExpNow' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, LimitNow) == 0x000560, "Member 'UMainMenu_TopStatus_C::LimitNow' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, LimitMax) == 0x000564, "Member 'UMainMenu_TopStatus_C::LimitMax' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, BillBoardPath) == 0x000568, "Member 'UMainMenu_TopStatus_C::BillBoardPath' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, FirstNames) == 0x000578, "Member 'UMainMenu_TopStatus_C::FirstNames' has a wrong offset!");
static_assert(offsetof(UMainMenu_TopStatus_C, LastNames) == 0x000588, "Member 'UMainMenu_TopStatus_C::LastNames' has a wrong offset!");

}

