#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EquipListMenu

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EquipListMenu.MainMenu_EquipListMenu_C
// 0x0028 (0x0388 - 0x0360)
class UMainMenu_EquipListMenu_C final : public UEndUserWidget
{
public:
	class UEndImage*                              LeftLine;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   LeftMenu_ScrollBox;                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TitleValue;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EquipListMenu_C">();
	}
	static class UMainMenu_EquipListMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EquipListMenu_C>();
	}
};
static_assert(alignof(UMainMenu_EquipListMenu_C) == 0x000008, "Wrong alignment on UMainMenu_EquipListMenu_C");
static_assert(sizeof(UMainMenu_EquipListMenu_C) == 0x000388, "Wrong size on UMainMenu_EquipListMenu_C");
static_assert(offsetof(UMainMenu_EquipListMenu_C, LeftLine) == 0x000360, "Member 'UMainMenu_EquipListMenu_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipListMenu_C, LeftMenu_ScrollBox) == 0x000368, "Member 'UMainMenu_EquipListMenu_C::LeftMenu_ScrollBox' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipListMenu_C, ListBg2) == 0x000370, "Member 'UMainMenu_EquipListMenu_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipListMenu_C, Txt_Title) == 0x000378, "Member 'UMainMenu_EquipListMenu_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipListMenu_C, Txt_TitleValue) == 0x000380, "Member 'UMainMenu_EquipListMenu_C::Txt_TitleValue' has a wrong offset!");

}

