#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EquipSelect_Cell_05Light

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EquipSelect_Cell_05Light.MainMenu_EquipSelect_Cell_05Light_C
// 0x0030 (0x0390 - 0x0360)
class UMainMenu_EquipSelect_Cell_05Light_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_EquipSelect_Cell_05Light(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EquipSelect_Cell_05Light_C">();
	}
	static class UMainMenu_EquipSelect_Cell_05Light_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EquipSelect_Cell_05Light_C>();
	}
};
static_assert(alignof(UMainMenu_EquipSelect_Cell_05Light_C) == 0x000008, "Wrong alignment on UMainMenu_EquipSelect_Cell_05Light_C");
static_assert(sizeof(UMainMenu_EquipSelect_Cell_05Light_C) == 0x000390, "Wrong size on UMainMenu_EquipSelect_Cell_05Light_C");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_05Light_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_EquipSelect_Cell_05Light_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_05Light_C, In) == 0x000368, "Member 'UMainMenu_EquipSelect_Cell_05Light_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_05Light_C, Loop) == 0x000370, "Member 'UMainMenu_EquipSelect_Cell_05Light_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_05Light_C, BtnLight) == 0x000378, "Member 'UMainMenu_EquipSelect_Cell_05Light_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_05Light_C, BtnLight2) == 0x000380, "Member 'UMainMenu_EquipSelect_Cell_05Light_C::BtnLight2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EquipSelect_Cell_05Light_C, HoverBase) == 0x000388, "Member 'UMainMenu_EquipSelect_Cell_05Light_C::HoverBase' has a wrong offset!");

}

