#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EnemyReport_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EnemyReport_Btn.MainMenu_EnemyReport_Btn_C
// 0x0048 (0x03D8 - 0x0390)
class UMainMenu_EnemyReport_Btn_C final : public UEndMainItemSelectBtnText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       BtnTarget;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnNormal;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnTargetIcon;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Loupe;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_New;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ReportTitle;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_EnemyReport_Btn(int32 EntryPoint);
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_40_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SelectBtn_K2Node_ComponentBoundEvent_53_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EnemyReport_Btn_C">();
	}
	static class UMainMenu_EnemyReport_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EnemyReport_Btn_C>();
	}
};
static_assert(alignof(UMainMenu_EnemyReport_Btn_C) == 0x000008, "Wrong alignment on UMainMenu_EnemyReport_Btn_C");
static_assert(sizeof(UMainMenu_EnemyReport_Btn_C) == 0x0003D8, "Wrong size on UMainMenu_EnemyReport_Btn_C");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, UberGraphFrame) == 0x000390, "Member 'UMainMenu_EnemyReport_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, BtnTarget) == 0x000398, "Member 'UMainMenu_EnemyReport_Btn_C::BtnTarget' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, BtnNormal) == 0x0003A0, "Member 'UMainMenu_EnemyReport_Btn_C::BtnNormal' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, BtnHover) == 0x0003A8, "Member 'UMainMenu_EnemyReport_Btn_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, BtnTargetIcon) == 0x0003B0, "Member 'UMainMenu_EnemyReport_Btn_C::BtnTargetIcon' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, HoverBase) == 0x0003B8, "Member 'UMainMenu_EnemyReport_Btn_C::HoverBase' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, Icon_Loupe) == 0x0003C0, "Member 'UMainMenu_EnemyReport_Btn_C::Icon_Loupe' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, Icon_New) == 0x0003C8, "Member 'UMainMenu_EnemyReport_Btn_C::Icon_New' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Btn_C, Txt_ReportTitle) == 0x0003D0, "Member 'UMainMenu_EnemyReport_Btn_C::Txt_ReportTitle' has a wrong offset!");

}

