#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Manual_Detail

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Manual_Detail.MainMenu_Manual_Detail_C
// 0x00F0 (0x0658 - 0x0568)
class UMainMenu_Manual_Detail_C final : public UEndMainManualDetailMenu
{
public:
	class UEndImage*                              Base_10;                                           // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_11;                                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_12;                                           // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_20;                                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_21;                                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_22;                                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_30;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_31;                                           // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_32;                                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_40;                                           // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_41;                                           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_42;                                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_00;                                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_01;                                           // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_02;                                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_10;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_11;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_12;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_20;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_21;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_22;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_30;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_31;                                         // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_32;                                         // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_40;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_41;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_42;                                         // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_00;                                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_01;                                         // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_02;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Manual_Detail_C">();
	}
	static class UMainMenu_Manual_Detail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Manual_Detail_C>();
	}
};
static_assert(alignof(UMainMenu_Manual_Detail_C) == 0x000008, "Wrong alignment on UMainMenu_Manual_Detail_C");
static_assert(sizeof(UMainMenu_Manual_Detail_C) == 0x000658, "Wrong size on UMainMenu_Manual_Detail_C");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_10) == 0x000568, "Member 'UMainMenu_Manual_Detail_C::Base_10' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_11) == 0x000570, "Member 'UMainMenu_Manual_Detail_C::Base_11' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_12) == 0x000578, "Member 'UMainMenu_Manual_Detail_C::Base_12' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_20) == 0x000580, "Member 'UMainMenu_Manual_Detail_C::Base_20' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_21) == 0x000588, "Member 'UMainMenu_Manual_Detail_C::Base_21' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_22) == 0x000590, "Member 'UMainMenu_Manual_Detail_C::Base_22' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_30) == 0x000598, "Member 'UMainMenu_Manual_Detail_C::Base_30' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_31) == 0x0005A0, "Member 'UMainMenu_Manual_Detail_C::Base_31' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_32) == 0x0005A8, "Member 'UMainMenu_Manual_Detail_C::Base_32' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_40) == 0x0005B0, "Member 'UMainMenu_Manual_Detail_C::Base_40' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_41) == 0x0005B8, "Member 'UMainMenu_Manual_Detail_C::Base_41' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_42) == 0x0005C0, "Member 'UMainMenu_Manual_Detail_C::Base_42' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_00) == 0x0005C8, "Member 'UMainMenu_Manual_Detail_C::Base_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_01) == 0x0005D0, "Member 'UMainMenu_Manual_Detail_C::Base_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Base_02) == 0x0005D8, "Member 'UMainMenu_Manual_Detail_C::Base_02' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_10) == 0x0005E0, "Member 'UMainMenu_Manual_Detail_C::Shadow_10' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_11) == 0x0005E8, "Member 'UMainMenu_Manual_Detail_C::Shadow_11' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_12) == 0x0005F0, "Member 'UMainMenu_Manual_Detail_C::Shadow_12' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_20) == 0x0005F8, "Member 'UMainMenu_Manual_Detail_C::Shadow_20' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_21) == 0x000600, "Member 'UMainMenu_Manual_Detail_C::Shadow_21' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_22) == 0x000608, "Member 'UMainMenu_Manual_Detail_C::Shadow_22' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_30) == 0x000610, "Member 'UMainMenu_Manual_Detail_C::Shadow_30' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_31) == 0x000618, "Member 'UMainMenu_Manual_Detail_C::Shadow_31' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_32) == 0x000620, "Member 'UMainMenu_Manual_Detail_C::Shadow_32' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_40) == 0x000628, "Member 'UMainMenu_Manual_Detail_C::Shadow_40' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_41) == 0x000630, "Member 'UMainMenu_Manual_Detail_C::Shadow_41' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_42) == 0x000638, "Member 'UMainMenu_Manual_Detail_C::Shadow_42' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_00) == 0x000640, "Member 'UMainMenu_Manual_Detail_C::Shadow_00' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_01) == 0x000648, "Member 'UMainMenu_Manual_Detail_C::Shadow_01' has a wrong offset!");
static_assert(offsetof(UMainMenu_Manual_Detail_C, Shadow_02) == 0x000650, "Member 'UMainMenu_Manual_Detail_C::Shadow_02' has a wrong offset!");

}

