#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_StatusCell_Title2

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_StatusCell_Title2.MainMenu_StatusCell_Title2_C
// 0x0018 (0x0378 - 0x0360)
class UMainMenu_StatusCell_Title2_C final : public UEndMainEquipSelectCell
{
public:
	class UEndImage*                              Dot1;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot2;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_StatusCell_Title2_C">();
	}
	static class UMainMenu_StatusCell_Title2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_StatusCell_Title2_C>();
	}
};
static_assert(alignof(UMainMenu_StatusCell_Title2_C) == 0x000008, "Wrong alignment on UMainMenu_StatusCell_Title2_C");
static_assert(sizeof(UMainMenu_StatusCell_Title2_C) == 0x000378, "Wrong size on UMainMenu_StatusCell_Title2_C");
static_assert(offsetof(UMainMenu_StatusCell_Title2_C, Dot1) == 0x000360, "Member 'UMainMenu_StatusCell_Title2_C::Dot1' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_Title2_C, Dot2) == 0x000368, "Member 'UMainMenu_StatusCell_Title2_C::Dot2' has a wrong offset!");
static_assert(offsetof(UMainMenu_StatusCell_Title2_C, Txt_Title) == 0x000370, "Member 'UMainMenu_StatusCell_Title2_C::Txt_Title' has a wrong offset!");

}

