#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_SaveData_Test

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_SaveData_Test.MainMenu_SaveData_Test_C
// 0x0030 (0x0490 - 0x0460)
class UMainMenu_SaveData_Test_C final : public UEndMainSaveLoadMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_SaveData;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Img;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_SaveData_Test(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_SaveData_Test_C">();
	}
	static class UMainMenu_SaveData_Test_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_SaveData_Test_C>();
	}
};
static_assert(alignof(UMainMenu_SaveData_Test_C) == 0x000008, "Wrong alignment on UMainMenu_SaveData_Test_C");
static_assert(sizeof(UMainMenu_SaveData_Test_C) == 0x000490, "Wrong size on UMainMenu_SaveData_Test_C");
static_assert(offsetof(UMainMenu_SaveData_Test_C, UberGraphFrame) == 0x000460, "Member 'UMainMenu_SaveData_Test_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveData_Test_C, Menu_In) == 0x000468, "Member 'UMainMenu_SaveData_Test_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveData_Test_C, All_SaveData) == 0x000470, "Member 'UMainMenu_SaveData_Test_C::All_SaveData' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveData_Test_C, Billboard_Img) == 0x000478, "Member 'UMainMenu_SaveData_Test_C::Billboard_Img' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveData_Test_C, LeftLine) == 0x000480, "Member 'UMainMenu_SaveData_Test_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_SaveData_Test_C, ListBg2) == 0x000488, "Member 'UMainMenu_SaveData_Test_C::ListBg2' has a wrong offset!");

}

