#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Tutorial_Window

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Tutorial_Window.MainMenu_Tutorial_Window_C
// 0x0058 (0x03C0 - 0x0368)
class UMainMenu_Tutorial_Window_C final : public UEndDescriptionWindow
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              L_B1;                                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              L_B2;                                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              L_Top1;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              L_Top2;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Tutorial_Window_C">();
	}
	static class UMainMenu_Tutorial_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Tutorial_Window_C>();
	}
};
static_assert(alignof(UMainMenu_Tutorial_Window_C) == 0x000008, "Wrong alignment on UMainMenu_Tutorial_Window_C");
static_assert(sizeof(UMainMenu_Tutorial_Window_C) == 0x0003C0, "Wrong size on UMainMenu_Tutorial_Window_C");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, Out) == 0x000368, "Member 'UMainMenu_Tutorial_Window_C::Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, In) == 0x000370, "Member 'UMainMenu_Tutorial_Window_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, EndImage_4) == 0x000378, "Member 'UMainMenu_Tutorial_Window_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, EndImage_5) == 0x000380, "Member 'UMainMenu_Tutorial_Window_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, EndImage_6) == 0x000388, "Member 'UMainMenu_Tutorial_Window_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, EndImage_7) == 0x000390, "Member 'UMainMenu_Tutorial_Window_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, Frame) == 0x000398, "Member 'UMainMenu_Tutorial_Window_C::Frame' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, L_B1) == 0x0003A0, "Member 'UMainMenu_Tutorial_Window_C::L_B1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, L_B2) == 0x0003A8, "Member 'UMainMenu_Tutorial_Window_C::L_B2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, L_Top1) == 0x0003B0, "Member 'UMainMenu_Tutorial_Window_C::L_Top1' has a wrong offset!");
static_assert(offsetof(UMainMenu_Tutorial_Window_C, L_Top2) == 0x0003B8, "Member 'UMainMenu_Tutorial_Window_C::L_Top2' has a wrong offset!");

}

