#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_ChapterSelect_BtnLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_ChapterSelect_BtnLight.MainMenu_ChapterSelect_BtnLight_C
// 0x0028 (0x0388 - 0x0360)
class UMainMenu_ChapterSelect_BtnLight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MainMenu_ChapterSelect_BtnLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_ChapterSelect_BtnLight_C">();
	}
	static class UMainMenu_ChapterSelect_BtnLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_ChapterSelect_BtnLight_C>();
	}
};
static_assert(alignof(UMainMenu_ChapterSelect_BtnLight_C) == 0x000008, "Wrong alignment on UMainMenu_ChapterSelect_BtnLight_C");
static_assert(sizeof(UMainMenu_ChapterSelect_BtnLight_C) == 0x000388, "Wrong size on UMainMenu_ChapterSelect_BtnLight_C");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, UberGraphFrame) == 0x000360, "Member 'UMainMenu_ChapterSelect_BtnLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, Loop) == 0x000368, "Member 'UMainMenu_ChapterSelect_BtnLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, BtnLight) == 0x000370, "Member 'UMainMenu_ChapterSelect_BtnLight_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, BtnLight2) == 0x000378, "Member 'UMainMenu_ChapterSelect_BtnLight_C::BtnLight2' has a wrong offset!");
static_assert(offsetof(UMainMenu_ChapterSelect_BtnLight_C, HoverBase) == 0x000380, "Member 'UMainMenu_ChapterSelect_BtnLight_C::HoverBase' has a wrong offset!");

}

