#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_Options_SelectList3

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_Options_SelectList3.MainMenu_Options_SelectList3_C
// 0x0038 (0x0398 - 0x0360)
class UMainMenu_Options_SelectList3_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Graphic_Preview;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Preview;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Preview2;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndListBox*                            SelectList;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow2;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_Options_SelectList3_C">();
	}
	static class UMainMenu_Options_SelectList3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_Options_SelectList3_C>();
	}
};
static_assert(alignof(UMainMenu_Options_SelectList3_C) == 0x000008, "Wrong alignment on UMainMenu_Options_SelectList3_C");
static_assert(sizeof(UMainMenu_Options_SelectList3_C) == 0x000398, "Wrong size on UMainMenu_Options_SelectList3_C");
static_assert(offsetof(UMainMenu_Options_SelectList3_C, Graphic_Preview) == 0x000360, "Member 'UMainMenu_Options_SelectList3_C::Graphic_Preview' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList3_C, In) == 0x000368, "Member 'UMainMenu_Options_SelectList3_C::In' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList3_C, Base) == 0x000370, "Member 'UMainMenu_Options_SelectList3_C::Base' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList3_C, Img_Preview) == 0x000378, "Member 'UMainMenu_Options_SelectList3_C::Img_Preview' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList3_C, Img_Preview2) == 0x000380, "Member 'UMainMenu_Options_SelectList3_C::Img_Preview2' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList3_C, SelectList) == 0x000388, "Member 'UMainMenu_Options_SelectList3_C::SelectList' has a wrong offset!");
static_assert(offsetof(UMainMenu_Options_SelectList3_C, Shadow2) == 0x000390, "Member 'UMainMenu_Options_SelectList3_C::Shadow2' has a wrong offset!");

}

