#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_EnemyReport_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainMenu_EnemyReport_Top.MainMenu_EnemyReport_Top_C
// 0x0100 (0x0A40 - 0x0940)
class UMainMenu_EnemyReport_Top_C final : public UEndEnemyReportMenu
{
public:
	class UWidgetAnimation*                       IconList_In;                                       // 0x0940(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_In;                                         // 0x0948(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_Out;                                        // 0x0950(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0958(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Controller_bg1;                                    // 0x0960(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0968(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0970(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0978(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0980(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0988(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0990(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x0998(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_8;                                        // 0x09A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_9;                                        // 0x09A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_10;                                       // 0x09B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_11;                                       // 0x09B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_12;                                       // 0x09C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_13;                                       // 0x09C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_14;                                       // 0x09D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_15;                                       // 0x09D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_16;                                       // 0x09E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2;                                            // 0x09E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame3;                                            // 0x09F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame4;                                            // 0x09F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame5;                                            // 0x0A00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame6;                                            // 0x0A08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_IconList_C*                   IconList;                                          // 0x0A10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x0A18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightBg01;                                         // 0x0A20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0A28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_EnemyReport_Window_C*         ReportWindow;                                      // 0x0A30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Right_bg1;                                         // 0x0A38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_EnemyReport_Top_C">();
	}
	static class UMainMenu_EnemyReport_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainMenu_EnemyReport_Top_C>();
	}
};
static_assert(alignof(UMainMenu_EnemyReport_Top_C) == 0x000008, "Wrong alignment on UMainMenu_EnemyReport_Top_C");
static_assert(sizeof(UMainMenu_EnemyReport_Top_C) == 0x000A40, "Wrong size on UMainMenu_EnemyReport_Top_C");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, IconList_In) == 0x000940, "Member 'UMainMenu_EnemyReport_Top_C::IconList_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Change_In) == 0x000948, "Member 'UMainMenu_EnemyReport_Top_C::Change_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Change_Out) == 0x000950, "Member 'UMainMenu_EnemyReport_Top_C::Change_Out' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Menu_In) == 0x000958, "Member 'UMainMenu_EnemyReport_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Controller_bg1) == 0x000960, "Member 'UMainMenu_EnemyReport_Top_C::Controller_bg1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_0) == 0x000968, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_1) == 0x000970, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_2) == 0x000978, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_3) == 0x000980, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_4) == 0x000988, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_5) == 0x000990, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_7) == 0x000998, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_8) == 0x0009A0, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_8' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_9) == 0x0009A8, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_9' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_10) == 0x0009B0, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_10' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_11) == 0x0009B8, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_11' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_12) == 0x0009C0, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_12' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_13) == 0x0009C8, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_13' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_14) == 0x0009D0, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_14' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_15) == 0x0009D8, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_15' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, EndImage_16) == 0x0009E0, "Member 'UMainMenu_EnemyReport_Top_C::EndImage_16' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Frame2) == 0x0009E8, "Member 'UMainMenu_EnemyReport_Top_C::Frame2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Frame3) == 0x0009F0, "Member 'UMainMenu_EnemyReport_Top_C::Frame3' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Frame4) == 0x0009F8, "Member 'UMainMenu_EnemyReport_Top_C::Frame4' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Frame5) == 0x000A00, "Member 'UMainMenu_EnemyReport_Top_C::Frame5' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Frame6) == 0x000A08, "Member 'UMainMenu_EnemyReport_Top_C::Frame6' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, IconList) == 0x000A10, "Member 'UMainMenu_EnemyReport_Top_C::IconList' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, LeftLine) == 0x000A18, "Member 'UMainMenu_EnemyReport_Top_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, LightBg01) == 0x000A20, "Member 'UMainMenu_EnemyReport_Top_C::LightBg01' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, ListBg2) == 0x000A28, "Member 'UMainMenu_EnemyReport_Top_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, ReportWindow) == 0x000A30, "Member 'UMainMenu_EnemyReport_Top_C::ReportWindow' has a wrong offset!");
static_assert(offsetof(UMainMenu_EnemyReport_Top_C, Right_bg1) == 0x000A38, "Member 'UMainMenu_EnemyReport_Top_C::Right_bg1' has a wrong offset!");

}

