#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_Range

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_Range.Map_Range_C
// 0x0018 (0x0378 - 0x0360)
class UMap_Range_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Sub;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Main;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCircle*                             Range;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_Range_C">();
	}
	static class UMap_Range_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_Range_C>();
	}
};
static_assert(alignof(UMap_Range_C) == 0x000008, "Wrong alignment on UMap_Range_C");
static_assert(sizeof(UMap_Range_C) == 0x000378, "Wrong size on UMap_Range_C");
static_assert(offsetof(UMap_Range_C, Sub) == 0x000360, "Member 'UMap_Range_C::Sub' has a wrong offset!");
static_assert(offsetof(UMap_Range_C, Main) == 0x000368, "Member 'UMap_Range_C::Main' has a wrong offset!");
static_assert(offsetof(UMap_Range_C, Range) == 0x000370, "Member 'UMap_Range_C::Range' has a wrong offset!");

}

