#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_LeftMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_LeftMenu.Map_LeftMenu_C
// 0x0020 (0x0380 - 0x0360)
class UMap_LeftMenu_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UEndImage*                              LeftLine;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   LeftMenu_ScrollBox;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListEndIcon;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Map_LeftMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_LeftMenu_C">();
	}
	static class UMap_LeftMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_LeftMenu_C>();
	}
};
static_assert(alignof(UMap_LeftMenu_C) == 0x000008, "Wrong alignment on UMap_LeftMenu_C");
static_assert(sizeof(UMap_LeftMenu_C) == 0x000380, "Wrong size on UMap_LeftMenu_C");
static_assert(offsetof(UMap_LeftMenu_C, UberGraphFrame) == 0x000360, "Member 'UMap_LeftMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenu_C, LeftLine) == 0x000368, "Member 'UMap_LeftMenu_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenu_C, LeftMenu_ScrollBox) == 0x000370, "Member 'UMap_LeftMenu_C::LeftMenu_ScrollBox' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenu_C, ListEndIcon) == 0x000378, "Member 'UMap_LeftMenu_C::ListEndIcon' has a wrong offset!");

}

