#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_Icon_Target

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_Icon_Target.Map_Icon_Target_C
// 0x0040 (0x03A0 - 0x0360)
class UMap_Icon_Target_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop_MapTarget_Quest;                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop_MapTarget_Side;                               // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop_MapTarget;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_00;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Cursor_01;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Circle_01;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Map_Icon_Target(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_Icon_Target_C">();
	}
	static class UMap_Icon_Target_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_Icon_Target_C>();
	}
};
static_assert(alignof(UMap_Icon_Target_C) == 0x000008, "Wrong alignment on UMap_Icon_Target_C");
static_assert(sizeof(UMap_Icon_Target_C) == 0x0003A0, "Wrong size on UMap_Icon_Target_C");
static_assert(offsetof(UMap_Icon_Target_C, UberGraphFrame) == 0x000360, "Member 'UMap_Icon_Target_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMap_Icon_Target_C, Loop) == 0x000368, "Member 'UMap_Icon_Target_C::Loop' has a wrong offset!");
static_assert(offsetof(UMap_Icon_Target_C, Loop_MapTarget_Quest) == 0x000370, "Member 'UMap_Icon_Target_C::Loop_MapTarget_Quest' has a wrong offset!");
static_assert(offsetof(UMap_Icon_Target_C, Loop_MapTarget_Side) == 0x000378, "Member 'UMap_Icon_Target_C::Loop_MapTarget_Side' has a wrong offset!");
static_assert(offsetof(UMap_Icon_Target_C, Loop_MapTarget) == 0x000380, "Member 'UMap_Icon_Target_C::Loop_MapTarget' has a wrong offset!");
static_assert(offsetof(UMap_Icon_Target_C, Cursor_00) == 0x000388, "Member 'UMap_Icon_Target_C::Cursor_00' has a wrong offset!");
static_assert(offsetof(UMap_Icon_Target_C, Cursor_01) == 0x000390, "Member 'UMap_Icon_Target_C::Cursor_01' has a wrong offset!");
static_assert(offsetof(UMap_Icon_Target_C, Img_Circle_01) == 0x000398, "Member 'UMap_Icon_Target_C::Img_Circle_01' has a wrong offset!");

}

