#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_LeftMenuCell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_LeftMenuCell.Map_LeftMenuCell_C
// 0x0038 (0x0398 - 0x0360)
class UMap_LeftMenuCell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           All_Nut_Icon;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Map_LeftMenuCell(int32 EntryPoint);
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_LeftMenuCell_C">();
	}
	static class UMap_LeftMenuCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_LeftMenuCell_C>();
	}
};
static_assert(alignof(UMap_LeftMenuCell_C) == 0x000008, "Wrong alignment on UMap_LeftMenuCell_C");
static_assert(sizeof(UMap_LeftMenuCell_C) == 0x000398, "Wrong size on UMap_LeftMenuCell_C");
static_assert(offsetof(UMap_LeftMenuCell_C, UberGraphFrame) == 0x000360, "Member 'UMap_LeftMenuCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCell_C, BtnHover) == 0x000368, "Member 'UMap_LeftMenuCell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCell_C, Menu_In) == 0x000370, "Member 'UMap_LeftMenuCell_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCell_C, All_Nut_Icon) == 0x000378, "Member 'UMap_LeftMenuCell_C::All_Nut_Icon' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCell_C, HoverBase) == 0x000380, "Member 'UMap_LeftMenuCell_C::HoverBase' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCell_C, MainMenu_Btn) == 0x000388, "Member 'UMap_LeftMenuCell_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCell_C, Txt_Title) == 0x000390, "Member 'UMap_LeftMenuCell_C::Txt_Title' has a wrong offset!");

}

