#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_LeftMenuCellLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Map_LeftMenuCellLight.Map_LeftMenuCellLight_C
// 0x0028 (0x0388 - 0x0360)
class UMap_LeftMenuCellLight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Map_LeftMenuCellLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Map_LeftMenuCellLight_C">();
	}
	static class UMap_LeftMenuCellLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMap_LeftMenuCellLight_C>();
	}
};
static_assert(alignof(UMap_LeftMenuCellLight_C) == 0x000008, "Wrong alignment on UMap_LeftMenuCellLight_C");
static_assert(sizeof(UMap_LeftMenuCellLight_C) == 0x000388, "Wrong size on UMap_LeftMenuCellLight_C");
static_assert(offsetof(UMap_LeftMenuCellLight_C, UberGraphFrame) == 0x000360, "Member 'UMap_LeftMenuCellLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCellLight_C, Loop) == 0x000368, "Member 'UMap_LeftMenuCellLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCellLight_C, BtnLight) == 0x000370, "Member 'UMap_LeftMenuCellLight_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCellLight_C, BtnLight2) == 0x000378, "Member 'UMap_LeftMenuCellLight_C::BtnLight2' has a wrong offset!");
static_assert(offsetof(UMap_LeftMenuCellLight_C, HoverBase) == 0x000380, "Member 'UMap_LeftMenuCellLight_C::HoverBase' has a wrong offset!");

}

