#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Materia_List3

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Materia_List3.Materia_List3_C
// 0x0120 (0x0480 - 0x0360)
class UMateria_List3_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       List_In;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LineOut;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2_frame;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase1;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase2;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase3;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame1;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame2;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnFrame3;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot1;                                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot2;                                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Equip1;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Equip2;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Summon;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft1;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft2;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft3;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight1;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight2;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight3;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line1;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line2;                                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_C*                        Materia_List1;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_C*                        Materia_List2;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMateria_List_Cell_C*                   Materia_Summon_Cell;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_01;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SummonLine;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn2;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn3;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Equip1;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Equip2;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Materia_List3_C">();
	}
	static class UMateria_List3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMateria_List3_C>();
	}
};
static_assert(alignof(UMateria_List3_C) == 0x000008, "Wrong alignment on UMateria_List3_C");
static_assert(sizeof(UMateria_List3_C) == 0x000480, "Wrong size on UMateria_List3_C");
static_assert(offsetof(UMateria_List3_C, List_In) == 0x000360, "Member 'UMateria_List3_C::List_In' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, LineOut) == 0x000368, "Member 'UMateria_List3_C::LineOut' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Selected) == 0x000370, "Member 'UMateria_List3_C::Selected' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Base) == 0x000378, "Member 'UMateria_List3_C::Base' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Base2) == 0x000380, "Member 'UMateria_List3_C::Base2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Base2_frame) == 0x000388, "Member 'UMateria_List3_C::Base2_frame' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, BtnBase1) == 0x000390, "Member 'UMateria_List3_C::BtnBase1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, BtnBase2) == 0x000398, "Member 'UMateria_List3_C::BtnBase2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, BtnBase3) == 0x0003A0, "Member 'UMateria_List3_C::BtnBase3' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, BtnFrame1) == 0x0003A8, "Member 'UMateria_List3_C::BtnFrame1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, BtnFrame2) == 0x0003B0, "Member 'UMateria_List3_C::BtnFrame2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, BtnFrame3) == 0x0003B8, "Member 'UMateria_List3_C::BtnFrame3' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Dot1) == 0x0003C0, "Member 'UMateria_List3_C::Dot1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Dot2) == 0x0003C8, "Member 'UMateria_List3_C::Dot2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Icon_Equip1) == 0x0003D0, "Member 'UMateria_List3_C::Icon_Equip1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Icon_Equip2) == 0x0003D8, "Member 'UMateria_List3_C::Icon_Equip2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Icon_Summon) == 0x0003E0, "Member 'UMateria_List3_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, IconLeft1) == 0x0003E8, "Member 'UMateria_List3_C::IconLeft1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, IconLeft2) == 0x0003F0, "Member 'UMateria_List3_C::IconLeft2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, IconLeft3) == 0x0003F8, "Member 'UMateria_List3_C::IconLeft3' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, IconRight1) == 0x000400, "Member 'UMateria_List3_C::IconRight1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, IconRight2) == 0x000408, "Member 'UMateria_List3_C::IconRight2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, IconRight3) == 0x000410, "Member 'UMateria_List3_C::IconRight3' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Line1) == 0x000418, "Member 'UMateria_List3_C::Line1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Line2) == 0x000420, "Member 'UMateria_List3_C::Line2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Materia_List1) == 0x000428, "Member 'UMateria_List3_C::Materia_List1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Materia_List2) == 0x000430, "Member 'UMateria_List3_C::Materia_List2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Materia_Summon_Cell) == 0x000438, "Member 'UMateria_List3_C::Materia_Summon_Cell' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Shadow_01) == 0x000440, "Member 'UMateria_List3_C::Shadow_01' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, SummonLine) == 0x000448, "Member 'UMateria_List3_C::SummonLine' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Txt_Btn) == 0x000450, "Member 'UMateria_List3_C::Txt_Btn' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Txt_Btn2) == 0x000458, "Member 'UMateria_List3_C::Txt_Btn2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Txt_Btn3) == 0x000460, "Member 'UMateria_List3_C::Txt_Btn3' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Txt_Equip1) == 0x000468, "Member 'UMateria_List3_C::Txt_Equip1' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Txt_Equip2) == 0x000470, "Member 'UMateria_List3_C::Txt_Equip2' has a wrong offset!");
static_assert(offsetof(UMateria_List3_C, Txt_Title) == 0x000478, "Member 'UMateria_List3_C::Txt_Title' has a wrong offset!");

}

