#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MemberRejoin

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MemberRejoin.MemberRejoin_C
// 0x0080 (0x03E0 - 0x0360)
class UMemberRejoin_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Title_Out;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Title_Loop;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Title_In;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Shadow;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMemberLeft_Cell_C*                     MemberLeft_Cell_00;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMemberLeft_Cell_C*                     MemberLeft_Cell_01;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMemberLeft_Cell_C*                     MemberLeft_Cell_02;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMemberRejoin_Cell_C*                   MemberRejoin_Cell_00;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMemberRejoin_Cell_C*                   MemberRejoin_Cell_01;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMemberRejoin_Cell_C*                   MemberRejoin_Cell_02;                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Nut_MemberLeft_Cell;                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Nut_MemberRejoin_Cell;                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_MemberRejoin;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_Title;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MemberRejoin_C">();
	}
	static class UMemberRejoin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMemberRejoin_C>();
	}
};
static_assert(alignof(UMemberRejoin_C) == 0x000008, "Wrong alignment on UMemberRejoin_C");
static_assert(sizeof(UMemberRejoin_C) == 0x0003E0, "Wrong size on UMemberRejoin_C");
static_assert(offsetof(UMemberRejoin_C, Title_Out) == 0x000360, "Member 'UMemberRejoin_C::Title_Out' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Title_Loop) == 0x000368, "Member 'UMemberRejoin_C::Title_Loop' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Title_In) == 0x000370, "Member 'UMemberRejoin_C::Title_In' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Img_Line) == 0x000378, "Member 'UMemberRejoin_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Line_Shadow) == 0x000380, "Member 'UMemberRejoin_C::Line_Shadow' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, MemberLeft_Cell_00) == 0x000388, "Member 'UMemberRejoin_C::MemberLeft_Cell_00' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, MemberLeft_Cell_01) == 0x000390, "Member 'UMemberRejoin_C::MemberLeft_Cell_01' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, MemberLeft_Cell_02) == 0x000398, "Member 'UMemberRejoin_C::MemberLeft_Cell_02' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, MemberRejoin_Cell_00) == 0x0003A0, "Member 'UMemberRejoin_C::MemberRejoin_Cell_00' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, MemberRejoin_Cell_01) == 0x0003A8, "Member 'UMemberRejoin_C::MemberRejoin_Cell_01' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, MemberRejoin_Cell_02) == 0x0003B0, "Member 'UMemberRejoin_C::MemberRejoin_Cell_02' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Nut_MemberLeft_Cell) == 0x0003B8, "Member 'UMemberRejoin_C::Nut_MemberLeft_Cell' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Nut_MemberRejoin_Cell) == 0x0003C0, "Member 'UMemberRejoin_C::Nut_MemberRejoin_Cell' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Pnl_MemberRejoin) == 0x0003C8, "Member 'UMemberRejoin_C::Pnl_MemberRejoin' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Pnl_Title) == 0x0003D0, "Member 'UMemberRejoin_C::Pnl_Title' has a wrong offset!");
static_assert(offsetof(UMemberRejoin_C, Txt_Title) == 0x0003D8, "Member 'UMemberRejoin_C::Txt_Title' has a wrong offset!");

}

