#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MemberJoin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MemberJoin.MemberJoin_C
// 0x0048 (0x03A8 - 0x0360)
class UMemberJoin_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BG;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_Chara;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Line_00;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           ImS_BGEffect;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Shadow;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MemberJoin(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MemberJoin_C">();
	}
	static class UMemberJoin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMemberJoin_C>();
	}
};
static_assert(alignof(UMemberJoin_C) == 0x000008, "Wrong alignment on UMemberJoin_C");
static_assert(sizeof(UMemberJoin_C) == 0x0003A8, "Wrong size on UMemberJoin_C");
static_assert(offsetof(UMemberJoin_C, UberGraphFrame) == 0x000360, "Member 'UMemberJoin_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Out) == 0x000368, "Member 'UMemberJoin_C::Out' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Loop) == 0x000370, "Member 'UMemberJoin_C::Loop' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, In) == 0x000378, "Member 'UMemberJoin_C::In' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Img_BG) == 0x000380, "Member 'UMemberJoin_C::Img_BG' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Img_Chara) == 0x000388, "Member 'UMemberJoin_C::Img_Chara' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Img_Line_00) == 0x000390, "Member 'UMemberJoin_C::Img_Line_00' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, ImS_BGEffect) == 0x000398, "Member 'UMemberJoin_C::ImS_BGEffect' has a wrong offset!");
static_assert(offsetof(UMemberJoin_C, Line_Shadow) == 0x0003A0, "Member 'UMemberJoin_C::Line_Shadow' has a wrong offset!");

}

