#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Midgar

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Midgar.Midgar_C
// 0x0160 (0x0760 - 0x0600)
class UMidgar_C final : public UEndMidgarMenu
{
public:
	class UWidgetAnimation*                       Menu_In;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot1;                                          // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot3;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot4;                                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot5;                                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseDot6;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseSpace1;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Bg_Billboard;                                      // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_BottomLeft;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_BottomRight;                                   // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_TopLeft;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Dot_TopRight;                                      // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_8;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_9;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_10;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_11;                                       // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_12;                                       // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_13;                                       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_14;                                       // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_18;                                       // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_20;                                       // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_21;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_24;                                       // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_29;                                       // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_31;                                       // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light01;                                           // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light02;                                           // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light03;                                           // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightDot;                                          // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Bottom;                                       // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line_Top;                                          // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMidgar_NamePlate_C*                    NamePlate;                                         // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Noise_01;                                          // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Noise_04;                                          // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              NoiseLight_01;                                     // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              NoiseLight_02;                                     // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              NoiseLight_03;                                     // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Midgar_C">();
	}
	static class UMidgar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidgar_C>();
	}
};
static_assert(alignof(UMidgar_C) == 0x000008, "Wrong alignment on UMidgar_C");
static_assert(sizeof(UMidgar_C) == 0x000760, "Wrong size on UMidgar_C");
static_assert(offsetof(UMidgar_C, Menu_In) == 0x000600, "Member 'UMidgar_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UMidgar_C, BaseDot1) == 0x000608, "Member 'UMidgar_C::BaseDot1' has a wrong offset!");
static_assert(offsetof(UMidgar_C, BaseDot3) == 0x000610, "Member 'UMidgar_C::BaseDot3' has a wrong offset!");
static_assert(offsetof(UMidgar_C, BaseDot4) == 0x000618, "Member 'UMidgar_C::BaseDot4' has a wrong offset!");
static_assert(offsetof(UMidgar_C, BaseDot5) == 0x000620, "Member 'UMidgar_C::BaseDot5' has a wrong offset!");
static_assert(offsetof(UMidgar_C, BaseDot6) == 0x000628, "Member 'UMidgar_C::BaseDot6' has a wrong offset!");
static_assert(offsetof(UMidgar_C, BaseSpace1) == 0x000630, "Member 'UMidgar_C::BaseSpace1' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Bg_Billboard) == 0x000638, "Member 'UMidgar_C::Bg_Billboard' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Dot_BottomLeft) == 0x000640, "Member 'UMidgar_C::Dot_BottomLeft' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Dot_BottomRight) == 0x000648, "Member 'UMidgar_C::Dot_BottomRight' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Dot_TopLeft) == 0x000650, "Member 'UMidgar_C::Dot_TopLeft' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Dot_TopRight) == 0x000658, "Member 'UMidgar_C::Dot_TopRight' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_0) == 0x000660, "Member 'UMidgar_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_1) == 0x000668, "Member 'UMidgar_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_2) == 0x000670, "Member 'UMidgar_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_3) == 0x000678, "Member 'UMidgar_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_4) == 0x000680, "Member 'UMidgar_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_5) == 0x000688, "Member 'UMidgar_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_7) == 0x000690, "Member 'UMidgar_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_8) == 0x000698, "Member 'UMidgar_C::EndImage_8' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_9) == 0x0006A0, "Member 'UMidgar_C::EndImage_9' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_10) == 0x0006A8, "Member 'UMidgar_C::EndImage_10' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_11) == 0x0006B0, "Member 'UMidgar_C::EndImage_11' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_12) == 0x0006B8, "Member 'UMidgar_C::EndImage_12' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_13) == 0x0006C0, "Member 'UMidgar_C::EndImage_13' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_14) == 0x0006C8, "Member 'UMidgar_C::EndImage_14' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_18) == 0x0006D0, "Member 'UMidgar_C::EndImage_18' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_20) == 0x0006D8, "Member 'UMidgar_C::EndImage_20' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_21) == 0x0006E0, "Member 'UMidgar_C::EndImage_21' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_24) == 0x0006E8, "Member 'UMidgar_C::EndImage_24' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_29) == 0x0006F0, "Member 'UMidgar_C::EndImage_29' has a wrong offset!");
static_assert(offsetof(UMidgar_C, EndImage_31) == 0x0006F8, "Member 'UMidgar_C::EndImage_31' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Light01) == 0x000700, "Member 'UMidgar_C::Light01' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Light02) == 0x000708, "Member 'UMidgar_C::Light02' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Light03) == 0x000710, "Member 'UMidgar_C::Light03' has a wrong offset!");
static_assert(offsetof(UMidgar_C, LightDot) == 0x000718, "Member 'UMidgar_C::LightDot' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Line_Bottom) == 0x000720, "Member 'UMidgar_C::Line_Bottom' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Line_Top) == 0x000728, "Member 'UMidgar_C::Line_Top' has a wrong offset!");
static_assert(offsetof(UMidgar_C, NamePlate) == 0x000730, "Member 'UMidgar_C::NamePlate' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Noise_01) == 0x000738, "Member 'UMidgar_C::Noise_01' has a wrong offset!");
static_assert(offsetof(UMidgar_C, Noise_04) == 0x000740, "Member 'UMidgar_C::Noise_04' has a wrong offset!");
static_assert(offsetof(UMidgar_C, NoiseLight_01) == 0x000748, "Member 'UMidgar_C::NoiseLight_01' has a wrong offset!");
static_assert(offsetof(UMidgar_C, NoiseLight_02) == 0x000750, "Member 'UMidgar_C::NoiseLight_02' has a wrong offset!");
static_assert(offsetof(UMidgar_C, NoiseLight_03) == 0x000758, "Member 'UMidgar_C::NoiseLight_03' has a wrong offset!");

}

