#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Midgar_NamePlate

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Midgar_NamePlate.Midgar_NamePlate_C
// 0x00E8 (0x0448 - 0x0360)
class UMidgar_NamePlate_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Current2;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal2;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeftMenu_In;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightMenu_In;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Normal;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Current;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_FrameL1;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_FrameL2;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_FrameR1;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_FrameR2;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_L;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_R;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Current_L;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Current_R;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointBase1;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointBase2;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointFrame1;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PointFrame2;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RightLine;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RightLine2;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RightLine2_Shadow;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RightLine_Shadow;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_L;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow_R;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ShadowBg;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name_L;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name_R;                                        // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Midgar_NamePlate_C">();
	}
	static class UMidgar_NamePlate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMidgar_NamePlate_C>();
	}
};
static_assert(alignof(UMidgar_NamePlate_C) == 0x000008, "Wrong alignment on UMidgar_NamePlate_C");
static_assert(sizeof(UMidgar_NamePlate_C) == 0x000448, "Wrong size on UMidgar_NamePlate_C");
static_assert(offsetof(UMidgar_NamePlate_C, Current2) == 0x000360, "Member 'UMidgar_NamePlate_C::Current2' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Normal2) == 0x000368, "Member 'UMidgar_NamePlate_C::Normal2' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, LeftMenu_In) == 0x000370, "Member 'UMidgar_NamePlate_C::LeftMenu_In' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, RightMenu_In) == 0x000378, "Member 'UMidgar_NamePlate_C::RightMenu_In' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Normal) == 0x000380, "Member 'UMidgar_NamePlate_C::Normal' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Current) == 0x000388, "Member 'UMidgar_NamePlate_C::Current' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Base_FrameL1) == 0x000390, "Member 'UMidgar_NamePlate_C::Base_FrameL1' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Base_FrameL2) == 0x000398, "Member 'UMidgar_NamePlate_C::Base_FrameL2' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Base_FrameR1) == 0x0003A0, "Member 'UMidgar_NamePlate_C::Base_FrameR1' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Base_FrameR2) == 0x0003A8, "Member 'UMidgar_NamePlate_C::Base_FrameR2' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Base_L) == 0x0003B0, "Member 'UMidgar_NamePlate_C::Base_L' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Base_R) == 0x0003B8, "Member 'UMidgar_NamePlate_C::Base_R' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, EndImage_2) == 0x0003C0, "Member 'UMidgar_NamePlate_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Icon_Current_L) == 0x0003C8, "Member 'UMidgar_NamePlate_C::Icon_Current_L' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Icon_Current_R) == 0x0003D0, "Member 'UMidgar_NamePlate_C::Icon_Current_R' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, LeftLine) == 0x0003D8, "Member 'UMidgar_NamePlate_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, PointBase1) == 0x0003E0, "Member 'UMidgar_NamePlate_C::PointBase1' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, PointBase2) == 0x0003E8, "Member 'UMidgar_NamePlate_C::PointBase2' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, PointFrame1) == 0x0003F0, "Member 'UMidgar_NamePlate_C::PointFrame1' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, PointFrame2) == 0x0003F8, "Member 'UMidgar_NamePlate_C::PointFrame2' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, RightLine) == 0x000400, "Member 'UMidgar_NamePlate_C::RightLine' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, RightLine2) == 0x000408, "Member 'UMidgar_NamePlate_C::RightLine2' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, RightLine2_Shadow) == 0x000410, "Member 'UMidgar_NamePlate_C::RightLine2_Shadow' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, RightLine_Shadow) == 0x000418, "Member 'UMidgar_NamePlate_C::RightLine_Shadow' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Shadow_L) == 0x000420, "Member 'UMidgar_NamePlate_C::Shadow_L' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Shadow_R) == 0x000428, "Member 'UMidgar_NamePlate_C::Shadow_R' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, ShadowBg) == 0x000430, "Member 'UMidgar_NamePlate_C::ShadowBg' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Txt_Name_L) == 0x000438, "Member 'UMidgar_NamePlate_C::Txt_Name_L' has a wrong offset!");
static_assert(offsetof(UMidgar_NamePlate_C, Txt_Name_R) == 0x000440, "Member 'UMidgar_NamePlate_C::Txt_Name_R' has a wrong offset!");

}

