#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGame_Com_Guide

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MiniGame_Com_Guide.MiniGame_Com_Guide_C
// 0x0020 (0x0380 - 0x0360)
class UMiniGame_Com_Guide_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIcon_Btn_00_C*                         Icon_Btn;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Frame_00;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiniGame_Com_Guide_C">();
	}
	static class UMiniGame_Com_Guide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiniGame_Com_Guide_C>();
	}
};
static_assert(alignof(UMiniGame_Com_Guide_C) == 0x000008, "Wrong alignment on UMiniGame_Com_Guide_C");
static_assert(sizeof(UMiniGame_Com_Guide_C) == 0x000380, "Wrong size on UMiniGame_Com_Guide_C");
static_assert(offsetof(UMiniGame_Com_Guide_C, In) == 0x000360, "Member 'UMiniGame_Com_Guide_C::In' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Guide_C, Icon_Btn) == 0x000368, "Member 'UMiniGame_Com_Guide_C::Icon_Btn' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Guide_C, Img_Base_00) == 0x000370, "Member 'UMiniGame_Com_Guide_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UMiniGame_Com_Guide_C, Img_Frame_00) == 0x000378, "Member 'UMiniGame_Com_Guide_C::Img_Frame_00' has a wrong offset!");

}

