#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MiniGame_StartBanner

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MiniGame_StartBanner.MiniGame_StartBanner_C
// 0x0078 (0x03D8 - 0x0360)
class UMiniGame_StartBanner_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       CountDown_Start;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Round;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Finish;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_7;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_12;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_13;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_14;                                       // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_15;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LineBottom;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LineTop;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Start_Light;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MiniGame_StartBanner_C">();
	}
	static class UMiniGame_StartBanner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMiniGame_StartBanner_C>();
	}
};
static_assert(alignof(UMiniGame_StartBanner_C) == 0x000008, "Wrong alignment on UMiniGame_StartBanner_C");
static_assert(sizeof(UMiniGame_StartBanner_C) == 0x0003D8, "Wrong size on UMiniGame_StartBanner_C");
static_assert(offsetof(UMiniGame_StartBanner_C, CountDown_Start) == 0x000360, "Member 'UMiniGame_StartBanner_C::CountDown_Start' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, Round) == 0x000368, "Member 'UMiniGame_StartBanner_C::Round' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, Finish) == 0x000370, "Member 'UMiniGame_StartBanner_C::Finish' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, EndImage_2) == 0x000378, "Member 'UMiniGame_StartBanner_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, EndImage_5) == 0x000380, "Member 'UMiniGame_StartBanner_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, EndImage_6) == 0x000388, "Member 'UMiniGame_StartBanner_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, EndImage_7) == 0x000390, "Member 'UMiniGame_StartBanner_C::EndImage_7' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, EndImage_12) == 0x000398, "Member 'UMiniGame_StartBanner_C::EndImage_12' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, EndImage_13) == 0x0003A0, "Member 'UMiniGame_StartBanner_C::EndImage_13' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, EndImage_14) == 0x0003A8, "Member 'UMiniGame_StartBanner_C::EndImage_14' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, EndImage_15) == 0x0003B0, "Member 'UMiniGame_StartBanner_C::EndImage_15' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, LineBottom) == 0x0003B8, "Member 'UMiniGame_StartBanner_C::LineBottom' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, LineTop) == 0x0003C0, "Member 'UMiniGame_StartBanner_C::LineTop' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, Start_Light) == 0x0003C8, "Member 'UMiniGame_StartBanner_C::Start_Light' has a wrong offset!");
static_assert(offsetof(UMiniGame_StartBanner_C, Txt_Title) == 0x0003D0, "Member 'UMiniGame_StartBanner_C::Txt_Title' has a wrong offset!");

}

