#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NaviMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NaviMap.NaviMap_C
// 0x00A0 (0x0400 - 0x0360)
class UNaviMap_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       RangeSub_Loop;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       RangeSub_In;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       RangeSub_Out;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Range_Loop;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Range_Out;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Range_In;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Warning;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battle_Out;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Battle_In;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BlackBg;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Player;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Base_00;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_Light;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Frame;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_FrameEff;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_FrameEff3;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_FrameEff4;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_NaviMap(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NaviMap_C">();
	}
	static class UNaviMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNaviMap_C>();
	}
};
static_assert(alignof(UNaviMap_C) == 0x000008, "Wrong alignment on UNaviMap_C");
static_assert(sizeof(UNaviMap_C) == 0x000400, "Wrong size on UNaviMap_C");
static_assert(offsetof(UNaviMap_C, UberGraphFrame) == 0x000360, "Member 'UNaviMap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, RangeSub_Loop) == 0x000368, "Member 'UNaviMap_C::RangeSub_Loop' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, RangeSub_In) == 0x000370, "Member 'UNaviMap_C::RangeSub_In' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, RangeSub_Out) == 0x000378, "Member 'UNaviMap_C::RangeSub_Out' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Range_Loop) == 0x000380, "Member 'UNaviMap_C::Range_Loop' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Range_Out) == 0x000388, "Member 'UNaviMap_C::Range_Out' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Range_In) == 0x000390, "Member 'UNaviMap_C::Range_In' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Warning) == 0x000398, "Member 'UNaviMap_C::Warning' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Battle_Out) == 0x0003A0, "Member 'UNaviMap_C::Battle_Out' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Battle_In) == 0x0003A8, "Member 'UNaviMap_C::Battle_In' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Out) == 0x0003B0, "Member 'UNaviMap_C::Out' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, In) == 0x0003B8, "Member 'UNaviMap_C::In' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, BlackBg) == 0x0003C0, "Member 'UNaviMap_C::BlackBg' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Icon_Player) == 0x0003C8, "Member 'UNaviMap_C::Icon_Player' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Img_Base_00) == 0x0003D0, "Member 'UNaviMap_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Img_Base_Light) == 0x0003D8, "Member 'UNaviMap_C::Img_Base_Light' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Img_Frame) == 0x0003E0, "Member 'UNaviMap_C::Img_Frame' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Img_FrameEff) == 0x0003E8, "Member 'UNaviMap_C::Img_FrameEff' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Img_FrameEff3) == 0x0003F0, "Member 'UNaviMap_C::Img_FrameEff3' has a wrong offset!");
static_assert(offsetof(UNaviMap_C, Img_FrameEff4) == 0x0003F8, "Member 'UNaviMap_C::Img_FrameEff4' has a wrong offset!");

}

