#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NM0008_00_AvalancheHontai_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NM0008_00_AvalancheHontai_Standard_Animation.NM0008_00_AvalancheHontai_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UNM0008_00_AvalancheHontai_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_19C41BFD464B37A1A4C211914F8F05BA; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_D710535543B46E30D90506B713DA6424; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_E513FBF949A973C486FA6CBFB0047560; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_AEC7538347EFCC495ADCE58E9157A197; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_E74FA27D429E4D4E7C4C4A8FF39E7D86; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_272FCE424E0A3B1B1D931D88EBEB65DD; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C73FDFFD4079AFBEBF178E9D4003B38D; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_117E3931499AF14E45E61395E8C9CB5B; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_D5E2AB29422B28AB946A0EA17C3EF4AA; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_4021E4264540012734DE268FC76D1493; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_8CED4D8D4454224F3B64FEA59C57A7A3; // 0x2740(0x0070)()

public:
	void ExecuteUbergraph_NM0008_00_AvalancheHontai_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NM0008_00_AvalancheHontai_Standard_Animation_C">();
	}
	static class UNM0008_00_AvalancheHontai_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNM0008_00_AvalancheHontai_Standard_Animation_C>();
	}
};
static_assert(alignof(UNM0008_00_AvalancheHontai_Standard_Animation_C) == 0x000010, "Wrong alignment on UNM0008_00_AvalancheHontai_Standard_Animation_C");
static_assert(sizeof(UNM0008_00_AvalancheHontai_Standard_Animation_C) == 0x0027B0, "Wrong size on UNM0008_00_AvalancheHontai_Standard_Animation_C");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_Root_19C41BFD464B37A1A4C211914F8F05BA) == 0x001788, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_Root_19C41BFD464B37A1A4C211914F8F05BA' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_Slot_D710535543B46E30D90506B713DA6424) == 0x0017D0, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_Slot_D710535543B46E30D90506B713DA6424' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_E513FBF949A973C486FA6CBFB0047560) == 0x001838, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_E513FBF949A973C486FA6CBFB0047560' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_AEC7538347EFCC495ADCE58E9157A197) == 0x001880, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_AEC7538347EFCC495ADCE58E9157A197' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_E74FA27D429E4D4E7C4C4A8FF39E7D86) == 0x0018C8, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_E74FA27D429E4D4E7C4C4A8FF39E7D86' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_EndBehavior_272FCE424E0A3B1B1D931D88EBEB65DD) == 0x001968, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_EndBehavior_272FCE424E0A3B1B1D931D88EBEB65DD' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_Slot_C73FDFFD4079AFBEBF178E9D4003B38D) == 0x001998, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_Slot_C73FDFFD4079AFBEBF178E9D4003B38D' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_117E3931499AF14E45E61395E8C9CB5B) == 0x001A00, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_117E3931499AF14E45E61395E8C9CB5B' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_D5E2AB29422B28AB946A0EA17C3EF4AA) == 0x001A50, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_D5E2AB29422B28AB946A0EA17C3EF4AA' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_EndFace_4021E4264540012734DE268FC76D1493) == 0x002390, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_EndFace_4021E4264540012734DE268FC76D1493' has a wrong offset!");
static_assert(offsetof(UNM0008_00_AvalancheHontai_Standard_Animation_C, AnimGraphNode_EndFaceBlend_8CED4D8D4454224F3B64FEA59C57A7A3) == 0x002740, "Member 'UNM0008_00_AvalancheHontai_Standard_Animation_C::AnimGraphNode_EndFaceBlend_8CED4D8D4454224F3B64FEA59C57A7A3' has a wrong offset!");

}

