#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NP0000_00_Biggs_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NP0000_00_Biggs_Standard_Animation.NP0000_00_Biggs_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UNP0000_00_Biggs_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_7C9979884E0F2137EFEB79A9FC08E40A; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_E042195B4096072D1614D5BC6A67398E; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DF6C8D5948EF50A56A0BB295AFA619AF; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7FA80A56405B1D4D8D77C39D18860D42; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_7B4CB2354EA03A68B6C3B88CA2DF8D5C; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_FA0BD0E3441D717AF02077A90766DE91; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_0A0E3D754D83C0357DCE7DB6440A7471; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_E23899124ACC6EA679EE5D8452F9B1BA; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_808CA1B34AB30154DEB7B08B0C9B6D1B; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_EF690B3E43D1D40A3D8EC7AD03BBC66B; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_D836BDEB450550EB769C3CBB594EB111; // 0x2740(0x0070)()

public:
	void ExecuteUbergraph_NP0000_00_Biggs_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NP0000_00_Biggs_Standard_Animation_C">();
	}
	static class UNP0000_00_Biggs_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNP0000_00_Biggs_Standard_Animation_C>();
	}
};
static_assert(alignof(UNP0000_00_Biggs_Standard_Animation_C) == 0x000010, "Wrong alignment on UNP0000_00_Biggs_Standard_Animation_C");
static_assert(sizeof(UNP0000_00_Biggs_Standard_Animation_C) == 0x0027B0, "Wrong size on UNP0000_00_Biggs_Standard_Animation_C");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UNP0000_00_Biggs_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_Root_7C9979884E0F2137EFEB79A9FC08E40A) == 0x001788, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_Root_7C9979884E0F2137EFEB79A9FC08E40A' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_Slot_E042195B4096072D1614D5BC6A67398E) == 0x0017D0, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_Slot_E042195B4096072D1614D5BC6A67398E' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_DF6C8D5948EF50A56A0BB295AFA619AF) == 0x001838, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_DF6C8D5948EF50A56A0BB295AFA619AF' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_7FA80A56405B1D4D8D77C39D18860D42) == 0x001880, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_7FA80A56405B1D4D8D77C39D18860D42' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_7B4CB2354EA03A68B6C3B88CA2DF8D5C) == 0x0018C8, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_7B4CB2354EA03A68B6C3B88CA2DF8D5C' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_EndBehavior_FA0BD0E3441D717AF02077A90766DE91) == 0x001968, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_EndBehavior_FA0BD0E3441D717AF02077A90766DE91' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_Slot_0A0E3D754D83C0357DCE7DB6440A7471) == 0x001998, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_Slot_0A0E3D754D83C0357DCE7DB6440A7471' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_E23899124ACC6EA679EE5D8452F9B1BA) == 0x001A00, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_E23899124ACC6EA679EE5D8452F9B1BA' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_808CA1B34AB30154DEB7B08B0C9B6D1B) == 0x001A50, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_808CA1B34AB30154DEB7B08B0C9B6D1B' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_EndFace_EF690B3E43D1D40A3D8EC7AD03BBC66B) == 0x002390, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_EndFace_EF690B3E43D1D40A3D8EC7AD03BBC66B' has a wrong offset!");
static_assert(offsetof(UNP0000_00_Biggs_Standard_Animation_C, AnimGraphNode_EndFaceBlend_D836BDEB450550EB769C3CBB594EB111) == 0x002740, "Member 'UNP0000_00_Biggs_Standard_Animation_C::AnimGraphNode_EndFaceBlend_D836BDEB450550EB769C3CBB594EB111' has a wrong offset!");

}

