#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NP0025_00_Irezumi49_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NP0025_00_Irezumi49_Standard_Animation.NP0025_00_Irezumi49_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UNP0025_00_Irezumi49_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_D14768D743991304FA3F0FAF1C33F86F; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_BFFC6C6D4D07B74C487D4481F7043471; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D59B72284BB2DCB396C2C48C4EE2CDD6; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6218CF404B8893BA24090DB7F0C770DA; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_D647C4404485EF3CD9A96F94E71AFDDC; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_C2DF1E0748E5275C1939BFBAEB96817B; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_96AAD7B4452FE905C3D7EAAB6772AA04; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_CA29745946E8F9898988F19B38A8221C; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_24BF18524834CA8ECF5FEAA2B25C2A6C; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_7627E4184A61916597B79B88158276D2; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_833EA46442717E89CA30E186D53441F8; // 0x2740(0x0070)()

public:
	void ExecuteUbergraph_NP0025_00_Irezumi49_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NP0025_00_Irezumi49_Standard_Animation_C">();
	}
	static class UNP0025_00_Irezumi49_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNP0025_00_Irezumi49_Standard_Animation_C>();
	}
};
static_assert(alignof(UNP0025_00_Irezumi49_Standard_Animation_C) == 0x000010, "Wrong alignment on UNP0025_00_Irezumi49_Standard_Animation_C");
static_assert(sizeof(UNP0025_00_Irezumi49_Standard_Animation_C) == 0x0027B0, "Wrong size on UNP0025_00_Irezumi49_Standard_Animation_C");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_Root_D14768D743991304FA3F0FAF1C33F86F) == 0x001788, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_Root_D14768D743991304FA3F0FAF1C33F86F' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_Slot_BFFC6C6D4D07B74C487D4481F7043471) == 0x0017D0, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_Slot_BFFC6C6D4D07B74C487D4481F7043471' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_D59B72284BB2DCB396C2C48C4EE2CDD6) == 0x001838, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_D59B72284BB2DCB396C2C48C4EE2CDD6' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_6218CF404B8893BA24090DB7F0C770DA) == 0x001880, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_6218CF404B8893BA24090DB7F0C770DA' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_D647C4404485EF3CD9A96F94E71AFDDC) == 0x0018C8, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_D647C4404485EF3CD9A96F94E71AFDDC' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_EndBehavior_C2DF1E0748E5275C1939BFBAEB96817B) == 0x001968, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_EndBehavior_C2DF1E0748E5275C1939BFBAEB96817B' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_Slot_96AAD7B4452FE905C3D7EAAB6772AA04) == 0x001998, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_Slot_96AAD7B4452FE905C3D7EAAB6772AA04' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_CA29745946E8F9898988F19B38A8221C) == 0x001A00, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_CA29745946E8F9898988F19B38A8221C' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_24BF18524834CA8ECF5FEAA2B25C2A6C) == 0x001A50, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_24BF18524834CA8ECF5FEAA2B25C2A6C' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_EndFace_7627E4184A61916597B79B88158276D2) == 0x002390, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_EndFace_7627E4184A61916597B79B88158276D2' has a wrong offset!");
static_assert(offsetof(UNP0025_00_Irezumi49_Standard_Animation_C, AnimGraphNode_EndFaceBlend_833EA46442717E89CA30E186D53441F8) == 0x002740, "Member 'UNP0025_00_Irezumi49_Standard_Animation_C::AnimGraphNode_EndFaceBlend_833EA46442717E89CA30E186D53441F8' has a wrong offset!");

}

