#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemEOS

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "OnlineSubsystemEOS_structs.hpp"


namespace SDK
{

// Class OnlineSubsystemEOS.OnlineSubsystemEOSSettings
// 0x0070 (0x00A8 - 0x0038)
class UOnlineSubsystemEOSSettings final : public UDeveloperSettings
{
public:
	class FString                                 m_ProductName;                                     // 0x0038(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_ProductVersion;                                  // 0x0048(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   m_ProductID;                                       // 0x0058(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   m_SandboxID;                                       // 0x0060(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   m_DeploymentID;                                    // 0x0068(0x0008)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_DiableOverlay;                                   // 0x0070(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          m_DiableSocialOverlay;                             // 0x0071(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 m_DevAuthHost;                                     // 0x0078(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 m_DevAuthCredentials;                              // 0x0088(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOnlineSubsystemEOSArtifact>    m_Artifacts;                                       // 0x0098(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"OnlineSubsystemEOSSettings">();
	}
	static class UOnlineSubsystemEOSSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSubsystemEOSSettings>();
	}
};
static_assert(alignof(UOnlineSubsystemEOSSettings) == 0x000008, "Wrong alignment on UOnlineSubsystemEOSSettings");
static_assert(sizeof(UOnlineSubsystemEOSSettings) == 0x0000A8, "Wrong size on UOnlineSubsystemEOSSettings");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_ProductName) == 0x000038, "Member 'UOnlineSubsystemEOSSettings::m_ProductName' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_ProductVersion) == 0x000048, "Member 'UOnlineSubsystemEOSSettings::m_ProductVersion' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_ProductID) == 0x000058, "Member 'UOnlineSubsystemEOSSettings::m_ProductID' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_SandboxID) == 0x000060, "Member 'UOnlineSubsystemEOSSettings::m_SandboxID' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_DeploymentID) == 0x000068, "Member 'UOnlineSubsystemEOSSettings::m_DeploymentID' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_DiableOverlay) == 0x000070, "Member 'UOnlineSubsystemEOSSettings::m_DiableOverlay' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_DiableSocialOverlay) == 0x000071, "Member 'UOnlineSubsystemEOSSettings::m_DiableSocialOverlay' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_DevAuthHost) == 0x000078, "Member 'UOnlineSubsystemEOSSettings::m_DevAuthHost' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_DevAuthCredentials) == 0x000088, "Member 'UOnlineSubsystemEOSSettings::m_DevAuthCredentials' has a wrong offset!");
static_assert(offsetof(UOnlineSubsystemEOSSettings, m_Artifacts) == 0x000098, "Member 'UOnlineSubsystemEOSSettings::m_Artifacts' has a wrong offset!");

}

