#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OSDKMembership

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum OSDKMembership.EOSDKMembershipStatus
// NumValues: 0x0006
enum class EOSDKMembershipStatus : uint8
{
	SUCCESS                                  = 0,
	FAILED_INVALID_OPERATION                 = 1,
	FAILED_NO_RESPONSE                       = 2,
	FAILED_UNKNOWN                           = 3,
	FAILED_INCORRECT_CREDENTIALS             = 4,
	EOSDKMembershipStatus_MAX                = 5,
};

// Enum OSDKMembership.EOSDKMembershipState
// NumValues: 0x0006
enum class EOSDKMembershipState : uint8
{
	ACCOUNT_CONFIRMED                        = 0,
	ACCOUNT_LOADING                          = 1,
	SIGNUP_CODE                              = 2,
	SIGNUP_CODE_LOADING                      = 3,
	FAILURE                                  = 4,
	EOSDKMembershipState_MAX                 = 5,
};

// Enum OSDKMembership.EOSDKConnectionTypeEnum
// NumValues: 0x0005
enum class EOSDKConnectionTypeEnum : uint8
{
	NoAuth                                   = 0,
	PS5                                      = 1,
	Steam                                    = 2,
	Epic                                     = 3,
	EOSDKConnectionTypeEnum_MAX              = 4,
};

// ScriptStruct OSDKMembership.OSDKMembershipSignupCode
// 0x0048 (0x0048 - 0x0000)
struct FOSDKMembershipSignupCode final
{
public:
	class FString                                 Link;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Display;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Code;                                              // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              Expiration;                                        // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 QrPNGBase64;                                       // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FOSDKMembershipSignupCode) == 0x000008, "Wrong alignment on FOSDKMembershipSignupCode");
static_assert(sizeof(FOSDKMembershipSignupCode) == 0x000048, "Wrong size on FOSDKMembershipSignupCode");
static_assert(offsetof(FOSDKMembershipSignupCode, Link) == 0x000000, "Member 'FOSDKMembershipSignupCode::Link' has a wrong offset!");
static_assert(offsetof(FOSDKMembershipSignupCode, Display) == 0x000010, "Member 'FOSDKMembershipSignupCode::Display' has a wrong offset!");
static_assert(offsetof(FOSDKMembershipSignupCode, Code) == 0x000020, "Member 'FOSDKMembershipSignupCode::Code' has a wrong offset!");
static_assert(offsetof(FOSDKMembershipSignupCode, Expiration) == 0x000030, "Member 'FOSDKMembershipSignupCode::Expiration' has a wrong offset!");
static_assert(offsetof(FOSDKMembershipSignupCode, QrPNGBase64) == 0x000038, "Member 'FOSDKMembershipSignupCode::QrPNGBase64' has a wrong offset!");

}

