#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OSDKMembership

#include "Basic.hpp"

#include "OSDKMembership_structs.hpp"


namespace SDK::Params
{

// Function OSDKMembership.OSDKMembershipFeed.CreateMembershipFeed
// 0x0018 (0x0018 - 0x0000)
struct OSDKMembershipFeed_CreateMembershipFeed final
{
public:
	class UOSDKWebServiceClient*                  iWebServiceClient;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         iUpdateDelaySeconds;                               // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSDKMembershipFeed*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKMembershipFeed_CreateMembershipFeed) == 0x000008, "Wrong alignment on OSDKMembershipFeed_CreateMembershipFeed");
static_assert(sizeof(OSDKMembershipFeed_CreateMembershipFeed) == 0x000018, "Wrong size on OSDKMembershipFeed_CreateMembershipFeed");
static_assert(offsetof(OSDKMembershipFeed_CreateMembershipFeed, iWebServiceClient) == 0x000000, "Member 'OSDKMembershipFeed_CreateMembershipFeed::iWebServiceClient' has a wrong offset!");
static_assert(offsetof(OSDKMembershipFeed_CreateMembershipFeed, iUpdateDelaySeconds) == 0x000008, "Member 'OSDKMembershipFeed_CreateMembershipFeed::iUpdateDelaySeconds' has a wrong offset!");
static_assert(offsetof(OSDKMembershipFeed_CreateMembershipFeed, ReturnValue) == 0x000010, "Member 'OSDKMembershipFeed_CreateMembershipFeed::ReturnValue' has a wrong offset!");

// Function OSDKMembership.OSDKMembershipFeed.GetQRImage
// 0x0008 (0x0008 - 0x0000)
struct OSDKMembershipFeed_GetQRImage final
{
public:
	class UTexture2DDynamic*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OSDKMembershipFeed_GetQRImage) == 0x000008, "Wrong alignment on OSDKMembershipFeed_GetQRImage");
static_assert(sizeof(OSDKMembershipFeed_GetQRImage) == 0x000008, "Wrong size on OSDKMembershipFeed_GetQRImage");
static_assert(offsetof(OSDKMembershipFeed_GetQRImage, ReturnValue) == 0x000000, "Member 'OSDKMembershipFeed_GetQRImage::ReturnValue' has a wrong offset!");

// Function OSDKMembership.CoreSEM.Init
// 0x0001 (0x0001 - 0x0000)
struct CoreSEM_Init final
{
public:
	EOSDKConnectionTypeEnum                       eConnectionType;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(CoreSEM_Init) == 0x000001, "Wrong alignment on CoreSEM_Init");
static_assert(sizeof(CoreSEM_Init) == 0x000001, "Wrong size on CoreSEM_Init");
static_assert(offsetof(CoreSEM_Init, eConnectionType) == 0x000000, "Member 'CoreSEM_Init::eConnectionType' has a wrong offset!");

// Function OSDKMembership.OnlineSuiteSEMBlueprintLibrary.GetCoreSEM
// 0x0008 (0x0008 - 0x0000)
struct OnlineSuiteSEMBlueprintLibrary_GetCoreSEM final
{
public:
	class UCoreSEM*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(OnlineSuiteSEMBlueprintLibrary_GetCoreSEM) == 0x000008, "Wrong alignment on OnlineSuiteSEMBlueprintLibrary_GetCoreSEM");
static_assert(sizeof(OnlineSuiteSEMBlueprintLibrary_GetCoreSEM) == 0x000008, "Wrong size on OnlineSuiteSEMBlueprintLibrary_GetCoreSEM");
static_assert(offsetof(OnlineSuiteSEMBlueprintLibrary_GetCoreSEM, ReturnValue) == 0x000000, "Member 'OnlineSuiteSEMBlueprintLibrary_GetCoreSEM::ReturnValue' has a wrong offset!");

}

