#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OutOfScreenTarget

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass OutOfScreenTarget.OutOfScreenTarget_C
// 0x0028 (0x0388 - 0x0360)
class UOutOfScreenTarget_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Quest;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Story;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Player;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_OutOfScreenTarget;                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_TargetCursor;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"OutOfScreenTarget_C">();
	}
	static class UOutOfScreenTarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOutOfScreenTarget_C>();
	}
};
static_assert(alignof(UOutOfScreenTarget_C) == 0x000008, "Wrong alignment on UOutOfScreenTarget_C");
static_assert(sizeof(UOutOfScreenTarget_C) == 0x000388, "Wrong size on UOutOfScreenTarget_C");
static_assert(offsetof(UOutOfScreenTarget_C, Quest) == 0x000360, "Member 'UOutOfScreenTarget_C::Quest' has a wrong offset!");
static_assert(offsetof(UOutOfScreenTarget_C, Story) == 0x000368, "Member 'UOutOfScreenTarget_C::Story' has a wrong offset!");
static_assert(offsetof(UOutOfScreenTarget_C, Player) == 0x000370, "Member 'UOutOfScreenTarget_C::Player' has a wrong offset!");
static_assert(offsetof(UOutOfScreenTarget_C, All_OutOfScreenTarget) == 0x000378, "Member 'UOutOfScreenTarget_C::All_OutOfScreenTarget' has a wrong offset!");
static_assert(offsetof(UOutOfScreenTarget_C, Ims_TargetCursor) == 0x000380, "Member 'UOutOfScreenTarget_C::Ims_TargetCursor' has a wrong offset!");

}

