#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Party_Coordinator

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Party_Coordinator.Party_Coordinator_C
// 0x0110 (0x0490 - 0x0380)
class AParty_Coordinator_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(Transient, DuplicateTransient)
	class FName                                   ActorName;                                         // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   PlayerType;                                        // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentType                                EquipmentType;                                     // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_392[0x2];                                      // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParentName;                                        // 0x0394(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharaSpecName;                                     // 0x039C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerType                                   CurrentPartyLeader;                                // 0x03A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EEquipmentType>                        EquipmentTypeList;                                 // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 LoopCounters;                                      // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         LoadPriority;                                      // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCreateActor;                                     // 0x03CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CD[0x3];                                      // 0x03CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LoopCount;                                         // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPlayerType, class FName>                ActorNameMap;                                      // 0x03D8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<EPlayerType, class FName>                WeaponNameMap;                                     // 0x0428(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 DeleteTaskIDList;                                  // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AActor*                                 PlayerTrigger_ExecuteUbergraph_Party_Coordinator_RefProperty; // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Party_Coordinator(int32 EntryPoint);
	void CheckPreload();
	void Party_SetCharaSpecList();
	void Party_BackupLeaderAndReset();
	void Party_SetActorNameAndParentName(EEquipmentType NewParam);
	void Party_AddLoopCount(int32 loopCountArrayIndex, int32 Value);
	void Party_ResetLoopCount(int32 loopCountArrayIndex);
	void Party_SetEquipmentType(int32 equipmentTypeListIndex);
	void Party_SetPlayerType(int32 playerTypeListIndex);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Party_Coordinator_C">();
	}
	static class AParty_Coordinator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParty_Coordinator_C>();
	}
};
static_assert(alignof(AParty_Coordinator_C) == 0x000008, "Wrong alignment on AParty_Coordinator_C");
static_assert(sizeof(AParty_Coordinator_C) == 0x000490, "Wrong size on AParty_Coordinator_C");
static_assert(offsetof(AParty_Coordinator_C, UberGraphFrame) == 0x000380, "Member 'AParty_Coordinator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, ActorName) == 0x000388, "Member 'AParty_Coordinator_C::ActorName' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, PlayerType) == 0x000390, "Member 'AParty_Coordinator_C::PlayerType' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, EquipmentType) == 0x000391, "Member 'AParty_Coordinator_C::EquipmentType' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, ParentName) == 0x000394, "Member 'AParty_Coordinator_C::ParentName' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, CharaSpecName) == 0x00039C, "Member 'AParty_Coordinator_C::CharaSpecName' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, CurrentPartyLeader) == 0x0003A4, "Member 'AParty_Coordinator_C::CurrentPartyLeader' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, EquipmentTypeList) == 0x0003A8, "Member 'AParty_Coordinator_C::EquipmentTypeList' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, LoopCounters) == 0x0003B8, "Member 'AParty_Coordinator_C::LoopCounters' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, LoadPriority) == 0x0003C8, "Member 'AParty_Coordinator_C::LoadPriority' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, IsCreateActor) == 0x0003CC, "Member 'AParty_Coordinator_C::IsCreateActor' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, LoopCount) == 0x0003D0, "Member 'AParty_Coordinator_C::LoopCount' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, ActorNameMap) == 0x0003D8, "Member 'AParty_Coordinator_C::ActorNameMap' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, WeaponNameMap) == 0x000428, "Member 'AParty_Coordinator_C::WeaponNameMap' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, DeleteTaskIDList) == 0x000478, "Member 'AParty_Coordinator_C::DeleteTaskIDList' has a wrong offset!");
static_assert(offsetof(AParty_Coordinator_C, PlayerTrigger_ExecuteUbergraph_Party_Coordinator_RefProperty) == 0x000488, "Member 'AParty_Coordinator_C::PlayerTrigger_ExecuteUbergraph_Party_Coordinator_RefProperty' has a wrong offset!");

}

