#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0000_00_Cloud_Standard_AI

#include "Basic.hpp"


namespace SDK::Params
{

// Function PC0000_00_Cloud_Standard_AI.PC0000_00_Cloud_Standard_AI_C.ExecuteUbergraph_PC0000_00_Cloud_Standard_AI
// 0x000C (0x000C - 0x0000)
struct PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI) == 0x000004, "Wrong alignment on PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI");
static_assert(sizeof(PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI) == 0x00000C, "Wrong size on PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI");
static_assert(offsetof(PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI, EntryPoint) == 0x000000, "Member 'PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI::EntryPoint' has a wrong offset!");
static_assert(offsetof(PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI, CallFunc_RunBehaviorTree_ReturnValue) == 0x000004, "Member 'PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'PC0000_00_Cloud_Standard_AI_C_ExecuteUbergraph_PC0000_00_Cloud_Standard_AI::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function PC0000_00_Cloud_Standard_AI.PC0000_00_Cloud_Standard_AI_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PC0000_00_Cloud_Standard_AI_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PC0000_00_Cloud_Standard_AI_C_ReceiveTick) == 0x000004, "Wrong alignment on PC0000_00_Cloud_Standard_AI_C_ReceiveTick");
static_assert(sizeof(PC0000_00_Cloud_Standard_AI_C_ReceiveTick) == 0x000004, "Wrong size on PC0000_00_Cloud_Standard_AI_C_ReceiveTick");
static_assert(offsetof(PC0000_00_Cloud_Standard_AI_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PC0000_00_Cloud_Standard_AI_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

