#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0003_00_Aerith_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PC0003_00_Aerith_Standard_Animation.PC0003_00_Aerith_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UPC0003_00_Aerith_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_742BD11A4FC72BABDE023EA6DE1312F0; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_38E075BA458A28670FFF24952CD0FD94; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_E0EFC02C4FA058189E241A96FE2AF5C8; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D2BF2BE443DDFA64ADA4B4BF34BAAA48; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_380B5288452A738AABE5E0A165F89B8F; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_28DA2E81491EF78F59EDDDA60B270027; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_AB7A0B464C2A00FA88B663A78FEF90C5; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_C1B56AEC4FD854CE1D3546AC870FFD6E; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_9B5197D045321D44D490FBAC7EEB0AEF; // 0x1A50(0x0940)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_0E1299B34635FFEE268C8F9664F0101E; // 0x2390(0x0070)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_7A080B654EB23ABD25CD25A6911FF323; // 0x2400(0x03B0)()

public:
	void ExecuteUbergraph_PC0003_00_Aerith_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PC0003_00_Aerith_Standard_Animation_C">();
	}
	static class UPC0003_00_Aerith_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPC0003_00_Aerith_Standard_Animation_C>();
	}
};
static_assert(alignof(UPC0003_00_Aerith_Standard_Animation_C) == 0x000010, "Wrong alignment on UPC0003_00_Aerith_Standard_Animation_C");
static_assert(sizeof(UPC0003_00_Aerith_Standard_Animation_C) == 0x0027B0, "Wrong size on UPC0003_00_Aerith_Standard_Animation_C");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UPC0003_00_Aerith_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_Root_742BD11A4FC72BABDE023EA6DE1312F0) == 0x001788, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_Root_742BD11A4FC72BABDE023EA6DE1312F0' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_Slot_38E075BA458A28670FFF24952CD0FD94) == 0x0017D0, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_Slot_38E075BA458A28670FFF24952CD0FD94' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_E0EFC02C4FA058189E241A96FE2AF5C8) == 0x001838, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_E0EFC02C4FA058189E241A96FE2AF5C8' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_D2BF2BE443DDFA64ADA4B4BF34BAAA48) == 0x001880, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_D2BF2BE443DDFA64ADA4B4BF34BAAA48' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_380B5288452A738AABE5E0A165F89B8F) == 0x0018C8, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_380B5288452A738AABE5E0A165F89B8F' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_EndBehavior_28DA2E81491EF78F59EDDDA60B270027) == 0x001968, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_EndBehavior_28DA2E81491EF78F59EDDDA60B270027' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_Slot_AB7A0B464C2A00FA88B663A78FEF90C5) == 0x001998, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_Slot_AB7A0B464C2A00FA88B663A78FEF90C5' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_C1B56AEC4FD854CE1D3546AC870FFD6E) == 0x001A00, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_C1B56AEC4FD854CE1D3546AC870FFD6E' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_9B5197D045321D44D490FBAC7EEB0AEF) == 0x001A50, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_9B5197D045321D44D490FBAC7EEB0AEF' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_EndFaceBlend_0E1299B34635FFEE268C8F9664F0101E) == 0x002390, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_EndFaceBlend_0E1299B34635FFEE268C8F9664F0101E' has a wrong offset!");
static_assert(offsetof(UPC0003_00_Aerith_Standard_Animation_C, AnimGraphNode_EndFace_7A080B654EB23ABD25CD25A6911FF323) == 0x002400, "Member 'UPC0003_00_Aerith_Standard_Animation_C::AnimGraphNode_EndFace_7A080B654EB23ABD25CD25A6911FF323' has a wrong offset!");

}

