#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0002_00_Tifa_Standard_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PC0002_00_Tifa_Standard_Animation.PC0002_00_Tifa_Standard_Animation_C
// 0x1030 (0x27B0 - 0x1780)
class UPC0002_00_Tifa_Standard_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_48AF93E94F633522917C07BC795EEE1F; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8555464B413736D80B3896882441F3B1; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D3F0BB72469E35F84F3310BC89FA62D5; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3C387DA24F9DC51D73F7AFAEA3E802F5; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_646083694423E6A4C86E66A9383017B3; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_C6D71F744E2AD9BCD705B98FA2A3087B; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5880E14946B771DB5FED538B76780436; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_64D6EBCE4D709DDB5EDECF8B1F50BB35; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_F889CC1C4B768E0A646DFDB5AE90B4DB; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_BF60948E4B7C0E380C5B19BA4AD36CA0; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_405252DC457B0213BF190584C7DA629D; // 0x2740(0x0070)()

public:
	void ExecuteUbergraph_PC0002_00_Tifa_Standard_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PC0002_00_Tifa_Standard_Animation_C">();
	}
	static class UPC0002_00_Tifa_Standard_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPC0002_00_Tifa_Standard_Animation_C>();
	}
};
static_assert(alignof(UPC0002_00_Tifa_Standard_Animation_C) == 0x000010, "Wrong alignment on UPC0002_00_Tifa_Standard_Animation_C");
static_assert(sizeof(UPC0002_00_Tifa_Standard_Animation_C) == 0x0027B0, "Wrong size on UPC0002_00_Tifa_Standard_Animation_C");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, UberGraphFrame) == 0x001780, "Member 'UPC0002_00_Tifa_Standard_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_Root_48AF93E94F633522917C07BC795EEE1F) == 0x001788, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_Root_48AF93E94F633522917C07BC795EEE1F' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_Slot_8555464B413736D80B3896882441F3B1) == 0x0017D0, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_Slot_8555464B413736D80B3896882441F3B1' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_LocalToComponentSpace_D3F0BB72469E35F84F3310BC89FA62D5) == 0x001838, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_LocalToComponentSpace_D3F0BB72469E35F84F3310BC89FA62D5' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_ComponentToLocalSpace_3C387DA24F9DC51D73F7AFAEA3E802F5) == 0x001880, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_ComponentToLocalSpace_3C387DA24F9DC51D73F7AFAEA3E802F5' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_EndAdjustOrientation_646083694423E6A4C86E66A9383017B3) == 0x0018C8, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_EndAdjustOrientation_646083694423E6A4C86E66A9383017B3' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_EndBehavior_C6D71F744E2AD9BCD705B98FA2A3087B) == 0x001968, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_EndBehavior_C6D71F744E2AD9BCD705B98FA2A3087B' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_Slot_5880E14946B771DB5FED538B76780436) == 0x001998, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_Slot_5880E14946B771DB5FED538B76780436' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_EndSaveLastPose_64D6EBCE4D709DDB5EDECF8B1F50BB35) == 0x001A00, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_EndSaveLastPose_64D6EBCE4D709DDB5EDECF8B1F50BB35' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_EndFullBodySolver_F889CC1C4B768E0A646DFDB5AE90B4DB) == 0x001A50, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_EndFullBodySolver_F889CC1C4B768E0A646DFDB5AE90B4DB' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_EndFace_BF60948E4B7C0E380C5B19BA4AD36CA0) == 0x002390, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_EndFace_BF60948E4B7C0E380C5B19BA4AD36CA0' has a wrong offset!");
static_assert(offsetof(UPC0002_00_Tifa_Standard_Animation_C, AnimGraphNode_EndFaceBlend_405252DC457B0213BF190584C7DA629D) == 0x002740, "Member 'UPC0002_00_Tifa_Standard_Animation_C::AnimGraphNode_EndFaceBlend_405252DC457B0213BF190584C7DA629D' has a wrong offset!");

}

