#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0000_00_Cloud_Soldier_Animation

#include "Basic.hpp"

#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PC0000_00_Cloud_Soldier_Animation.PC0000_00_Cloud_Soldier_Animation_C
// 0x1140 (0x28C0 - 0x1780)
class UPC0000_00_Cloud_Soldier_Animation_C final : public UEndAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1780(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_5C55EC7143AFA78206C7F69FBD7D3CA2; // 0x1788(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3A90EA73465203B932B22CAEEEC593B6; // 0x17D0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_F147377C46AF153E4F67CE926283FE82; // 0x1838(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0AE8F66348E9A71F60DE749C55015781; // 0x1880(0x0048)()
	struct FAnimNode_EndAdjustOrientation         AnimGraphNode_EndAdjustOrientation_00EDBA804B41FCA79F6CC189D92FF30C; // 0x18C8(0x00A0)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_1A6A9C8C42AE32419FBB63AD1B4E9C26; // 0x1968(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_28B454874BD56C3C6A8064B10FAB6D6A; // 0x1998(0x0068)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_F3221CDA4D5E8DB95C475099F25ACA71; // 0x1A00(0x0048)()
	uint8                                         Pad_1A48[0x8];                                     // 0x1A48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_EndFullBodySolver            AnimGraphNode_EndFullBodySolver_F12240A1473360106D31A2B99605253D; // 0x1A50(0x0940)()
	struct FAnimNode_EndFace                      AnimGraphNode_EndFace_91E0EBA6407A3E963756B39DB9520715; // 0x2390(0x03B0)()
	struct FAnimNode_EndFaceBlend                 AnimGraphNode_EndFaceBlend_9910EBE949F26C6B1B68798ED4448A56; // 0x2740(0x0070)()
	struct FAnimNode_EndPhysicalRotate            AnimGraphNode_EndPhysicalRotate_3F472F9441DA273944196889734635C3; // 0x27B0(0x0110)()

public:
	void ExecuteUbergraph_PC0000_00_Cloud_Soldier_Animation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PC0000_00_Cloud_Soldier_Animation_C">();
	}
	static class UPC0000_00_Cloud_Soldier_Animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPC0000_00_Cloud_Soldier_Animation_C>();
	}
};
static_assert(alignof(UPC0000_00_Cloud_Soldier_Animation_C) == 0x000010, "Wrong alignment on UPC0000_00_Cloud_Soldier_Animation_C");
static_assert(sizeof(UPC0000_00_Cloud_Soldier_Animation_C) == 0x0028C0, "Wrong size on UPC0000_00_Cloud_Soldier_Animation_C");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, UberGraphFrame) == 0x001780, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_Root_5C55EC7143AFA78206C7F69FBD7D3CA2) == 0x001788, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_Root_5C55EC7143AFA78206C7F69FBD7D3CA2' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_Slot_3A90EA73465203B932B22CAEEEC593B6) == 0x0017D0, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_Slot_3A90EA73465203B932B22CAEEEC593B6' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_LocalToComponentSpace_F147377C46AF153E4F67CE926283FE82) == 0x001838, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_LocalToComponentSpace_F147377C46AF153E4F67CE926283FE82' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_ComponentToLocalSpace_0AE8F66348E9A71F60DE749C55015781) == 0x001880, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_ComponentToLocalSpace_0AE8F66348E9A71F60DE749C55015781' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_EndAdjustOrientation_00EDBA804B41FCA79F6CC189D92FF30C) == 0x0018C8, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_EndAdjustOrientation_00EDBA804B41FCA79F6CC189D92FF30C' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_EndBehavior_1A6A9C8C42AE32419FBB63AD1B4E9C26) == 0x001968, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_EndBehavior_1A6A9C8C42AE32419FBB63AD1B4E9C26' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_Slot_28B454874BD56C3C6A8064B10FAB6D6A) == 0x001998, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_Slot_28B454874BD56C3C6A8064B10FAB6D6A' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_EndSaveLastPose_F3221CDA4D5E8DB95C475099F25ACA71) == 0x001A00, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_EndSaveLastPose_F3221CDA4D5E8DB95C475099F25ACA71' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_EndFullBodySolver_F12240A1473360106D31A2B99605253D) == 0x001A50, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_EndFullBodySolver_F12240A1473360106D31A2B99605253D' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_EndFace_91E0EBA6407A3E963756B39DB9520715) == 0x002390, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_EndFace_91E0EBA6407A3E963756B39DB9520715' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_EndFaceBlend_9910EBE949F26C6B1B68798ED4448A56) == 0x002740, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_EndFaceBlend_9910EBE949F26C6B1B68798ED4448A56' has a wrong offset!");
static_assert(offsetof(UPC0000_00_Cloud_Soldier_Animation_C, AnimGraphNode_EndPhysicalRotate_3F472F9441DA273944196889734635C3) == 0x0027B0, "Member 'UPC0000_00_Cloud_Soldier_Animation_C::AnimGraphNode_EndPhysicalRotate_3F472F9441DA273944196889734635C3' has a wrong offset!");

}

