#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PC0002_00_Tifa_Standard_AI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PC0002_00_Tifa_Standard_AI.PC0002_00_Tifa_Standard_AI_C
// 0x0018 (0x38B8 - 0x38A0)
class APC0002_00_Tifa_Standard_AI_C final : public AEndBattleAITifaController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x38A0(0x0008)(Transient, DuplicateTransient)
	class FName                                   TestInt;                                           // 0x38A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TestBool;                                          // 0x38B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PC0002_00_Tifa_Standard_AI(int32 EntryPoint);
	void InpActEvt_BackSpace_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Delete_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_End_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Home_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_Insert_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_PageDown_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_PageUp_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PC0002_00_Tifa_Standard_AI_C">();
	}
	static class APC0002_00_Tifa_Standard_AI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APC0002_00_Tifa_Standard_AI_C>();
	}
};
static_assert(alignof(APC0002_00_Tifa_Standard_AI_C) == 0x000008, "Wrong alignment on APC0002_00_Tifa_Standard_AI_C");
static_assert(sizeof(APC0002_00_Tifa_Standard_AI_C) == 0x0038B8, "Wrong size on APC0002_00_Tifa_Standard_AI_C");
static_assert(offsetof(APC0002_00_Tifa_Standard_AI_C, UberGraphFrame) == 0x0038A0, "Member 'APC0002_00_Tifa_Standard_AI_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APC0002_00_Tifa_Standard_AI_C, TestInt) == 0x0038A8, "Member 'APC0002_00_Tifa_Standard_AI_C::TestInt' has a wrong offset!");
static_assert(offsetof(APC0002_00_Tifa_Standard_AI_C, TestBool) == 0x0038B0, "Member 'APC0002_00_Tifa_Standard_AI_C::TestBool' has a wrong offset!");

}

