#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quest_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest_Cell.Quest_Cell_C
// 0x00E0 (0x0440 - 0x0360)
class UQuest_Cell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       BtnHover_Closed;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Now;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ClosedNotRelease;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Closed;                                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Clear;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PastClear;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PastRelease;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       PastNotRelease;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NowClear;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NowPriority;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NowRelease;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       NowNotRelease;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Thumbnail;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_QuestThumbnail;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_Clear;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear_Past;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ImgWaku;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndListBox*                            Progress_List;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Quest_Btn;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuest_PriorityMark_C*                  Quest_PriorityMark;                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           TriangleBase;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           TriangleBaseShadow;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Clear;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_Num;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Quest_Title;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Quest_Cell(int32 EntryPoint);
	void BndEvt__Quest_Btn_K2Node_ComponentBoundEvent_161_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Quest_Btn_K2Node_ComponentBoundEvent_174_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest_Cell_C">();
	}
	static class UQuest_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuest_Cell_C>();
	}
};
static_assert(alignof(UQuest_Cell_C) == 0x000008, "Wrong alignment on UQuest_Cell_C");
static_assert(sizeof(UQuest_Cell_C) == 0x000440, "Wrong size on UQuest_Cell_C");
static_assert(offsetof(UQuest_Cell_C, UberGraphFrame) == 0x000360, "Member 'UQuest_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, BtnHover_Closed) == 0x000368, "Member 'UQuest_Cell_C::BtnHover_Closed' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, BtnHover_Now) == 0x000370, "Member 'UQuest_Cell_C::BtnHover_Now' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, ClosedNotRelease) == 0x000378, "Member 'UQuest_Cell_C::ClosedNotRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Closed) == 0x000380, "Member 'UQuest_Cell_C::Closed' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Clear) == 0x000388, "Member 'UQuest_Cell_C::Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, PastClear) == 0x000390, "Member 'UQuest_Cell_C::PastClear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, PastRelease) == 0x000398, "Member 'UQuest_Cell_C::PastRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, PastNotRelease) == 0x0003A0, "Member 'UQuest_Cell_C::PastNotRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, NowClear) == 0x0003A8, "Member 'UQuest_Cell_C::NowClear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, NowPriority) == 0x0003B0, "Member 'UQuest_Cell_C::NowPriority' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, NowRelease) == 0x0003B8, "Member 'UQuest_Cell_C::NowRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, NowNotRelease) == 0x0003C0, "Member 'UQuest_Cell_C::NowNotRelease' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Base_Thumbnail) == 0x0003C8, "Member 'UQuest_Cell_C::Base_Thumbnail' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Billboard_QuestThumbnail) == 0x0003D0, "Member 'UQuest_Cell_C::Billboard_QuestThumbnail' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, BtnLight) == 0x0003D8, "Member 'UQuest_Cell_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Icon_Clear) == 0x0003E0, "Member 'UQuest_Cell_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Icon_Clear_Past) == 0x0003E8, "Member 'UQuest_Cell_C::Icon_Clear_Past' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, ImgWaku) == 0x0003F0, "Member 'UQuest_Cell_C::ImgWaku' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Progress_List) == 0x0003F8, "Member 'UQuest_Cell_C::Progress_List' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Quest_Btn) == 0x000400, "Member 'UQuest_Cell_C::Quest_Btn' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Quest_PriorityMark) == 0x000408, "Member 'UQuest_Cell_C::Quest_PriorityMark' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Shadow) == 0x000410, "Member 'UQuest_Cell_C::Shadow' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, TriangleBase) == 0x000418, "Member 'UQuest_Cell_C::TriangleBase' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, TriangleBaseShadow) == 0x000420, "Member 'UQuest_Cell_C::TriangleBaseShadow' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Txt_Clear) == 0x000428, "Member 'UQuest_Cell_C::Txt_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Txt_Quest_Num) == 0x000430, "Member 'UQuest_Cell_C::Txt_Quest_Num' has a wrong offset!");
static_assert(offsetof(UQuest_Cell_C, Txt_Quest_Title) == 0x000438, "Member 'UQuest_Cell_C::Txt_Quest_Title' has a wrong offset!");

}

