#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Quest_Window

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Quest_Window.Quest_Window_C
// 0x0100 (0x0530 - 0x0430)
class UQuest_Window_C final : public UEndStoryDetailWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Menu_Out;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In_old;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_PastClear;                             // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_Fail;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_Clear;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_Priority;                              // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       QuestWindow_Now;                                   // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseSpace1;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Controller_bg3;                                    // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DetailBase;                                        // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DownLight;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLight;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightDot;                                          // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              PriorityIcon;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndVirtualScrollBox*                   Quest_Info_List;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Shadow;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           TriangleBase;                                      // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           TriangleBase2;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndPieImage*                           TriangleBaseShadow;                                // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              UpLight;                                           // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Quest_Window(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Quest_Window_C">();
	}
	static class UQuest_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuest_Window_C>();
	}
};
static_assert(alignof(UQuest_Window_C) == 0x000008, "Wrong alignment on UQuest_Window_C");
static_assert(sizeof(UQuest_Window_C) == 0x000530, "Wrong size on UQuest_Window_C");
static_assert(offsetof(UQuest_Window_C, UberGraphFrame) == 0x000430, "Member 'UQuest_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Menu_Out) == 0x000438, "Member 'UQuest_Window_C::Menu_Out' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Menu_In_old) == 0x000440, "Member 'UQuest_Window_C::Menu_In_old' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_PastClear) == 0x000448, "Member 'UQuest_Window_C::QuestWindow_PastClear' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_Fail) == 0x000450, "Member 'UQuest_Window_C::QuestWindow_Fail' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_Clear) == 0x000458, "Member 'UQuest_Window_C::QuestWindow_Clear' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_Priority) == 0x000460, "Member 'UQuest_Window_C::QuestWindow_Priority' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Menu_In) == 0x000468, "Member 'UQuest_Window_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, QuestWindow_Now) == 0x000470, "Member 'UQuest_Window_C::QuestWindow_Now' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Base1) == 0x000478, "Member 'UQuest_Window_C::Base1' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Base2) == 0x000480, "Member 'UQuest_Window_C::Base2' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, BaseSpace1) == 0x000488, "Member 'UQuest_Window_C::BaseSpace1' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Controller_bg3) == 0x000490, "Member 'UQuest_Window_C::Controller_bg3' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, DetailBase) == 0x000498, "Member 'UQuest_Window_C::DetailBase' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, DownLight) == 0x0004A0, "Member 'UQuest_Window_C::DownLight' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, EndImage_1) == 0x0004A8, "Member 'UQuest_Window_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, EndImage_2) == 0x0004B0, "Member 'UQuest_Window_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, EndImage_3) == 0x0004B8, "Member 'UQuest_Window_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, EndImage_4) == 0x0004C0, "Member 'UQuest_Window_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, EndImage_5) == 0x0004C8, "Member 'UQuest_Window_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Frame1) == 0x0004D0, "Member 'UQuest_Window_C::Frame1' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, LeftLight) == 0x0004D8, "Member 'UQuest_Window_C::LeftLight' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, LightDot) == 0x0004E0, "Member 'UQuest_Window_C::LightDot' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, PriorityIcon) == 0x0004E8, "Member 'UQuest_Window_C::PriorityIcon' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Quest_Info_List) == 0x0004F0, "Member 'UQuest_Window_C::Quest_Info_List' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Shadow) == 0x0004F8, "Member 'UQuest_Window_C::Shadow' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Title_Line) == 0x000500, "Member 'UQuest_Window_C::Title_Line' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, TriangleBase) == 0x000508, "Member 'UQuest_Window_C::TriangleBase' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, TriangleBase2) == 0x000510, "Member 'UQuest_Window_C::TriangleBase2' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, TriangleBaseShadow) == 0x000518, "Member 'UQuest_Window_C::TriangleBaseShadow' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, Txt_Btn) == 0x000520, "Member 'UQuest_Window_C::Txt_Btn' has a wrong offset!");
static_assert(offsetof(UQuest_Window_C, UpLight) == 0x000528, "Member 'UQuest_Window_C::UpLight' has a wrong offset!");

}

