#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveData_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveData_Cell.SaveData_Cell_C
// 0x0100 (0x04A8 - 0x03A8)
class USaveData_Cell_C final : public UEndSaveDataCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       BtnIn;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnNormal;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_SaveDate_List;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base3;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base3_2;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_ClearBase1;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Icon_Loca;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Level_BG;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_ListNum_00;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_ListNum_01;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Img_SaveScreen;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Waku;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_Contents;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Date;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Finished;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ListNum;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_PlayTime;                                      // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SaveMode;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Time;                                          // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Loca;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_Mission;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title_PlayTime;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnCancelled;                                       // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_SaveData_Cell(int32 EntryPoint);
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_73_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_86_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveData_Cell_C">();
	}
	static class USaveData_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveData_Cell_C>();
	}
};
static_assert(alignof(USaveData_Cell_C) == 0x000008, "Wrong alignment on USaveData_Cell_C");
static_assert(sizeof(USaveData_Cell_C) == 0x0004A8, "Wrong size on USaveData_Cell_C");
static_assert(offsetof(USaveData_Cell_C, UberGraphFrame) == 0x0003A8, "Member 'USaveData_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, BtnIn) == 0x0003B0, "Member 'USaveData_Cell_C::BtnIn' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, BtnNormal) == 0x0003B8, "Member 'USaveData_Cell_C::BtnNormal' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, BtnHover) == 0x0003C0, "Member 'USaveData_Cell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, All_SaveDate_List) == 0x0003C8, "Member 'USaveData_Cell_C::All_SaveDate_List' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Base2) == 0x0003D0, "Member 'USaveData_Cell_C::Base2' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Base3) == 0x0003D8, "Member 'USaveData_Cell_C::Base3' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Base3_2) == 0x0003E0, "Member 'USaveData_Cell_C::Base3_2' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Button_00) == 0x0003E8, "Member 'USaveData_Cell_C::Button_00' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, EndImage_3) == 0x0003F0, "Member 'USaveData_Cell_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, HoverBase) == 0x0003F8, "Member 'USaveData_Cell_C::HoverBase' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_ClearBase1) == 0x000400, "Member 'USaveData_Cell_C::Img_ClearBase1' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_Icon_Loca) == 0x000408, "Member 'USaveData_Cell_C::Img_Icon_Loca' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_Level_BG) == 0x000410, "Member 'USaveData_Cell_C::Img_Level_BG' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_ListNum_00) == 0x000418, "Member 'USaveData_Cell_C::Img_ListNum_00' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_ListNum_01) == 0x000420, "Member 'USaveData_Cell_C::Img_ListNum_01' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_SaveScreen) == 0x000428, "Member 'USaveData_Cell_C::Img_SaveScreen' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Img_Waku) == 0x000430, "Member 'USaveData_Cell_C::Img_Waku' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Nut_Contents) == 0x000438, "Member 'USaveData_Cell_C::Nut_Contents' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Date) == 0x000440, "Member 'USaveData_Cell_C::Txt_Date' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Finished) == 0x000448, "Member 'USaveData_Cell_C::Txt_Finished' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_ListNum) == 0x000450, "Member 'USaveData_Cell_C::Txt_ListNum' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_PlayTime) == 0x000458, "Member 'USaveData_Cell_C::Txt_PlayTime' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_SaveMode) == 0x000460, "Member 'USaveData_Cell_C::Txt_SaveMode' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Time) == 0x000468, "Member 'USaveData_Cell_C::Txt_Time' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Title_Loca) == 0x000470, "Member 'USaveData_Cell_C::Txt_Title_Loca' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Title_Mission) == 0x000478, "Member 'USaveData_Cell_C::Txt_Title_Mission' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, Txt_Title_PlayTime) == 0x000480, "Member 'USaveData_Cell_C::Txt_Title_PlayTime' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, OnClicked) == 0x000488, "Member 'USaveData_Cell_C::OnClicked' has a wrong offset!");
static_assert(offsetof(USaveData_Cell_C, OnCancelled) == 0x000498, "Member 'USaveData_Cell_C::OnCancelled' has a wrong offset!");

}

