#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveData_CellLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveData_CellLight.SaveData_CellLight_C
// 0x0050 (0x03F8 - 0x03A8)
class USaveData_CellLight_C final : public UEndSaveDataCell
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_SaveDate_List;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnCancelled;                                       // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_SaveData_CellLight(int32 EntryPoint);
	void Construct();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveData_CellLight_C">();
	}
	static class USaveData_CellLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveData_CellLight_C>();
	}
};
static_assert(alignof(USaveData_CellLight_C) == 0x000008, "Wrong alignment on USaveData_CellLight_C");
static_assert(sizeof(USaveData_CellLight_C) == 0x0003F8, "Wrong size on USaveData_CellLight_C");
static_assert(offsetof(USaveData_CellLight_C, UberGraphFrame) == 0x0003A8, "Member 'USaveData_CellLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USaveData_CellLight_C, Loop) == 0x0003B0, "Member 'USaveData_CellLight_C::Loop' has a wrong offset!");
static_assert(offsetof(USaveData_CellLight_C, All_SaveDate_List) == 0x0003B8, "Member 'USaveData_CellLight_C::All_SaveDate_List' has a wrong offset!");
static_assert(offsetof(USaveData_CellLight_C, BtnLight) == 0x0003C0, "Member 'USaveData_CellLight_C::BtnLight' has a wrong offset!");
static_assert(offsetof(USaveData_CellLight_C, BtnLight2) == 0x0003C8, "Member 'USaveData_CellLight_C::BtnLight2' has a wrong offset!");
static_assert(offsetof(USaveData_CellLight_C, HoverBase) == 0x0003D0, "Member 'USaveData_CellLight_C::HoverBase' has a wrong offset!");
static_assert(offsetof(USaveData_CellLight_C, OnClicked) == 0x0003D8, "Member 'USaveData_CellLight_C::OnClicked' has a wrong offset!");
static_assert(offsetof(USaveData_CellLight_C, OnCancelled) == 0x0003E8, "Member 'USaveData_CellLight_C::OnCancelled' has a wrong offset!");

}

