#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveIcon.SaveIcon_C
// 0x0058 (0x03B8 - 0x0360)
class USaveIcon_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       SaveFail;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Save;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CheckPoint;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       LoopCenter;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_CenterSet;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Ring;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Ring2;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SaveIcon(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveIcon_C">();
	}
	static class USaveIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveIcon_C>();
	}
};
static_assert(alignof(USaveIcon_C) == 0x000008, "Wrong alignment on USaveIcon_C");
static_assert(sizeof(USaveIcon_C) == 0x0003B8, "Wrong size on USaveIcon_C");
static_assert(offsetof(USaveIcon_C, UberGraphFrame) == 0x000360, "Member 'USaveIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, SaveFail) == 0x000368, "Member 'USaveIcon_C::SaveFail' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, Save) == 0x000370, "Member 'USaveIcon_C::Save' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, CheckPoint) == 0x000378, "Member 'USaveIcon_C::CheckPoint' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, LoopCenter) == 0x000380, "Member 'USaveIcon_C::LoopCenter' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, Base) == 0x000388, "Member 'USaveIcon_C::Base' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, Icon_CenterSet) == 0x000390, "Member 'USaveIcon_C::Icon_CenterSet' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, Icon_Ring) == 0x000398, "Member 'USaveIcon_C::Icon_Ring' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, Icon_Ring2) == 0x0003A0, "Member 'USaveIcon_C::Icon_Ring2' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, Light) == 0x0003A8, "Member 'USaveIcon_C::Light' has a wrong offset!");
static_assert(offsetof(USaveIcon_C, Txt_Info) == 0x0003B0, "Member 'USaveIcon_C::Txt_Info' has a wrong offset!");

}

