#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveData

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SaveData.SaveData_C
// 0x0040 (0x03A0 - 0x0360)
class USaveData_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_SaveData;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Img;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Window_00_C*                  MainMenu_Window_00;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBorder*                             SaveData_BlackBg;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SaveData(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SaveData_C">();
	}
	static class USaveData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USaveData_C>();
	}
};
static_assert(alignof(USaveData_C) == 0x000008, "Wrong alignment on USaveData_C");
static_assert(sizeof(USaveData_C) == 0x0003A0, "Wrong size on USaveData_C");
static_assert(offsetof(USaveData_C, UberGraphFrame) == 0x000360, "Member 'USaveData_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USaveData_C, Menu_In) == 0x000368, "Member 'USaveData_C::Menu_In' has a wrong offset!");
static_assert(offsetof(USaveData_C, All_SaveData) == 0x000370, "Member 'USaveData_C::All_SaveData' has a wrong offset!");
static_assert(offsetof(USaveData_C, Billboard_Img) == 0x000378, "Member 'USaveData_C::Billboard_Img' has a wrong offset!");
static_assert(offsetof(USaveData_C, LeftLine) == 0x000380, "Member 'USaveData_C::LeftLine' has a wrong offset!");
static_assert(offsetof(USaveData_C, ListBg2) == 0x000388, "Member 'USaveData_C::ListBg2' has a wrong offset!");
static_assert(offsetof(USaveData_C, MainMenu_Window_00) == 0x000390, "Member 'USaveData_C::MainMenu_Window_00' has a wrong offset!");
static_assert(offsetof(USaveData_C, SaveData_BlackBg) == 0x000398, "Member 'USaveData_C::SaveData_BlackBg' has a wrong offset!");

}

