#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Screenshot_Item

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Screenshot_Item.Screenshot_Item_C
// 0x00D0 (0x0430 - 0x0360)
class UScreenshot_Item_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Arrow_Down;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_Left;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_Left2;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_Right;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_Right2;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_Up;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bar;                                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bar_point1;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bar_point2;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bar_point3;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Bar_point4;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base;                                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FilderList;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_Shadow;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              SliderValue;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScreenshot_Icon_C*                     Title_Icon;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScreenshot_Icon_C*                     Title_Icon_Down;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScreenshot_Icon_C*                     Title_Icon_Up;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_LineShadow;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn;                                           // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Btn2;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SelectTile;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Screenshot_Item_C">();
	}
	static class UScreenshot_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScreenshot_Item_C>();
	}
};
static_assert(alignof(UScreenshot_Item_C) == 0x000008, "Wrong alignment on UScreenshot_Item_C");
static_assert(sizeof(UScreenshot_Item_C) == 0x000430, "Wrong size on UScreenshot_Item_C");
static_assert(offsetof(UScreenshot_Item_C, Arrow_Down) == 0x000360, "Member 'UScreenshot_Item_C::Arrow_Down' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Arrow_Left) == 0x000368, "Member 'UScreenshot_Item_C::Arrow_Left' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Arrow_Left2) == 0x000370, "Member 'UScreenshot_Item_C::Arrow_Left2' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Arrow_Right) == 0x000378, "Member 'UScreenshot_Item_C::Arrow_Right' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Arrow_Right2) == 0x000380, "Member 'UScreenshot_Item_C::Arrow_Right2' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Arrow_Up) == 0x000388, "Member 'UScreenshot_Item_C::Arrow_Up' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Bar) == 0x000390, "Member 'UScreenshot_Item_C::Bar' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Bar_point1) == 0x000398, "Member 'UScreenshot_Item_C::Bar_point1' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Bar_point2) == 0x0003A0, "Member 'UScreenshot_Item_C::Bar_point2' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Bar_point3) == 0x0003A8, "Member 'UScreenshot_Item_C::Bar_point3' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Bar_point4) == 0x0003B0, "Member 'UScreenshot_Item_C::Bar_point4' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Base) == 0x0003B8, "Member 'UScreenshot_Item_C::Base' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, FilderList) == 0x0003C0, "Member 'UScreenshot_Item_C::FilderList' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Frame) == 0x0003C8, "Member 'UScreenshot_Item_C::Frame' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Frame2) == 0x0003D0, "Member 'UScreenshot_Item_C::Frame2' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Frame_Shadow) == 0x0003D8, "Member 'UScreenshot_Item_C::Frame_Shadow' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, SliderValue) == 0x0003E0, "Member 'UScreenshot_Item_C::SliderValue' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Title_Icon) == 0x0003E8, "Member 'UScreenshot_Item_C::Title_Icon' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Title_Icon_Down) == 0x0003F0, "Member 'UScreenshot_Item_C::Title_Icon_Down' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Title_Icon_Up) == 0x0003F8, "Member 'UScreenshot_Item_C::Title_Icon_Up' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Title_Line) == 0x000400, "Member 'UScreenshot_Item_C::Title_Line' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Title_LineShadow) == 0x000408, "Member 'UScreenshot_Item_C::Title_LineShadow' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Txt_Btn) == 0x000410, "Member 'UScreenshot_Item_C::Txt_Btn' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Txt_Btn2) == 0x000418, "Member 'UScreenshot_Item_C::Txt_Btn2' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Txt_SelectTile) == 0x000420, "Member 'UScreenshot_Item_C::Txt_SelectTile' has a wrong offset!");
static_assert(offsetof(UScreenshot_Item_C, Txt_Title) == 0x000428, "Member 'UScreenshot_Item_C::Txt_Title' has a wrong offset!");

}

