#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sense_TargetCursor

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Sense_TargetCursor.Sense_TargetCursor_C
// 0x0070 (0x03D0 - 0x0360)
class USense_TargetCursor_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_A00;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_A01;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_A02;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_A03;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_B00;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_B01;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_B02;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_B03;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_B04;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_B05;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Target_B06;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sense_TargetCursor_C">();
	}
	static class USense_TargetCursor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USense_TargetCursor_C>();
	}
};
static_assert(alignof(USense_TargetCursor_C) == 0x000008, "Wrong alignment on USense_TargetCursor_C");
static_assert(sizeof(USense_TargetCursor_C) == 0x0003D0, "Wrong size on USense_TargetCursor_C");
static_assert(offsetof(USense_TargetCursor_C, Out) == 0x000360, "Member 'USense_TargetCursor_C::Out' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Loop) == 0x000368, "Member 'USense_TargetCursor_C::Loop' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, In) == 0x000370, "Member 'USense_TargetCursor_C::In' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_A00) == 0x000378, "Member 'USense_TargetCursor_C::Img_Target_A00' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_A01) == 0x000380, "Member 'USense_TargetCursor_C::Img_Target_A01' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_A02) == 0x000388, "Member 'USense_TargetCursor_C::Img_Target_A02' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_A03) == 0x000390, "Member 'USense_TargetCursor_C::Img_Target_A03' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_B00) == 0x000398, "Member 'USense_TargetCursor_C::Img_Target_B00' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_B01) == 0x0003A0, "Member 'USense_TargetCursor_C::Img_Target_B01' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_B02) == 0x0003A8, "Member 'USense_TargetCursor_C::Img_Target_B02' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_B03) == 0x0003B0, "Member 'USense_TargetCursor_C::Img_Target_B03' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_B04) == 0x0003B8, "Member 'USense_TargetCursor_C::Img_Target_B04' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_B05) == 0x0003C0, "Member 'USense_TargetCursor_C::Img_Target_B05' has a wrong offset!");
static_assert(offsetof(USense_TargetCursor_C, Img_Target_B06) == 0x0003C8, "Member 'USense_TargetCursor_C::Img_Target_B06' has a wrong offset!");

}

