#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sense

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Sense.Sense_C
// 0x0128 (0x0898 - 0x0770)
class USense_C final : public UEndEnemyDetailWindow
{
public:
	class UWidgetAnimation*                       MenuOff;                                           // 0x0770(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       IconInfo_In;                                       // 0x0778(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightInfo_Switching;                               // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0790(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_00;                                          // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Arrow_01;                                          // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Type;                                         // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_RB;                                           // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Deco_RT;                                           // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_HP;                                          // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Left;                                         // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Right;                                        // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_L;                                        // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_R;                                        // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Filter;                                        // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_HP_Gauge_BG;                                   // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_NameBase;                                      // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_SurveyTarget;                                  // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Ims_Icon;                                          // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light3;                                            // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCom_Loading_Simple2_C*                 LoadingCircle;                                     // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Nut_HP;                                            // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              RightMenu_BG;                                      // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USense_Title_Cell_C*                    Title_Ability;                                     // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USense_Title_Cell_C*                    Title_Acquisition;                                 // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USense_Title_Cell_C*                    Title_DropItems;                                   // 0x0850(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USense_Title_Cell_C*                    Title_Log;                                         // 0x0858(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USense_Title_Cell_C*                    Title_RareDropItems;                               // 0x0860(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USense_Title_Cell_C*                    Title_Resistances;                                 // 0x0868(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USense_Title_Cell_C*                    Title_Steal;                                       // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          txt_hp;                                            // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HP_Num;                                        // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_HP_NumMax;                                     // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          txt_type;                                          // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sense_C">();
	}
	static class USense_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USense_C>();
	}
};
static_assert(alignof(USense_C) == 0x000008, "Wrong alignment on USense_C");
static_assert(sizeof(USense_C) == 0x000898, "Wrong size on USense_C");
static_assert(offsetof(USense_C, MenuOff) == 0x000770, "Member 'USense_C::MenuOff' has a wrong offset!");
static_assert(offsetof(USense_C, IconInfo_In) == 0x000778, "Member 'USense_C::IconInfo_In' has a wrong offset!");
static_assert(offsetof(USense_C, RightInfo_Switching) == 0x000780, "Member 'USense_C::RightInfo_Switching' has a wrong offset!");
static_assert(offsetof(USense_C, Out) == 0x000788, "Member 'USense_C::Out' has a wrong offset!");
static_assert(offsetof(USense_C, In) == 0x000790, "Member 'USense_C::In' has a wrong offset!");
static_assert(offsetof(USense_C, Arrow_00) == 0x000798, "Member 'USense_C::Arrow_00' has a wrong offset!");
static_assert(offsetof(USense_C, Arrow_01) == 0x0007A0, "Member 'USense_C::Arrow_01' has a wrong offset!");
static_assert(offsetof(USense_C, Base_Type) == 0x0007A8, "Member 'USense_C::Base_Type' has a wrong offset!");
static_assert(offsetof(USense_C, Deco_RB) == 0x0007B0, "Member 'USense_C::Deco_RB' has a wrong offset!");
static_assert(offsetof(USense_C, Deco_RT) == 0x0007B8, "Member 'USense_C::Deco_RT' has a wrong offset!");
static_assert(offsetof(USense_C, EndImage_2) == 0x0007C0, "Member 'USense_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(USense_C, Gauge_HP) == 0x0007C8, "Member 'USense_C::Gauge_HP' has a wrong offset!");
static_assert(offsetof(USense_C, Icon_Left) == 0x0007D0, "Member 'USense_C::Icon_Left' has a wrong offset!");
static_assert(offsetof(USense_C, Icon_Right) == 0x0007D8, "Member 'USense_C::Icon_Right' has a wrong offset!");
static_assert(offsetof(USense_C, Img_Base_00) == 0x0007E0, "Member 'USense_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(USense_C, Img_Base_L) == 0x0007E8, "Member 'USense_C::Img_Base_L' has a wrong offset!");
static_assert(offsetof(USense_C, Img_Base_R) == 0x0007F0, "Member 'USense_C::Img_Base_R' has a wrong offset!");
static_assert(offsetof(USense_C, Img_Filter) == 0x0007F8, "Member 'USense_C::Img_Filter' has a wrong offset!");
static_assert(offsetof(USense_C, Img_HP_Gauge_BG) == 0x000800, "Member 'USense_C::Img_HP_Gauge_BG' has a wrong offset!");
static_assert(offsetof(USense_C, Img_NameBase) == 0x000808, "Member 'USense_C::Img_NameBase' has a wrong offset!");
static_assert(offsetof(USense_C, Img_SurveyTarget) == 0x000810, "Member 'USense_C::Img_SurveyTarget' has a wrong offset!");
static_assert(offsetof(USense_C, Ims_Icon) == 0x000818, "Member 'USense_C::Ims_Icon' has a wrong offset!");
static_assert(offsetof(USense_C, Light3) == 0x000820, "Member 'USense_C::Light3' has a wrong offset!");
static_assert(offsetof(USense_C, LoadingCircle) == 0x000828, "Member 'USense_C::LoadingCircle' has a wrong offset!");
static_assert(offsetof(USense_C, Nut_HP) == 0x000830, "Member 'USense_C::Nut_HP' has a wrong offset!");
static_assert(offsetof(USense_C, RightMenu_BG) == 0x000838, "Member 'USense_C::RightMenu_BG' has a wrong offset!");
static_assert(offsetof(USense_C, Title_Ability) == 0x000840, "Member 'USense_C::Title_Ability' has a wrong offset!");
static_assert(offsetof(USense_C, Title_Acquisition) == 0x000848, "Member 'USense_C::Title_Acquisition' has a wrong offset!");
static_assert(offsetof(USense_C, Title_DropItems) == 0x000850, "Member 'USense_C::Title_DropItems' has a wrong offset!");
static_assert(offsetof(USense_C, Title_Log) == 0x000858, "Member 'USense_C::Title_Log' has a wrong offset!");
static_assert(offsetof(USense_C, Title_RareDropItems) == 0x000860, "Member 'USense_C::Title_RareDropItems' has a wrong offset!");
static_assert(offsetof(USense_C, Title_Resistances) == 0x000868, "Member 'USense_C::Title_Resistances' has a wrong offset!");
static_assert(offsetof(USense_C, Title_Steal) == 0x000870, "Member 'USense_C::Title_Steal' has a wrong offset!");
static_assert(offsetof(USense_C, txt_hp) == 0x000878, "Member 'USense_C::txt_hp' has a wrong offset!");
static_assert(offsetof(USense_C, Txt_HP_Num) == 0x000880, "Member 'USense_C::Txt_HP_Num' has a wrong offset!");
static_assert(offsetof(USense_C, Txt_HP_NumMax) == 0x000888, "Member 'USense_C::Txt_HP_NumMax' has a wrong offset!");
static_assert(offsetof(USense_C, txt_type) == 0x000890, "Member 'USense_C::txt_type' has a wrong offset!");

}

