#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_Select_Number

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_Select_Number.Shop_Select_Number_C
// 0x0030 (0x0390 - 0x0360)
class UShop_Select_Number_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       In;                                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame_Light;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_00;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Arrow_01;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_Select_Number_C">();
	}
	static class UShop_Select_Number_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_Select_Number_C>();
	}
};
static_assert(alignof(UShop_Select_Number_C) == 0x000008, "Wrong alignment on UShop_Select_Number_C");
static_assert(sizeof(UShop_Select_Number_C) == 0x000390, "Wrong size on UShop_Select_Number_C");
static_assert(offsetof(UShop_Select_Number_C, In) == 0x000360, "Member 'UShop_Select_Number_C::In' has a wrong offset!");
static_assert(offsetof(UShop_Select_Number_C, Loop) == 0x000368, "Member 'UShop_Select_Number_C::Loop' has a wrong offset!");
static_assert(offsetof(UShop_Select_Number_C, Frame) == 0x000370, "Member 'UShop_Select_Number_C::Frame' has a wrong offset!");
static_assert(offsetof(UShop_Select_Number_C, Frame_Light) == 0x000378, "Member 'UShop_Select_Number_C::Frame_Light' has a wrong offset!");
static_assert(offsetof(UShop_Select_Number_C, Img_Arrow_00) == 0x000380, "Member 'UShop_Select_Number_C::Img_Arrow_00' has a wrong offset!");
static_assert(offsetof(UShop_Select_Number_C, Img_Arrow_01) == 0x000388, "Member 'UShop_Select_Number_C::Img_Arrow_01' has a wrong offset!");

}

