#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_List_VRBattle_Cell

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_List_VRBattle_Cell.Shop_List_VRBattle_Cell_C
// 0x0030 (0x0390 - 0x0360)
class UShop_List_VRBattle_Cell_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       BtnNormalHover;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Btn_List;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverLight;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Clear;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Icon_Now_C*                   Icon_Now;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Name;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_List_VRBattle_Cell_C">();
	}
	static class UShop_List_VRBattle_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_List_VRBattle_Cell_C>();
	}
};
static_assert(alignof(UShop_List_VRBattle_Cell_C) == 0x000008, "Wrong alignment on UShop_List_VRBattle_Cell_C");
static_assert(sizeof(UShop_List_VRBattle_Cell_C) == 0x000390, "Wrong size on UShop_List_VRBattle_Cell_C");
static_assert(offsetof(UShop_List_VRBattle_Cell_C, BtnNormalHover) == 0x000360, "Member 'UShop_List_VRBattle_Cell_C::BtnNormalHover' has a wrong offset!");
static_assert(offsetof(UShop_List_VRBattle_Cell_C, Btn_List) == 0x000368, "Member 'UShop_List_VRBattle_Cell_C::Btn_List' has a wrong offset!");
static_assert(offsetof(UShop_List_VRBattle_Cell_C, HoverLight) == 0x000370, "Member 'UShop_List_VRBattle_Cell_C::HoverLight' has a wrong offset!");
static_assert(offsetof(UShop_List_VRBattle_Cell_C, Icon_Clear) == 0x000378, "Member 'UShop_List_VRBattle_Cell_C::Icon_Clear' has a wrong offset!");
static_assert(offsetof(UShop_List_VRBattle_Cell_C, Icon_Now) == 0x000380, "Member 'UShop_List_VRBattle_Cell_C::Icon_Now' has a wrong offset!");
static_assert(offsetof(UShop_List_VRBattle_Cell_C, Txt_Name) == 0x000388, "Member 'UShop_List_VRBattle_Cell_C::Txt_Name' has a wrong offset!");

}

