#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_VRBattle_Info

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_VRBattle_Info.Shop_VRBattle_Info_C
// 0x0108 (0x0468 - 0x0360)
class UShop_VRBattle_Info_C final : public UEndUserWidget
{
public:
	class UEndImage*                              BgLine;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Bg;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_ReportImg;                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_3;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_4;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_5;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_6;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame1;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame2;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame3;                                            // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame4;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame5;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Frame6;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              GoalBase;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconLeft;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              IconRight;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Left_Line;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightBg01;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Right_Line;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TermBase;                                          // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Title_Icon;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Goal;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_GoalTitle;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ReportNumber;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_ReportTitle;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Term;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_TermTitle;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              WindowBase;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_VRBattle_Info_C">();
	}
	static class UShop_VRBattle_Info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_VRBattle_Info_C>();
	}
};
static_assert(alignof(UShop_VRBattle_Info_C) == 0x000008, "Wrong alignment on UShop_VRBattle_Info_C");
static_assert(sizeof(UShop_VRBattle_Info_C) == 0x000468, "Wrong size on UShop_VRBattle_Info_C");
static_assert(offsetof(UShop_VRBattle_Info_C, BgLine) == 0x000360, "Member 'UShop_VRBattle_Info_C::BgLine' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Billboard_Bg) == 0x000368, "Member 'UShop_VRBattle_Info_C::Billboard_Bg' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Billboard_ReportImg) == 0x000370, "Member 'UShop_VRBattle_Info_C::Billboard_ReportImg' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, EndImage_0) == 0x000378, "Member 'UShop_VRBattle_Info_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, EndImage_1) == 0x000380, "Member 'UShop_VRBattle_Info_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, EndImage_2) == 0x000388, "Member 'UShop_VRBattle_Info_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, EndImage_3) == 0x000390, "Member 'UShop_VRBattle_Info_C::EndImage_3' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, EndImage_4) == 0x000398, "Member 'UShop_VRBattle_Info_C::EndImage_4' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, EndImage_5) == 0x0003A0, "Member 'UShop_VRBattle_Info_C::EndImage_5' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, EndImage_6) == 0x0003A8, "Member 'UShop_VRBattle_Info_C::EndImage_6' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Frame1) == 0x0003B0, "Member 'UShop_VRBattle_Info_C::Frame1' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Frame2) == 0x0003B8, "Member 'UShop_VRBattle_Info_C::Frame2' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Frame3) == 0x0003C0, "Member 'UShop_VRBattle_Info_C::Frame3' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Frame4) == 0x0003C8, "Member 'UShop_VRBattle_Info_C::Frame4' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Frame5) == 0x0003D0, "Member 'UShop_VRBattle_Info_C::Frame5' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Frame6) == 0x0003D8, "Member 'UShop_VRBattle_Info_C::Frame6' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, GoalBase) == 0x0003E0, "Member 'UShop_VRBattle_Info_C::GoalBase' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, IconLeft) == 0x0003E8, "Member 'UShop_VRBattle_Info_C::IconLeft' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, IconRight) == 0x0003F0, "Member 'UShop_VRBattle_Info_C::IconRight' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Img_Base_01) == 0x0003F8, "Member 'UShop_VRBattle_Info_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Left_Line) == 0x000400, "Member 'UShop_VRBattle_Info_C::Left_Line' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, LightBg01) == 0x000408, "Member 'UShop_VRBattle_Info_C::LightBg01' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Right_Line) == 0x000410, "Member 'UShop_VRBattle_Info_C::Right_Line' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, TermBase) == 0x000418, "Member 'UShop_VRBattle_Info_C::TermBase' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Title_Icon) == 0x000420, "Member 'UShop_VRBattle_Info_C::Title_Icon' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Txt_Goal) == 0x000428, "Member 'UShop_VRBattle_Info_C::Txt_Goal' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Txt_GoalTitle) == 0x000430, "Member 'UShop_VRBattle_Info_C::Txt_GoalTitle' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Txt_Info) == 0x000438, "Member 'UShop_VRBattle_Info_C::Txt_Info' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Txt_ReportNumber) == 0x000440, "Member 'UShop_VRBattle_Info_C::Txt_ReportNumber' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Txt_ReportTitle) == 0x000448, "Member 'UShop_VRBattle_Info_C::Txt_ReportTitle' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Txt_Term) == 0x000450, "Member 'UShop_VRBattle_Info_C::Txt_Term' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, Txt_TermTitle) == 0x000458, "Member 'UShop_VRBattle_Info_C::Txt_TermTitle' has a wrong offset!");
static_assert(offsetof(UShop_VRBattle_Info_C, WindowBase) == 0x000460, "Member 'UShop_VRBattle_Info_C::WindowBase' has a wrong offset!");

}

