#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_ItemInfo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_ItemInfo.Shop_ItemInfo_C
// 0x0130 (0x0788 - 0x0658)
class UShop_ItemInfo_C final : public UEndShopItemInfoWindow
{
public:
	class UWidgetAnimation*                       WeaponResetLayout;                                 // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       RecordLayout;                                      // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       KeyItemLayout;                                     // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ItemLayout;                                        // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       MateriaLayout;                                     // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       AccessoryLayout;                                   // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ArmorLayout;                                       // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponLayout;                                      // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponReset;                                       // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base1;                                             // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base2;                                             // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base3;                                             // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base4;                                             // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseSp;                                            // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Item;                                    // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Materia;                                 // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_Tips;                                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_WeaponUpgrade_CircleGauge3_C* CircleGauge;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_List_Compare_C*                   Compare_List;                                      // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_1;                                        // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_2;                                        // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_StatusCell_05_C*              EquipCell_Top;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_00;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Frame;                                         // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light;                                             // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light3;                                            // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LightBg00;                                         // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Tips;                                              // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TipsBase;                                          // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Attribute;                                     // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_AttributeTitle;                                // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Info;                                          // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Status;                                        // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_StatusTitle;                                   // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title3;                                        // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_ItemInfo_C">();
	}
	static class UShop_ItemInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_ItemInfo_C>();
	}
};
static_assert(alignof(UShop_ItemInfo_C) == 0x000008, "Wrong alignment on UShop_ItemInfo_C");
static_assert(sizeof(UShop_ItemInfo_C) == 0x000788, "Wrong size on UShop_ItemInfo_C");
static_assert(offsetof(UShop_ItemInfo_C, WeaponResetLayout) == 0x000658, "Member 'UShop_ItemInfo_C::WeaponResetLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, RecordLayout) == 0x000660, "Member 'UShop_ItemInfo_C::RecordLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, KeyItemLayout) == 0x000668, "Member 'UShop_ItemInfo_C::KeyItemLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, ItemLayout) == 0x000670, "Member 'UShop_ItemInfo_C::ItemLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, MateriaLayout) == 0x000678, "Member 'UShop_ItemInfo_C::MateriaLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, AccessoryLayout) == 0x000680, "Member 'UShop_ItemInfo_C::AccessoryLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, ArmorLayout) == 0x000688, "Member 'UShop_ItemInfo_C::ArmorLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, WeaponLayout) == 0x000690, "Member 'UShop_ItemInfo_C::WeaponLayout' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, WeaponReset) == 0x000698, "Member 'UShop_ItemInfo_C::WeaponReset' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Base1) == 0x0006A0, "Member 'UShop_ItemInfo_C::Base1' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Base2) == 0x0006A8, "Member 'UShop_ItemInfo_C::Base2' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Base3) == 0x0006B0, "Member 'UShop_ItemInfo_C::Base3' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Base4) == 0x0006B8, "Member 'UShop_ItemInfo_C::Base4' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, BaseSp) == 0x0006C0, "Member 'UShop_ItemInfo_C::BaseSp' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Billboard_Item) == 0x0006C8, "Member 'UShop_ItemInfo_C::Billboard_Item' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Billboard_Materia) == 0x0006D0, "Member 'UShop_ItemInfo_C::Billboard_Materia' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Billboard_Tips) == 0x0006D8, "Member 'UShop_ItemInfo_C::Billboard_Tips' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, CircleGauge) == 0x0006E0, "Member 'UShop_ItemInfo_C::CircleGauge' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Compare_List) == 0x0006E8, "Member 'UShop_ItemInfo_C::Compare_List' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, EndImage_1) == 0x0006F0, "Member 'UShop_ItemInfo_C::EndImage_1' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, EndImage_2) == 0x0006F8, "Member 'UShop_ItemInfo_C::EndImage_2' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, EquipCell_Top) == 0x000700, "Member 'UShop_ItemInfo_C::EquipCell_Top' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Img_Base_00) == 0x000708, "Member 'UShop_ItemInfo_C::Img_Base_00' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Img_Base_01) == 0x000710, "Member 'UShop_ItemInfo_C::Img_Base_01' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Img_Frame) == 0x000718, "Member 'UShop_ItemInfo_C::Img_Frame' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Light) == 0x000720, "Member 'UShop_ItemInfo_C::Light' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Light2) == 0x000728, "Member 'UShop_ItemInfo_C::Light2' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Light3) == 0x000730, "Member 'UShop_ItemInfo_C::Light3' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, LightBg00) == 0x000738, "Member 'UShop_ItemInfo_C::LightBg00' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Tips) == 0x000740, "Member 'UShop_ItemInfo_C::Tips' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, TipsBase) == 0x000748, "Member 'UShop_ItemInfo_C::TipsBase' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Attribute) == 0x000750, "Member 'UShop_ItemInfo_C::Txt_Attribute' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_AttributeTitle) == 0x000758, "Member 'UShop_ItemInfo_C::Txt_AttributeTitle' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Info) == 0x000760, "Member 'UShop_ItemInfo_C::Txt_Info' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Status) == 0x000768, "Member 'UShop_ItemInfo_C::Txt_Status' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_StatusTitle) == 0x000770, "Member 'UShop_ItemInfo_C::Txt_StatusTitle' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Title) == 0x000778, "Member 'UShop_ItemInfo_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UShop_ItemInfo_C, Txt_Title3) == 0x000780, "Member 'UShop_ItemInfo_C::Txt_Title3' has a wrong offset!");

}

