#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop_BtnLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop_BtnLight.Shop_BtnLight_C
// 0x0020 (0x0380 - 0x0360)
class UShop_BtnLight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hovered_Btn;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Shop_BtnLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_BtnLight_C">();
	}
	static class UShop_BtnLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_BtnLight_C>();
	}
};
static_assert(alignof(UShop_BtnLight_C) == 0x000008, "Wrong alignment on UShop_BtnLight_C");
static_assert(sizeof(UShop_BtnLight_C) == 0x000380, "Wrong size on UShop_BtnLight_C");
static_assert(offsetof(UShop_BtnLight_C, UberGraphFrame) == 0x000360, "Member 'UShop_BtnLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UShop_BtnLight_C, Loop) == 0x000368, "Member 'UShop_BtnLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UShop_BtnLight_C, Img_BtnLight) == 0x000370, "Member 'UShop_BtnLight_C::Img_BtnLight' has a wrong offset!");
static_assert(offsetof(UShop_BtnLight_C, Img_Hovered_Btn) == 0x000378, "Member 'UShop_BtnLight_C::Img_Hovered_Btn' has a wrong offset!");

}

