#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Shop

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Shop.Shop_C
// 0x0038 (0x0470 - 0x0438)
class UShop_C final : public UEndShopMenu
{
public:
	class UWidgetAnimation*                       ItemInfo_In;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       VRBattleInfo_In;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Footer_C*                         Shop_Foot;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_ItemInfo_C*                       Shop_ItemInfo;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_Menu_C*                           Shop_Menu;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShop_VRBattle_Info_C*                  Shop_VRBattleInfo;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Shop_C">();
	}
	static class UShop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UShop_C>();
	}
};
static_assert(alignof(UShop_C) == 0x000008, "Wrong alignment on UShop_C");
static_assert(sizeof(UShop_C) == 0x000470, "Wrong size on UShop_C");
static_assert(offsetof(UShop_C, ItemInfo_In) == 0x000438, "Member 'UShop_C::ItemInfo_In' has a wrong offset!");
static_assert(offsetof(UShop_C, VRBattleInfo_In) == 0x000440, "Member 'UShop_C::VRBattleInfo_In' has a wrong offset!");
static_assert(offsetof(UShop_C, In) == 0x000448, "Member 'UShop_C::In' has a wrong offset!");
static_assert(offsetof(UShop_C, Shop_Foot) == 0x000450, "Member 'UShop_C::Shop_Foot' has a wrong offset!");
static_assert(offsetof(UShop_C, Shop_ItemInfo) == 0x000458, "Member 'UShop_C::Shop_ItemInfo' has a wrong offset!");
static_assert(offsetof(UShop_C, Shop_Menu) == 0x000460, "Member 'UShop_C::Shop_Menu' has a wrong offset!");
static_assert(offsetof(UShop_C, Shop_VRBattleInfo) == 0x000468, "Member 'UShop_C::Shop_VRBattleInfo' has a wrong offset!");

}

