#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SkillName_Enemy

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SkillName_Enemy.SkillName_Enemy_C
// 0x0068 (0x03C8 - 0x0360)
class USkillName_Enemy_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       SkillName_Out;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       SkillName_In;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All;                                               // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_Nut;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Hrz_SkillName;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_NoGuard;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base01;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_02;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_EnemySkill_Base_00;                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        Pnl_SkillName_Mask;                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_SkillName;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SkillName_Enemy_C">();
	}
	static class USkillName_Enemy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillName_Enemy_C>();
	}
};
static_assert(alignof(USkillName_Enemy_C) == 0x000008, "Wrong alignment on USkillName_Enemy_C");
static_assert(sizeof(USkillName_Enemy_C) == 0x0003C8, "Wrong size on USkillName_Enemy_C");
static_assert(offsetof(USkillName_Enemy_C, SkillName_Out) == 0x000360, "Member 'USkillName_Enemy_C::SkillName_Out' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, SkillName_In) == 0x000368, "Member 'USkillName_Enemy_C::SkillName_In' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, All) == 0x000370, "Member 'USkillName_Enemy_C::All' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, All_Nut) == 0x000378, "Member 'USkillName_Enemy_C::All_Nut' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Hrz_SkillName) == 0x000380, "Member 'USkillName_Enemy_C::Hrz_SkillName' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Icon_NoGuard) == 0x000388, "Member 'USkillName_Enemy_C::Icon_NoGuard' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Img_Base01) == 0x000390, "Member 'USkillName_Enemy_C::Img_Base01' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Img_Effect_00) == 0x000398, "Member 'USkillName_Enemy_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Img_Effect_01) == 0x0003A0, "Member 'USkillName_Enemy_C::Img_Effect_01' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Img_Effect_02) == 0x0003A8, "Member 'USkillName_Enemy_C::Img_Effect_02' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Img_EnemySkill_Base_00) == 0x0003B0, "Member 'USkillName_Enemy_C::Img_EnemySkill_Base_00' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Pnl_SkillName_Mask) == 0x0003B8, "Member 'USkillName_Enemy_C::Pnl_SkillName_Mask' has a wrong offset!");
static_assert(offsetof(USkillName_Enemy_C, Txt_SkillName) == 0x0003C0, "Member 'USkillName_Enemy_C::Txt_SkillName' has a wrong offset!");

}

