#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Startmenu_btn00

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Startmenu_btn00.Startmenu_btn00_C
// 0x0048 (0x03A8 - 0x0360)
class UStartmenu_btn00_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Hovered;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStartmenu_BtnLight_C*                  Startmenu_BtnLight;                                // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Command;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClicked;                                         // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_63_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_Startmenu_btn00(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Startmenu_btn00_C">();
	}
	static class UStartmenu_btn00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartmenu_btn00_C>();
	}
};
static_assert(alignof(UStartmenu_btn00_C) == 0x000008, "Wrong alignment on UStartmenu_btn00_C");
static_assert(sizeof(UStartmenu_btn00_C) == 0x0003A8, "Wrong size on UStartmenu_btn00_C");
static_assert(offsetof(UStartmenu_btn00_C, UberGraphFrame) == 0x000360, "Member 'UStartmenu_btn00_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, In) == 0x000368, "Member 'UStartmenu_btn00_C::In' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Hovered) == 0x000370, "Member 'UStartmenu_btn00_C::Hovered' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Button_00) == 0x000378, "Member 'UStartmenu_btn00_C::Button_00' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Img_Hovered) == 0x000380, "Member 'UStartmenu_btn00_C::Img_Hovered' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Startmenu_BtnLight) == 0x000388, "Member 'UStartmenu_btn00_C::Startmenu_BtnLight' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, Txt_Command) == 0x000390, "Member 'UStartmenu_btn00_C::Txt_Command' has a wrong offset!");
static_assert(offsetof(UStartmenu_btn00_C, OnClicked) == 0x000398, "Member 'UStartmenu_btn00_C::OnClicked' has a wrong offset!");

}

