#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Startmenu_BtnLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Startmenu_BtnLight.Startmenu_BtnLight_C
// 0x0020 (0x0380 - 0x0360)
class UStartmenu_BtnLight_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_BtnLight;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Startmenu_BtnLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Startmenu_BtnLight_C">();
	}
	static class UStartmenu_BtnLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStartmenu_BtnLight_C>();
	}
};
static_assert(alignof(UStartmenu_BtnLight_C) == 0x000008, "Wrong alignment on UStartmenu_BtnLight_C");
static_assert(sizeof(UStartmenu_BtnLight_C) == 0x000380, "Wrong size on UStartmenu_BtnLight_C");
static_assert(offsetof(UStartmenu_BtnLight_C, UberGraphFrame) == 0x000360, "Member 'UStartmenu_BtnLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStartmenu_BtnLight_C, Loop) == 0x000368, "Member 'UStartmenu_BtnLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UStartmenu_BtnLight_C, BtnLight) == 0x000370, "Member 'UStartmenu_BtnLight_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UStartmenu_BtnLight_C, Img_BtnLight) == 0x000378, "Member 'UStartmenu_BtnLight_C::Img_BtnLight' has a wrong offset!");

}

