#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_LimitEffect_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_LimitEffect_00.Status_LimitEffect_00_C
// 0x0020 (0x0380 - 0x0360)
class UStatus_LimitEffect_00_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_LimitEffect_00_C">();
	}
	static class UStatus_LimitEffect_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_LimitEffect_00_C>();
	}
};
static_assert(alignof(UStatus_LimitEffect_00_C) == 0x000008, "Wrong alignment on UStatus_LimitEffect_00_C");
static_assert(sizeof(UStatus_LimitEffect_00_C) == 0x000380, "Wrong size on UStatus_LimitEffect_00_C");
static_assert(offsetof(UStatus_LimitEffect_00_C, Out) == 0x000360, "Member 'UStatus_LimitEffect_00_C::Out' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_00_C, In) == 0x000368, "Member 'UStatus_LimitEffect_00_C::In' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_00_C, Img_Effect_00) == 0x000370, "Member 'UStatus_LimitEffect_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UStatus_LimitEffect_00_C, Img_Effect_01) == 0x000378, "Member 'UStatus_LimitEffect_00_C::Img_Effect_01' has a wrong offset!");

}

