#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_SummonIcon

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_SummonIcon.Status_SummonIcon_C
// 0x0028 (0x0388 - 0x0360)
class UStatus_SummonIcon_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Summon;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_01;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_SummonIcon_C">();
	}
	static class UStatus_SummonIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_SummonIcon_C>();
	}
};
static_assert(alignof(UStatus_SummonIcon_C) == 0x000008, "Wrong alignment on UStatus_SummonIcon_C");
static_assert(sizeof(UStatus_SummonIcon_C) == 0x000388, "Wrong size on UStatus_SummonIcon_C");
static_assert(offsetof(UStatus_SummonIcon_C, Out) == 0x000360, "Member 'UStatus_SummonIcon_C::Out' has a wrong offset!");
static_assert(offsetof(UStatus_SummonIcon_C, In) == 0x000368, "Member 'UStatus_SummonIcon_C::In' has a wrong offset!");
static_assert(offsetof(UStatus_SummonIcon_C, Icon_Summon) == 0x000370, "Member 'UStatus_SummonIcon_C::Icon_Summon' has a wrong offset!");
static_assert(offsetof(UStatus_SummonIcon_C, Img_Effect_00) == 0x000378, "Member 'UStatus_SummonIcon_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UStatus_SummonIcon_C, Img_Effect_01) == 0x000380, "Member 'UStatus_SummonIcon_C::Img_Effect_01' has a wrong offset!");

}

