#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Status_HPBuff_00

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Status_HPBuff_00.Status_HPBuff_00_C
// 0x0030 (0x0390 - 0x0360)
class UStatus_HPBuff_00_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Circle;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_Light;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Status_HPBuff_00_C">();
	}
	static class UStatus_HPBuff_00_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStatus_HPBuff_00_C>();
	}
};
static_assert(alignof(UStatus_HPBuff_00_C) == 0x000008, "Wrong alignment on UStatus_HPBuff_00_C");
static_assert(sizeof(UStatus_HPBuff_00_C) == 0x000390, "Wrong size on UStatus_HPBuff_00_C");
static_assert(offsetof(UStatus_HPBuff_00_C, Out) == 0x000360, "Member 'UStatus_HPBuff_00_C::Out' has a wrong offset!");
static_assert(offsetof(UStatus_HPBuff_00_C, Loop) == 0x000368, "Member 'UStatus_HPBuff_00_C::Loop' has a wrong offset!");
static_assert(offsetof(UStatus_HPBuff_00_C, In) == 0x000370, "Member 'UStatus_HPBuff_00_C::In' has a wrong offset!");
static_assert(offsetof(UStatus_HPBuff_00_C, Img_Effect_00) == 0x000378, "Member 'UStatus_HPBuff_00_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UStatus_HPBuff_00_C, Img_Effect_Circle) == 0x000380, "Member 'UStatus_HPBuff_00_C::Img_Effect_Circle' has a wrong offset!");
static_assert(offsetof(UStatus_HPBuff_00_C, Img_Effect_Light) == 0x000388, "Member 'UStatus_HPBuff_00_C::Img_Effect_Light' has a wrong offset!");

}

