#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Story_ChapterInfo

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Story_ChapterInfo.Story_ChapterInfo_C
// 0x0018 (0x0378 - 0x0360)
class UStory_ChapterInfo_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Menu_In;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndBillboard*                          Billboard_SideImg;                                 // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Title_Line;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Story_ChapterInfo_C">();
	}
	static class UStory_ChapterInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStory_ChapterInfo_C>();
	}
};
static_assert(alignof(UStory_ChapterInfo_C) == 0x000008, "Wrong alignment on UStory_ChapterInfo_C");
static_assert(sizeof(UStory_ChapterInfo_C) == 0x000378, "Wrong size on UStory_ChapterInfo_C");
static_assert(offsetof(UStory_ChapterInfo_C, Menu_In) == 0x000360, "Member 'UStory_ChapterInfo_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, Billboard_SideImg) == 0x000368, "Member 'UStory_ChapterInfo_C::Billboard_SideImg' has a wrong offset!");
static_assert(offsetof(UStory_ChapterInfo_C, Title_Line) == 0x000370, "Member 'UStory_ChapterInfo_C::Title_Line' has a wrong offset!");

}

