#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Story_Cell_03

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Story_Cell_03.Story_Cell_03_C
// 0x0190 (0x04F0 - 0x0360)
class UStory_Cell_03_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       CharaName_Active;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CharaName;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Category_Side;                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Category_Main;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_SideClosed;                               // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_SideClosed;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Chapter;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_SideClear;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Side;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_SideClear;                              // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Side;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_ChildClear;                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main_Child;                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_ChildClear;                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main_Child;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_MainClear;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Main;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_MainClear;                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnUnHover_Main;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Category_Side;                                     // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Category_Main;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Chapter;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Child;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Child_S;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Main;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnBase_Side2;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase_Main;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase_Side;                                 // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2_Side;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight4;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Category_Btn;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              CharaName_Line;                                    // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DotBase;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              DotWaku;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             EndButton_0;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Active;                                       // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_MainStory;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Icon_SideStory;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Line00;                                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Side_Btn;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Story_Btn;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Story_Line;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Story_Line2;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Story_Line_Category;                               // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              UnderLine;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Story_Cell_03_C">();
	}
	static class UStory_Cell_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStory_Cell_03_C>();
	}
};
static_assert(alignof(UStory_Cell_03_C) == 0x000008, "Wrong alignment on UStory_Cell_03_C");
static_assert(sizeof(UStory_Cell_03_C) == 0x0004F0, "Wrong size on UStory_Cell_03_C");
static_assert(offsetof(UStory_Cell_03_C, CharaName_Active) == 0x000360, "Member 'UStory_Cell_03_C::CharaName_Active' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, CharaName) == 0x000368, "Member 'UStory_Cell_03_C::CharaName' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Category_Side) == 0x000370, "Member 'UStory_Cell_03_C::BtnHover_Category_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Category_Main) == 0x000378, "Member 'UStory_Cell_03_C::BtnHover_Category_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_SideClosed) == 0x000380, "Member 'UStory_Cell_03_C::BtnHover_SideClosed' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_SideClosed) == 0x000388, "Member 'UStory_Cell_03_C::BtnUnHover_SideClosed' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Chapter) == 0x000390, "Member 'UStory_Cell_03_C::BtnUnHover_Chapter' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_SideClear) == 0x000398, "Member 'UStory_Cell_03_C::BtnHover_SideClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Side) == 0x0003A0, "Member 'UStory_Cell_03_C::BtnHover_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_SideClear) == 0x0003A8, "Member 'UStory_Cell_03_C::BtnUnHover_SideClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Side) == 0x0003B0, "Member 'UStory_Cell_03_C::BtnUnHover_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_ChildClear) == 0x0003B8, "Member 'UStory_Cell_03_C::BtnHover_Main_ChildClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main_Child) == 0x0003C0, "Member 'UStory_Cell_03_C::BtnHover_Main_Child' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_ChildClear) == 0x0003C8, "Member 'UStory_Cell_03_C::BtnUnHover_Main_ChildClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main_Child) == 0x0003D0, "Member 'UStory_Cell_03_C::BtnUnHover_Main_Child' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_MainClear) == 0x0003D8, "Member 'UStory_Cell_03_C::BtnHover_MainClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Main) == 0x0003E0, "Member 'UStory_Cell_03_C::BtnHover_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_MainClear) == 0x0003E8, "Member 'UStory_Cell_03_C::BtnUnHover_MainClear' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnUnHover_Main) == 0x0003F0, "Member 'UStory_Cell_03_C::BtnUnHover_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Category_Side) == 0x0003F8, "Member 'UStory_Cell_03_C::Category_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Category_Main) == 0x000400, "Member 'UStory_Cell_03_C::Category_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHover_Chapter) == 0x000408, "Member 'UStory_Cell_03_C::BtnHover_Chapter' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Child) == 0x000410, "Member 'UStory_Cell_03_C::BtnBase_Child' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Child_S) == 0x000418, "Member 'UStory_Cell_03_C::BtnBase_Child_S' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Main) == 0x000420, "Member 'UStory_Cell_03_C::BtnBase_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnBase_Side2) == 0x000428, "Member 'UStory_Cell_03_C::BtnBase_Side2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHoverBase) == 0x000430, "Member 'UStory_Cell_03_C::BtnHoverBase' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHoverBase_Main) == 0x000438, "Member 'UStory_Cell_03_C::BtnHoverBase_Main' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnHoverBase_Side) == 0x000440, "Member 'UStory_Cell_03_C::BtnHoverBase_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight) == 0x000448, "Member 'UStory_Cell_03_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight2) == 0x000450, "Member 'UStory_Cell_03_C::BtnLight2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight2_Side) == 0x000458, "Member 'UStory_Cell_03_C::BtnLight2_Side' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, BtnLight4) == 0x000460, "Member 'UStory_Cell_03_C::BtnLight4' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Category_Btn) == 0x000468, "Member 'UStory_Cell_03_C::Category_Btn' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, CharaName_Line) == 0x000470, "Member 'UStory_Cell_03_C::CharaName_Line' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, DotBase) == 0x000478, "Member 'UStory_Cell_03_C::DotBase' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, DotWaku) == 0x000480, "Member 'UStory_Cell_03_C::DotWaku' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, EndButton_0) == 0x000488, "Member 'UStory_Cell_03_C::EndButton_0' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Icon_Active) == 0x000490, "Member 'UStory_Cell_03_C::Icon_Active' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Icon_MainStory) == 0x000498, "Member 'UStory_Cell_03_C::Icon_MainStory' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Icon_SideStory) == 0x0004A0, "Member 'UStory_Cell_03_C::Icon_SideStory' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Line00) == 0x0004A8, "Member 'UStory_Cell_03_C::Line00' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, MainMenu_Btn) == 0x0004B0, "Member 'UStory_Cell_03_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Side_Btn) == 0x0004B8, "Member 'UStory_Cell_03_C::Side_Btn' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Btn) == 0x0004C0, "Member 'UStory_Cell_03_C::Story_Btn' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Line) == 0x0004C8, "Member 'UStory_Cell_03_C::Story_Line' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Line2) == 0x0004D0, "Member 'UStory_Cell_03_C::Story_Line2' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Story_Line_Category) == 0x0004D8, "Member 'UStory_Cell_03_C::Story_Line_Category' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, Txt_Title) == 0x0004E0, "Member 'UStory_Cell_03_C::Txt_Title' has a wrong offset!");
static_assert(offsetof(UStory_Cell_03_C, UnderLine) == 0x0004E8, "Member 'UStory_Cell_03_C::UnderLine' has a wrong offset!");

}

