#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SummonTimeGauge

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SummonTimeGauge.SummonTimeGauge_C
// 0x0040 (0x0438 - 0x03F8)
class USummonTimeGauge_C final : public UEndBattleSummonGaugeIcon
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              EndImage_0;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndProgressBar*                        Gauge_SummonTime;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_GaugeBase;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           Img_Light_Horizontal_00;                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SummonTimeGauge_C">();
	}
	static class USummonTimeGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USummonTimeGauge_C>();
	}
};
static_assert(alignof(USummonTimeGauge_C) == 0x000008, "Wrong alignment on USummonTimeGauge_C");
static_assert(sizeof(USummonTimeGauge_C) == 0x000438, "Wrong size on USummonTimeGauge_C");
static_assert(offsetof(USummonTimeGauge_C, Out) == 0x0003F8, "Member 'USummonTimeGauge_C::Out' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Loop) == 0x000400, "Member 'USummonTimeGauge_C::Loop' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, In) == 0x000408, "Member 'USummonTimeGauge_C::In' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, EndImage_0) == 0x000410, "Member 'USummonTimeGauge_C::EndImage_0' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Gauge_SummonTime) == 0x000418, "Member 'USummonTimeGauge_C::Gauge_SummonTime' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Img_Base) == 0x000420, "Member 'USummonTimeGauge_C::Img_Base' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Img_GaugeBase) == 0x000428, "Member 'USummonTimeGauge_C::Img_GaugeBase' has a wrong offset!");
static_assert(offsetof(USummonTimeGauge_C, Img_Light_Horizontal_00) == 0x000430, "Member 'USummonTimeGauge_C::Img_Light_Horizontal_00' has a wrong offset!");

}

