#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkLogs_Cell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TalkLogs_Cell.TalkLogs_Cell_C
// 0x0038 (0x0398 - 0x0360)
class UTalkLogs_Cell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       In;                                                // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_TalkLogs_Cell;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           BG_00;                                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImageSet*                           BG_01;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Effect_00;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Message;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_TalkLogs_Cell(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TalkLogs_Cell_C">();
	}
	static class UTalkLogs_Cell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTalkLogs_Cell_C>();
	}
};
static_assert(alignof(UTalkLogs_Cell_C) == 0x000008, "Wrong alignment on UTalkLogs_Cell_C");
static_assert(sizeof(UTalkLogs_Cell_C) == 0x000398, "Wrong size on UTalkLogs_Cell_C");
static_assert(offsetof(UTalkLogs_Cell_C, UberGraphFrame) == 0x000360, "Member 'UTalkLogs_Cell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTalkLogs_Cell_C, In) == 0x000368, "Member 'UTalkLogs_Cell_C::In' has a wrong offset!");
static_assert(offsetof(UTalkLogs_Cell_C, All_TalkLogs_Cell) == 0x000370, "Member 'UTalkLogs_Cell_C::All_TalkLogs_Cell' has a wrong offset!");
static_assert(offsetof(UTalkLogs_Cell_C, BG_00) == 0x000378, "Member 'UTalkLogs_Cell_C::BG_00' has a wrong offset!");
static_assert(offsetof(UTalkLogs_Cell_C, BG_01) == 0x000380, "Member 'UTalkLogs_Cell_C::BG_01' has a wrong offset!");
static_assert(offsetof(UTalkLogs_Cell_C, Img_Effect_00) == 0x000388, "Member 'UTalkLogs_Cell_C::Img_Effect_00' has a wrong offset!");
static_assert(offsetof(UTalkLogs_Cell_C, Message) == 0x000390, "Member 'UTalkLogs_Cell_C::Message' has a wrong offset!");

}

