#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TalkMenu_Center_Btn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass TalkMenu_Center_Btn.TalkMenu_Center_Btn_C
// 0x0048 (0x03A8 - 0x0360)
class UTalkMenu_Center_Btn_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnPress;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndCanvasPanel*                        All_TalkMenu_Center_Btn;                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Btn_Light2;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             Button_00;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt;                                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TalkMenu_Center_Btn(int32 EntryPoint);
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_338_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_00_K2Node_ComponentBoundEvent_351_OnButtonHoverEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TalkMenu_Center_Btn_C">();
	}
	static class UTalkMenu_Center_Btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTalkMenu_Center_Btn_C>();
	}
};
static_assert(alignof(UTalkMenu_Center_Btn_C) == 0x000008, "Wrong alignment on UTalkMenu_Center_Btn_C");
static_assert(sizeof(UTalkMenu_Center_Btn_C) == 0x0003A8, "Wrong size on UTalkMenu_Center_Btn_C");
static_assert(offsetof(UTalkMenu_Center_Btn_C, UberGraphFrame) == 0x000360, "Member 'UTalkMenu_Center_Btn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_Btn_C, Loop) == 0x000368, "Member 'UTalkMenu_Center_Btn_C::Loop' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_Btn_C, BtnPress) == 0x000370, "Member 'UTalkMenu_Center_Btn_C::BtnPress' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_Btn_C, BtnHover) == 0x000378, "Member 'UTalkMenu_Center_Btn_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_Btn_C, All_TalkMenu_Center_Btn) == 0x000380, "Member 'UTalkMenu_Center_Btn_C::All_TalkMenu_Center_Btn' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_Btn_C, Btn_Light) == 0x000388, "Member 'UTalkMenu_Center_Btn_C::Btn_Light' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_Btn_C, Btn_Light2) == 0x000390, "Member 'UTalkMenu_Center_Btn_C::Btn_Light2' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_Btn_C, Button_00) == 0x000398, "Member 'UTalkMenu_Center_Btn_C::Button_00' has a wrong offset!");
static_assert(offsetof(UTalkMenu_Center_Btn_C, Txt) == 0x0003A0, "Member 'UTalkMenu_Center_Btn_C::Txt' has a wrong offset!");

}

