#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Timer_Num

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Timer_Num.Timer_Num_C
// 0x0150 (0x04B0 - 0x0360)
class UTimer_Num_C final : public UEndUserWidget
{
public:
	class UEndImage*                              Img_Num0_Blue;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num0_Red;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num1_Blue;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num1_Red;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num2_Blue;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num2_Red;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num3_Blue;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num3_Red;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num4_Blue;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num4_Red;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num5_Blue;                                     // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num5_Red;                                      // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num6_Blue;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num6_Red;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num7_Blue;                                     // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num7_Red;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num8_Blue;                                     // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num8_Red;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num9_Blue;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Num9_Red;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_00;                               // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_01;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_02;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_03;                               // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_04;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_05;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_06;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_07;                               // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_08;                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Blue_09;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_00;                                // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_01;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_02;                                // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_03;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_04;                                // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_05;                                // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_06;                                // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_07;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_08;                                // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Reflect_Red_09;                                // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Nut_Blue;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Nut_Red;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Timer_Num_C">();
	}
	static class UTimer_Num_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTimer_Num_C>();
	}
};
static_assert(alignof(UTimer_Num_C) == 0x000008, "Wrong alignment on UTimer_Num_C");
static_assert(sizeof(UTimer_Num_C) == 0x0004B0, "Wrong size on UTimer_Num_C");
static_assert(offsetof(UTimer_Num_C, Img_Num0_Blue) == 0x000360, "Member 'UTimer_Num_C::Img_Num0_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num0_Red) == 0x000368, "Member 'UTimer_Num_C::Img_Num0_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num1_Blue) == 0x000370, "Member 'UTimer_Num_C::Img_Num1_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num1_Red) == 0x000378, "Member 'UTimer_Num_C::Img_Num1_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num2_Blue) == 0x000380, "Member 'UTimer_Num_C::Img_Num2_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num2_Red) == 0x000388, "Member 'UTimer_Num_C::Img_Num2_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num3_Blue) == 0x000390, "Member 'UTimer_Num_C::Img_Num3_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num3_Red) == 0x000398, "Member 'UTimer_Num_C::Img_Num3_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num4_Blue) == 0x0003A0, "Member 'UTimer_Num_C::Img_Num4_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num4_Red) == 0x0003A8, "Member 'UTimer_Num_C::Img_Num4_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num5_Blue) == 0x0003B0, "Member 'UTimer_Num_C::Img_Num5_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num5_Red) == 0x0003B8, "Member 'UTimer_Num_C::Img_Num5_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num6_Blue) == 0x0003C0, "Member 'UTimer_Num_C::Img_Num6_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num6_Red) == 0x0003C8, "Member 'UTimer_Num_C::Img_Num6_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num7_Blue) == 0x0003D0, "Member 'UTimer_Num_C::Img_Num7_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num7_Red) == 0x0003D8, "Member 'UTimer_Num_C::Img_Num7_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num8_Blue) == 0x0003E0, "Member 'UTimer_Num_C::Img_Num8_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num8_Red) == 0x0003E8, "Member 'UTimer_Num_C::Img_Num8_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num9_Blue) == 0x0003F0, "Member 'UTimer_Num_C::Img_Num9_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Num9_Red) == 0x0003F8, "Member 'UTimer_Num_C::Img_Num9_Red' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_00) == 0x000400, "Member 'UTimer_Num_C::Img_Reflect_Blue_00' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_01) == 0x000408, "Member 'UTimer_Num_C::Img_Reflect_Blue_01' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_02) == 0x000410, "Member 'UTimer_Num_C::Img_Reflect_Blue_02' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_03) == 0x000418, "Member 'UTimer_Num_C::Img_Reflect_Blue_03' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_04) == 0x000420, "Member 'UTimer_Num_C::Img_Reflect_Blue_04' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_05) == 0x000428, "Member 'UTimer_Num_C::Img_Reflect_Blue_05' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_06) == 0x000430, "Member 'UTimer_Num_C::Img_Reflect_Blue_06' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_07) == 0x000438, "Member 'UTimer_Num_C::Img_Reflect_Blue_07' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_08) == 0x000440, "Member 'UTimer_Num_C::Img_Reflect_Blue_08' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Blue_09) == 0x000448, "Member 'UTimer_Num_C::Img_Reflect_Blue_09' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_00) == 0x000450, "Member 'UTimer_Num_C::Img_Reflect_Red_00' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_01) == 0x000458, "Member 'UTimer_Num_C::Img_Reflect_Red_01' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_02) == 0x000460, "Member 'UTimer_Num_C::Img_Reflect_Red_02' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_03) == 0x000468, "Member 'UTimer_Num_C::Img_Reflect_Red_03' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_04) == 0x000470, "Member 'UTimer_Num_C::Img_Reflect_Red_04' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_05) == 0x000478, "Member 'UTimer_Num_C::Img_Reflect_Red_05' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_06) == 0x000480, "Member 'UTimer_Num_C::Img_Reflect_Red_06' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_07) == 0x000488, "Member 'UTimer_Num_C::Img_Reflect_Red_07' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_08) == 0x000490, "Member 'UTimer_Num_C::Img_Reflect_Red_08' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Img_Reflect_Red_09) == 0x000498, "Member 'UTimer_Num_C::Img_Reflect_Red_09' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Nut_Blue) == 0x0004A0, "Member 'UTimer_Num_C::Nut_Blue' has a wrong offset!");
static_assert(offsetof(UTimer_Num_C, Nut_Red) == 0x0004A8, "Member 'UTimer_Num_C::Nut_Red' has a wrong offset!");

}

