#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VE1002_00_Daytona_Standard

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass VE1002_00_Daytona_Standard.VE1002_00_Daytona_Standard_C
// 0x0130 (0x19C0 - 0x1890)
class UVE1002_00_Daytona_Standard_C final : public UEndAnimVehicleInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1890(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_9D90A14E4B7730099AD139949352A73B; // 0x1898(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_C996F813425D606AF3F0C29B143B7724; // 0x18E0(0x0068)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_55A936CC4C419758632E84B9AA766EED; // 0x1948(0x0030)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_F3B06BD2470769A9F23CDA85451C2BC1; // 0x1978(0x0048)()

public:
	void ExecuteUbergraph_VE1002_00_Daytona_Standard(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VE1002_00_Daytona_Standard_C">();
	}
	static class UVE1002_00_Daytona_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVE1002_00_Daytona_Standard_C>();
	}
};
static_assert(alignof(UVE1002_00_Daytona_Standard_C) == 0x000008, "Wrong alignment on UVE1002_00_Daytona_Standard_C");
static_assert(sizeof(UVE1002_00_Daytona_Standard_C) == 0x0019C0, "Wrong size on UVE1002_00_Daytona_Standard_C");
static_assert(offsetof(UVE1002_00_Daytona_Standard_C, UberGraphFrame) == 0x001890, "Member 'UVE1002_00_Daytona_Standard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVE1002_00_Daytona_Standard_C, AnimGraphNode_Root_9D90A14E4B7730099AD139949352A73B) == 0x001898, "Member 'UVE1002_00_Daytona_Standard_C::AnimGraphNode_Root_9D90A14E4B7730099AD139949352A73B' has a wrong offset!");
static_assert(offsetof(UVE1002_00_Daytona_Standard_C, AnimGraphNode_Slot_C996F813425D606AF3F0C29B143B7724) == 0x0018E0, "Member 'UVE1002_00_Daytona_Standard_C::AnimGraphNode_Slot_C996F813425D606AF3F0C29B143B7724' has a wrong offset!");
static_assert(offsetof(UVE1002_00_Daytona_Standard_C, AnimGraphNode_EndBehavior_55A936CC4C419758632E84B9AA766EED) == 0x001948, "Member 'UVE1002_00_Daytona_Standard_C::AnimGraphNode_EndBehavior_55A936CC4C419758632E84B9AA766EED' has a wrong offset!");
static_assert(offsetof(UVE1002_00_Daytona_Standard_C, AnimGraphNode_EndSaveLastPose_F3B06BD2470769A9F23CDA85451C2BC1) == 0x001978, "Member 'UVE1002_00_Daytona_Standard_C::AnimGraphNode_EndSaveLastPose_F3B06BD2470769A9F23CDA85451C2BC1' has a wrong offset!");

}

