#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VE2003_00_Trike_Standard

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EndGame_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass VE2003_00_Trike_Standard.VE2003_00_Trike_Standard_C
// 0x0130 (0x19C0 - 0x1890)
class UVE2003_00_Trike_Standard_C final : public UEndAnimVehicleInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1890(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_81225FBE4DDD2B68B4B94ABAEB900846; // 0x1898(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_D02B91644E24C090A5142C8213898992; // 0x18E0(0x0068)()
	struct FAnimNode_EndBehavior                  AnimGraphNode_EndBehavior_E7C5D92949DBACC15E3BA7A800059E8B; // 0x1948(0x0030)()
	struct FAnimNode_EndSaveLastPose              AnimGraphNode_EndSaveLastPose_399551114CD841FE83CC59A80F2D06A7; // 0x1978(0x0048)()

public:
	void ExecuteUbergraph_VE2003_00_Trike_Standard(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VE2003_00_Trike_Standard_C">();
	}
	static class UVE2003_00_Trike_Standard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVE2003_00_Trike_Standard_C>();
	}
};
static_assert(alignof(UVE2003_00_Trike_Standard_C) == 0x000008, "Wrong alignment on UVE2003_00_Trike_Standard_C");
static_assert(sizeof(UVE2003_00_Trike_Standard_C) == 0x0019C0, "Wrong size on UVE2003_00_Trike_Standard_C");
static_assert(offsetof(UVE2003_00_Trike_Standard_C, UberGraphFrame) == 0x001890, "Member 'UVE2003_00_Trike_Standard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVE2003_00_Trike_Standard_C, AnimGraphNode_Root_81225FBE4DDD2B68B4B94ABAEB900846) == 0x001898, "Member 'UVE2003_00_Trike_Standard_C::AnimGraphNode_Root_81225FBE4DDD2B68B4B94ABAEB900846' has a wrong offset!");
static_assert(offsetof(UVE2003_00_Trike_Standard_C, AnimGraphNode_Slot_D02B91644E24C090A5142C8213898992) == 0x0018E0, "Member 'UVE2003_00_Trike_Standard_C::AnimGraphNode_Slot_D02B91644E24C090A5142C8213898992' has a wrong offset!");
static_assert(offsetof(UVE2003_00_Trike_Standard_C, AnimGraphNode_EndBehavior_E7C5D92949DBACC15E3BA7A800059E8B) == 0x001948, "Member 'UVE2003_00_Trike_Standard_C::AnimGraphNode_EndBehavior_E7C5D92949DBACC15E3BA7A800059E8B' has a wrong offset!");
static_assert(offsetof(UVE2003_00_Trike_Standard_C, AnimGraphNode_EndSaveLastPose_399551114CD841FE83CC59A80F2D06A7) == 0x001978, "Member 'UVE2003_00_Trike_Standard_C::AnimGraphNode_EndSaveLastPose_399551114CD841FE83CC59A80F2D06A7' has a wrong offset!");

}

