#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_ListItemLight

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_ListItemLight.VR_ListItemLight_C
// 0x0028 (0x03B8 - 0x0390)
class UVR_ListItemLight_C final : public UEndMainItemSelectBtnText
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight2;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              HoverBase;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VR_ListItemLight(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_ListItemLight_C">();
	}
	static class UVR_ListItemLight_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_ListItemLight_C>();
	}
};
static_assert(alignof(UVR_ListItemLight_C) == 0x000008, "Wrong alignment on UVR_ListItemLight_C");
static_assert(sizeof(UVR_ListItemLight_C) == 0x0003B8, "Wrong size on UVR_ListItemLight_C");
static_assert(offsetof(UVR_ListItemLight_C, UberGraphFrame) == 0x000390, "Member 'UVR_ListItemLight_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVR_ListItemLight_C, Loop) == 0x000398, "Member 'UVR_ListItemLight_C::Loop' has a wrong offset!");
static_assert(offsetof(UVR_ListItemLight_C, BtnLight) == 0x0003A0, "Member 'UVR_ListItemLight_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UVR_ListItemLight_C, BtnLight2) == 0x0003A8, "Member 'UVR_ListItemLight_C::BtnLight2' has a wrong offset!");
static_assert(offsetof(UVR_ListItemLight_C, HoverBase) == 0x0003B0, "Member 'UVR_ListItemLight_C::HoverBase' has a wrong offset!");

}

