#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_SelectCell

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_SelectCell.VR_SelectCell_C
// 0x0068 (0x03C8 - 0x0360)
class UVR_SelectCell_C final : public UEndUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Normal;                                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover_Selected;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       BtnHover;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseC;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnHoverBase;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BtnLight;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMainMenu_Cell_Light2_C*                Cell_Lighting;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndButton*                             MainMenu_Btn;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Title;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VR_SelectCell(int32 EntryPoint);
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainMenu_Btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_SelectCell_C">();
	}
	static class UVR_SelectCell_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_SelectCell_C>();
	}
};
static_assert(alignof(UVR_SelectCell_C) == 0x000008, "Wrong alignment on UVR_SelectCell_C");
static_assert(sizeof(UVR_SelectCell_C) == 0x0003C8, "Wrong size on UVR_SelectCell_C");
static_assert(offsetof(UVR_SelectCell_C, UberGraphFrame) == 0x000360, "Member 'UVR_SelectCell_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Normal) == 0x000368, "Member 'UVR_SelectCell_C::Normal' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, BtnHover_Selected) == 0x000370, "Member 'UVR_SelectCell_C::BtnHover_Selected' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Selected) == 0x000378, "Member 'UVR_SelectCell_C::Selected' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, BtnHover) == 0x000380, "Member 'UVR_SelectCell_C::BtnHover' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, BaseC) == 0x000388, "Member 'UVR_SelectCell_C::BaseC' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, BtnHoverBase) == 0x000390, "Member 'UVR_SelectCell_C::BtnHoverBase' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, BtnLight) == 0x000398, "Member 'UVR_SelectCell_C::BtnLight' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Cell_Lighting) == 0x0003A0, "Member 'UVR_SelectCell_C::Cell_Lighting' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, FrameC) == 0x0003A8, "Member 'UVR_SelectCell_C::FrameC' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, MainMenu_Btn) == 0x0003B0, "Member 'UVR_SelectCell_C::MainMenu_Btn' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Txt_Num) == 0x0003B8, "Member 'UVR_SelectCell_C::Txt_Num' has a wrong offset!");
static_assert(offsetof(UVR_SelectCell_C, Txt_Title) == 0x0003C0, "Member 'UVR_SelectCell_C::Txt_Title' has a wrong offset!");

}

