#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VR_Top

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VR_Top.VR_Top_C
// 0x00F0 (0x06D0 - 0x05E0)
class UVR_Top_C final : public UEndColosseumMenu
{
public:
	class UWidgetAnimation*                       Menu_Out;                                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       DifficultyWindow_In;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToStart;                                           // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       ToCourse;                                          // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Menu_In;                                           // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseC1;                                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseC2;                                            // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BaseC3;                                            // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BG;                                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              BlackBase;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVR_CountDown_C*                        CountDown;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC1;                                           // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC2;                                           // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              FrameC3;                                           // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Icon_Leader;                                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine;                                          // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              LeftLine0;                                         // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light1;                                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Light2;                                            // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTiledImage*                         ListBg2;                                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              ListEndIcon;                                       // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Logo;                                              // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MarkBase;                                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              MarkFrame;                                         // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLight;                                        // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLight2;                                       // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              TitleLine;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num1;                                          // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num2;                                          // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndTextBlock*                          Txt_Num3;                                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VR_Top_C">();
	}
	static class UVR_Top_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVR_Top_C>();
	}
};
static_assert(alignof(UVR_Top_C) == 0x000008, "Wrong alignment on UVR_Top_C");
static_assert(sizeof(UVR_Top_C) == 0x0006D0, "Wrong size on UVR_Top_C");
static_assert(offsetof(UVR_Top_C, Menu_Out) == 0x0005E0, "Member 'UVR_Top_C::Menu_Out' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, DifficultyWindow_In) == 0x0005E8, "Member 'UVR_Top_C::DifficultyWindow_In' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, ToStart) == 0x0005F0, "Member 'UVR_Top_C::ToStart' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, ToCourse) == 0x0005F8, "Member 'UVR_Top_C::ToCourse' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, Menu_In) == 0x000600, "Member 'UVR_Top_C::Menu_In' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, BaseC1) == 0x000608, "Member 'UVR_Top_C::BaseC1' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, BaseC2) == 0x000610, "Member 'UVR_Top_C::BaseC2' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, BaseC3) == 0x000618, "Member 'UVR_Top_C::BaseC3' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, BG) == 0x000620, "Member 'UVR_Top_C::BG' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, BlackBase) == 0x000628, "Member 'UVR_Top_C::BlackBase' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, CountDown) == 0x000630, "Member 'UVR_Top_C::CountDown' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, FrameC1) == 0x000638, "Member 'UVR_Top_C::FrameC1' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, FrameC2) == 0x000640, "Member 'UVR_Top_C::FrameC2' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, FrameC3) == 0x000648, "Member 'UVR_Top_C::FrameC3' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, Icon_Leader) == 0x000650, "Member 'UVR_Top_C::Icon_Leader' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, LeftLine) == 0x000658, "Member 'UVR_Top_C::LeftLine' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, LeftLine0) == 0x000660, "Member 'UVR_Top_C::LeftLine0' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, Light1) == 0x000668, "Member 'UVR_Top_C::Light1' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, Light2) == 0x000670, "Member 'UVR_Top_C::Light2' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, ListBg2) == 0x000678, "Member 'UVR_Top_C::ListBg2' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, ListEndIcon) == 0x000680, "Member 'UVR_Top_C::ListEndIcon' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, Logo) == 0x000688, "Member 'UVR_Top_C::Logo' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, MarkBase) == 0x000690, "Member 'UVR_Top_C::MarkBase' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, MarkFrame) == 0x000698, "Member 'UVR_Top_C::MarkFrame' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, TitleLight) == 0x0006A0, "Member 'UVR_Top_C::TitleLight' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, TitleLight2) == 0x0006A8, "Member 'UVR_Top_C::TitleLight2' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, TitleLine) == 0x0006B0, "Member 'UVR_Top_C::TitleLine' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, Txt_Num1) == 0x0006B8, "Member 'UVR_Top_C::Txt_Num1' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, Txt_Num2) == 0x0006C0, "Member 'UVR_Top_C::Txt_Num2' has a wrong offset!");
static_assert(offsetof(UVR_Top_C, Txt_Num3) == 0x0006C8, "Member 'UVR_Top_C::Txt_Num3' has a wrong offset!");

}

