#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WaitMode

#include "Basic.hpp"

#include "EndGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WaitMode.WaitMode_C
// 0x0028 (0x0388 - 0x0360)
class UWaitMode_C final : public UEndUserWidget
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Base_Add;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEndImage*                              Img_Base_01;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WaitMode_C">();
	}
	static class UWaitMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWaitMode_C>();
	}
};
static_assert(alignof(UWaitMode_C) == 0x000008, "Wrong alignment on UWaitMode_C");
static_assert(sizeof(UWaitMode_C) == 0x000388, "Wrong size on UWaitMode_C");
static_assert(offsetof(UWaitMode_C, Out) == 0x000360, "Member 'UWaitMode_C::Out' has a wrong offset!");
static_assert(offsetof(UWaitMode_C, Loop) == 0x000368, "Member 'UWaitMode_C::Loop' has a wrong offset!");
static_assert(offsetof(UWaitMode_C, In) == 0x000370, "Member 'UWaitMode_C::In' has a wrong offset!");
static_assert(offsetof(UWaitMode_C, Base_Add) == 0x000378, "Member 'UWaitMode_C::Base_Add' has a wrong offset!");
static_assert(offsetof(UWaitMode_C, Img_Base_01) == 0x000380, "Member 'UWaitMode_C::Img_Base_01' has a wrong offset!");

}

